      *================================================================*00001003
       IDENTIFICATION                            DIVISION.              00002003
      *================================================================*00002103
                                                                        00002203
       PROGRAM-ID.  FR05DB01.                                           00002303
       AUTHOR.      DOUGLAS COSTA                                       00002403
                                                                        00002503
      *================================================================*00002603
      *                         F O U R S Y S                          *00002703
      *================================================================*00002803
      *    PROGRAMA...: FR05DB01                                       *00002903
      *    TIPO.......: SERVICO DE ACESSO A DADOS                      *00003003
      *----------------------------------------------------------------*00003103
      *    PROGAMADOR.: DOUGLAS COSTA                                  *00003203
      *    EMPRESA....: FOURSYS                                        *00003303
      *    ANALISTA...: IVAN SANCHES                                   *00003403
      *    DATA.......: 03/06/2022                                     *00003503
      *----------------------------------------------------------------*00003603
      *    OBJETIVO : ESTE PROGRAMA TEM A FINALIDADE DE RECEBER DADOS  *00003703
      *               DA TABELA FOUR001.FUNC                           *00003803
      *----------------------------------------------------------------*00003903
      *    BASE DE DADOS:                                              *00004003
      *      TABELAS DB2                           INCLUDE/BOOK        *00004103
      *      FOUR001.FUNC                           BOOKFUNC           *00004203
      ******************************************************************00004303
      *================================================================*00004403
                                                                        00004503
      *================================================================*00004603
       ENVIRONMENT DIVISION.                                            00004703
      *================================================================*00004803
                                                                        00004903
      *----------------------------------------------------------------*00005003
       CONFIGURATION                              SECTION.              00005103
      *----------------------------------------------------------------*00005203
                                                                        00005303
       SPECIAL-NAMES.                                                   00005403
           DECIMAL-POINT IS COMMA.                                      00005503
                                                                        00005603
      *----------------------------------------------------------------*00005703
                                                                        00005803
      *================================================================*00005903
       DATA                DIVISION.                                    00006003
      *================================================================*00006103
      *----------------------------------------------------------------*00006203
       WORKING-STORAGE                            SECTION.              00006303
      *----------------------------------------------------------------*00006403
                                                                        00006503
      *----------------------------------------------------------------*00006603
       01  FILLER                      PIC  X(050)         VALUE        00006703
                 '*** INICIO DA WORKING FR05DB01 ***'.                  00006803
      *----------------------------------------------------------------*00006903
                                                                        00007003
      *----------------------------------------------------------------*00008003
       01  FILLER                       PIC X(050)           VALUE      00009003
                    '*** AREA DE AUXILIARES ***'.                       00010003
      *----------------------------------------------------------------*00011003
                                                                        00011103
       77 WRK-ID                 PIC 9(04).                             00012003
       77 WRK-SQLCODE            PIC -999.                              00013003
       77 WRK-INDICATOR          PIC S9(4) COMP VALUE ZEROS.            00014003
                                                                        00015003
      *----------------------------------------------------------------*00025003
       01  FILLER                       PIC X(050)           VALUE      00025103
                        '*** AREA DB2 ***'.                             00025203
      *----------------------------------------------------------------*00025303
                                                                        00025403
           EXEC SQL                                                     00025503
             INCLUDE BOOKFUNC                                           00025603
           END-EXEC.                                                    00025703
           EXEC SQL                                                     00025803
               INCLUDE SQLCA                                            00025903
           END-EXEC.                                                    00026003
                                                                        00026103
      *----------------------------------------------------------------*00026203
       01  FILLER                      PIC  X(050)         VALUE        00026303
              '*** FR05DB01 - FIM DA AREA DE WORKING ***'.              00026403
      *----------------------------------------------------------------*00026503
                                                                        00026603
      *================================================================*00026703
        PROCEDURE                       DIVISION.                       00026803
      *================================================================*00026903
                                                                        00027003
      ******************************************************************00028003
      *                    P R I N C I P A L                           *00029003
      ******************************************************************00030003
                                                                        00040003
      *----------------------------------------------------------------*00041003
       0000-PRINCIPAL                            SECTION.               00041103
      *----------------------------------------------------------------*00041203
                                                                        00041303
           PERFORM 1000-INICIAR                                         00041403
                                                                        00041503
           PERFORM 2000-PROCESSAR                                       00041603
                                                                        00041703
           PERFORM 3000-FINALIZAR                                       00041803
                                                                        00041903
           STOP RUN.                                                    00042003
                                                                        00042103
      *----------------------------------------------------------------*00042203
       0000-99-FIM.                           EXIT.                     00042303
      *----------------------------------------------------------------*00042403
                                                                        00042503
      ******************************************************************00042603
      *                      I N I C I A R                             *00042703
      ******************************************************************00042803
                                                                        00042903
      *----------------------------------------------------------------*00043003
       1000-INICIAR                           SECTION.                  00043103
      *----------------------------------------------------------------*00043203
                                                                        00043303
           ACCEPT WRK-ID      FROM SYSIN.                               00043403
           MOVE   WRK-ID      TO DB2-ID.                                00044003
                                                                        00044103
      *----------------------------------------------------------------*00044203
       1000-99-FIM.                              EXIT.                  00044303
      *----------------------------------------------------------------*00044403
                                                                        00044503
      ******************************************************************00044603
      *                   P R O C E S S A R                            *00044703
      ******************************************************************00044803
                                                                        00044903
      *----------------------------------------------------------------*00045003
       2000-PROCESSAR                       SECTION.                    00045103
      *----------------------------------------------------------------*00045203
                                                                        00045303
            EXEC SQL                                                    00046103
             SELECT ID,NOME,SETOR,SALARIO,DATAADM,EMAIL)                00046303
              INTO :DB2-ID,                                             00046403
                   :DB2-NOME,                                           00046503
                   :DB2-SETOR,                                          00046603
                   :DB2-SALARIO,                                        00046703
                   :DB2-DATAADM,                                        00046803
                   :DB2-EMAIL     :DB2-ID                               00046903
             END-EXEC.                                                  00047003
                                                                        00047103
             EVALUATE SQLCODE                                           00047203
               WHEN 0                                                   00047303
                DISPLAY '--------------------------------------'        00047403
                DISPLAY '             REGISTROS                '        00047503
                DISPLAY '--------------------------------------'        00047603
                DISPLAY 'ID....... ' DB2-ID                             00047703
                DISPLAY 'NOME..... ' DB2-NOME                           00047803
                DISPLAY 'SETOR.... ' DB2-SETOR                          00047903
                DISPLAY 'SALARIO.. ' DB2-SALARIO                        00048003
                DISPLAY 'DATAADM.. ' DB2-DATAADM                        00048103
                DISPLAY 'EMAIL.... ' DB2-EMAIL                          00048203
                DISPLAY '--------------------------------------'        00048303
                 IF WRK-INDICATOR = 0                                   00048403
                    DISPLAY 'EMAIL...: ' DB2-EMAIL                      00048503
                 ELSE                                                   00048603
                    DISPLAY '-- SEM EMAIL-- '                           00048803
                 END-IF                                                 00048903
               WHEN 100                                                 00049003
                   DISPLAY WRK-ID '... NAO ENCONTRADO '                 00049103
               WHEN OTHER                                               00049203
                   MOVE SQLCODE TO WRK-SQLCODE                          00049303
                   DISPLAY 'ERRO ...' WRK-SQLCODE                       00049403
             END-EVALUATE.                                              00049503
                                                                        00049603
             STOP RUN.                                                  00049703
                                                                        00049803
      *----------------------------------------------------------------*00049903
       2000-99-FIM.                       EXIT.                         00050003
      *----------------------------------------------------------------*00051003
                                                                        00060003
      ******************************************************************00070003
      *                 F I N A L I Z A C A O                          *00071003
      ******************************************************************00072003
                                                                        00073003
      *----------------------------------------------------------------*00074003
       3000-FINALIZAR                        SECTION.                   00075003
      *----------------------------------------------------------------*00076003
                                                                        00077003
              DISPLAY 'FIM FE PROCESSAMENTO'.                           00077103
                                                                        00077203
      *----------------------------------------------------------------*00077303
       3000-99-FIM.                           EXIT.                     00077403
      *----------------------------------------------------------------*00077503
