      *================================================================*00001000
       IDENTIFICATION                            DIVISION.              00002000
      *================================================================*00002100
                                                                        00002200
       PROGRAM-ID.  FR05DB07.                                           00002315
       AUTHOR.      DOUGLAS COSTA                                       00002400
                                                                        00002500
      *================================================================*00002600
      *                         F O U R S Y S                          *00002700
      *================================================================*00002800
      *    PROGRAMA...: FR05DB07                                       *00002915
      *    TIPO.......: SERVICO DE ACESSO A DADOS                      *00003000
      *----------------------------------------------------------------*00003100
      *    PROGAMADOR.: DOUGLAS COSTA                                  *00003200
      *    EMPRESA....: FOURSYS                                        *00003300
      *    ANALISTA...: IVAN SANCHES                                   *00003400
      *    DATA.......: 07/06/2022                                     *00003500
      *----------------------------------------------------------------*00003600
      *    OBJETIVO : ESTE PROGRAMA TEM A FINALIDADE DE RECEBER DADOS  *00003700
      *               DA TABELA FOUR001.FUNC2                          *00003812
      *----------------------------------------------------------------*00003900
      *    BASE DE DADOS:                                              *00004000
      *     TABELAS DB2                           INCLUDE/BOOK         *00004114
      *    FOUR001.FUNC2                           #BKFUNC2            *00004214
      *----------------------------------------------------------------*00004312
      *    MODULO   :                                                  *00004414
      *               GRAVALOG - TRATAMENTO DE ERROS                   *00004514
      *                                                                *00004614
      *----------------------------------------------------------------*00004712
      *    COPYBOOK :                                                  *00004814
      *               B#GRALOG - AREA DE TRATAMENTO DE ERROS           *00004914
      *                                                                *00005014
      ******************************************************************00005112
      *================================================================*00005214
                                                                        00005314
      *================================================================*00005412
       ENVIRONMENT DIVISION.                                            00005500
      *================================================================*00005600
                                                                        00005700
      *----------------------------------------------------------------*00005800
       CONFIGURATION                              SECTION.              00005900
      *----------------------------------------------------------------*00006000
                                                                        00006100
       SPECIAL-NAMES.                                                   00006200
           DECIMAL-POINT IS COMMA.                                      00006300
                                                                        00006400
      *----------------------------------------------------------------*00006500
                                                                        00006600
      *================================================================*00006700
       DATA                DIVISION.                                    00006800
      *================================================================*00006900
      *----------------------------------------------------------------*00007000
       WORKING-STORAGE                            SECTION.              00007100
      *----------------------------------------------------------------*00007200
                                                                        00007300
      *----------------------------------------------------------------*00007400
       01  FILLER                      PIC  X(050)         VALUE        00007500
                 '*** INICIO DA WORKING FR05DB07 ***'.                  00007615
      *----------------------------------------------------------------*00007700
                                                                        00007800
      *----------------------------------------------------------------*00008000
       01  FILLER                       PIC X(050)           VALUE      00009000
                    '*** AREA DE AUXILIARES ***'.                       00010000
      *----------------------------------------------------------------*00011000
                                                                        00012000
       77 WRK-ID                 PIC 9(04).                             00013000
       77 WRK-SQLCODE            PIC -999.                              00014000
                                                                        00016000
       01 WRK-TOTAL-SAL          PIC 9(10)V99.                          00017008
       01 WRK-MEDIA-SAL          PIC 9(10)V99.                          00018008
       01 WRK-MAX-SAL            PIC 9(10)V99.                          00019008
                                                                        00020000
      *----------------------------------------------------------------*00020114
       01  FILLER                       PIC X(050)           VALUE      00020214
                   '*** VARIAVEL DE NULIDADE ***'.                      00020314
      *----------------------------------------------------------------*00020414
                                                                        00020514
       77 WRK-EMAIL-NULL         PIC S9(4) COMP VALUE ZEROS.            00020614
       77 WRK-TELEFONE-NULL      PIC S9(4) COMP VALUE ZEROS.            00020714
                                                                        00020814
      *----------------------------------------------------------------*00021000
       01  FILLER                       PIC X(050)           VALUE      00021100
                    '*** AREA DE ACUMULADORES ***'.                     00021200
      *----------------------------------------------------------------*00021300
                                                                        00021400
        77 ACUM-LIDOS            PIC 9(05) VALUE ZEROS.                 00021500
                                                                        00021600
      *----------------------------------------------------------------*00021711
       01  FILLER                       PIC X(050)           VALUE      00021811
                        '*** AREA DE BOOK ***'.                         00021911
      *----------------------------------------------------------------*00022011
                                                                        00022111
          COPY 'B#GRALOG'.                                              00022211
                                                                        00022311
      *----------------------------------------------------------------*00022400
       01  FILLER                       PIC X(050)           VALUE      00022500
                        '*** AREA DB2 ***'.                             00022600
      *----------------------------------------------------------------*00022700
                                                                        00023000
           EXEC SQL                                                     00024000
             INCLUDE #BKFUNC2                                           00025000
           END-EXEC.                                                    00025100
                                                                        00025200
           EXEC SQL                                                     00025300
               INCLUDE SQLCA                                            00025400
           END-EXEC.                                                    00025500
                                                                        00025600
           EXEC SQL                                                     00025700
              DECLARE CFUNC CURSOR FOR                                  00025800
               SELECT * FROM FOUR001.FUNC2                              00025900
                ORDER BY NOME                                           00026000
           END-EXEC.                                                    00026100
                                                                        00026200
      *----------------------------------------------------------------*00026300
       01  FILLER                      PIC  X(050)         VALUE        00026400
              '*** FR05DB07 - FIM DA AREA DE WORKING ***'.              00026515
      *----------------------------------------------------------------*00026600
                                                                        00026700
      *================================================================*00026800
        PROCEDURE                       DIVISION.                       00026900
      *================================================================*00027000
                                                                        00027100
      ******************************************************************00027200
      *                    P R I N C I P A L                           *00027300
      ******************************************************************00027400
                                                                        00027500
      *----------------------------------------------------------------*00027600
       0000-PRINCIPAL                            SECTION.               00027700
      *----------------------------------------------------------------*00027800
                                                                        00027900
           PERFORM 1000-INICIAR.                                        00028000
                                                                        00029000
           PERFORM 2000-PROCESSAR UNTIL SQLCODE EQUAL 100.              00030000
                                                                        00040000
           PERFORM 3000-FINALIZAR.                                      00041000
                                                                        00041100
           STOP RUN.                                                    00041200
                                                                        00041300
      *----------------------------------------------------------------*00041400
       0000-99-FIM.                           EXIT.                     00041500
      *----------------------------------------------------------------*00041600
                                                                        00041700
      ******************************************************************00041800
      *                      I N I C I A R                             *00041900
      ******************************************************************00042000
                                                                        00042100
      *----------------------------------------------------------------*00042200
       1000-INICIAR                           SECTION.                  00042300
      *----------------------------------------------------------------*00042400
                                                                        00042500
            EXEC SQL                                                    00042600
               OPEN CFUNC                                               00042700
            END-EXEC.                                                   00042800
                                                                        00042900
            EVALUATE SQLCODE                                            00043000
             WHEN 0                                                     00043100
               PERFORM 1100-LER-FUNCIONARIO                             00043200
             WHEN 100                                                   00043300
               DISPLAY 'SEM FUNCIONARIOS'                               00043400
             WHEN OTHER                                                 00043500
               MOVE SQLCODE              TO WRK-SQLCODE                 00043600
               DISPLAY 'ERRO ' WRK-SQLCODE 'NO OPEN CURSOR'             00043700
               MOVE 200                  TO RETURN-CODE                 00043800
               STOP RUN                                                 00043900
            END-EVALUATE.                                               00044000
                                                                        00045000
      *----------------------------------------------------------------*00045100
       1000-99-FIM.                              EXIT.                  00045200
      *----------------------------------------------------------------*00045300
                                                                        00045400
      *----------------------------------------------------------------*00045500
       1100-LER-FUNCIONARIO                   SECTION.                  00045600
      *----------------------------------------------------------------*00045700
                                                                        00045800
           EXEC SQL                                                     00045900
             FETCH CFUNC                                                00046000
              INTO :DB2-ID,                                             00046100
                   :DB2-NOME,                                           00046200
                   :DB2-SETOR,                                          00046300
                   :DB2-SALARIO,                                        00046400
                   :DB2-DATAADM,                                        00046500
                   :DB2-EMAIL    :WRK-EMAIL-NULL,                       00046601
                   :DB2-TELEFONE :WRK-TELEFONE-NULL                     00046701
           END-EXEC.                                                    00046800
                                                                        00046901
            IF (SQLCODE NOT EQUAL ZEROS AND +100) OR                    00048111
               (SQLWARN0    EQUAL 'W')                                  00048211
               MOVE 'FR05DB1'            TO  WRK-PROGRAMA               00048311
               MOVE '2000  '             TO  WRK-SECAO                  00048411
               MOVE 'NA LEITURA'         TO  WRK-MENSAGEM               00048511
               MOVE 'WRK-SQLCODE'        TO  WRK-STATUS                 00048611
               MOVE SQLCODE              TO  WRK-SQLCODE                00048711
               DISPLAY 'ERRO .....' WRK-SQLCODE                         00048811
                PERFORM 9999-TRATAR-ERROS                               00048911
            END-IF.                                                     00049011
                                                                        00049111
            IF (SQLCODE               EQUAL +100)                       00049211
               DISPLAY WRK-ID '... NAO ENCONTRADO '                     00049311
               MOVE 'FR05DB1'            TO  WRK-PROGRAMA               00049411
               MOVE '2000  '             TO  WRK-SECAO                  00049511
               MOVE 'NA LEITURA'         TO  WRK-MENSAGEM               00049611
               MOVE 'WRK-SQLCODE'        TO  WRK-STATUS                 00049711
            END-IF.                                                     00049811
                                                                        00049911
           EVALUATE SQLCODE                                             00050000
            WHEN 0                                                      00050100
              CONTINUE                                                  00050200
              ADD 1 TO ACUM-LIDOS                                       00050300
              COMPUTE WRK-TOTAL-SAL = WRK-TOTAL-SAL + DB2-SALARIO       00050409
              IF DB2-SALARIO            GREATER WRK-MAX-SAL             00051014
                 MOVE DB2-SALARIO       TO WRK-MAX-SAL                  00052014
              END-IF                                                    00053000
                                                                        00053100
            WHEN 100                                                    00053200
              DISPLAY 'FINAL DA TABELA'                                 00053300
            WHEN OTHER                                                  00053400
              MOVE SQLCODE              TO WRK-SQLCODE                  00053514
              DISPLAY 'ERRO ...' WRK-SQLCODE                            00053600
           END-EVALUATE.                                                00053700
                                                                        00053800
      *----------------------------------------------------------------*00053900
       1100-99-FIM.                           EXIT.                     00054000
      *----------------------------------------------------------------*00054100
      ******************************************************************00054200
      *                   P R O C E S S A R                            *00054300
      ******************************************************************00054400
      *----------------------------------------------------------------*00054500
       2000-PROCESSAR                        SECTION.                   00054600
      *----------------------------------------------------------------*00054700
                                                                        00054800
                                                                        00055000
           DISPLAY '---------------------------------------'            00055100
           DISPLAY '              RESGISTROS               '            00055200
           DISPLAY '---------------------------------------'            00055300
           DISPLAY 'ID.....: ' DB2-ID                                   00055400
           DISPLAY 'NOME...: ' DB2-NOME                                 00055500
           DISPLAY 'SETOR..: ' DB2-SETOR                                00055600
           DISPLAY 'SALARIO: ' DB2-SALARIO                              00055700
           DISPLAY 'DATAADM: ' DB2-DATAADM                              00055800
                                                                        00056000
           IF WRK-EMAIL-NULL = 0                                        00056101
              DISPLAY 'EMAIL...: ' DB2-EMAIL-TEXT                       00056210
           ELSE                                                         00056300
              DISPLAY '-- SEM EMAIL CADASTRADO --'                      00056400
           END-IF                                                       00056500
                                                                        00056600
           IF WRK-TELEFONE-NULL = 0                                     00056701
              DISPLAY 'TELEFONE: ' DB2-TELEFONE                         00056801
           ELSE                                                         00056901
              DISPLAY '-- SEM TELEFONE CADASTRADO --'                   00057001
           END-IF                                                       00057101
                                                                        00057204
           DISPLAY '---------------------------------------'            00057304
                                                                        00057401
           PERFORM 1100-LER-FUNCIONARIO.                                00057500
                                                                        00057600
      *----------------------------------------------------------------*00057700
       2000-99-FIM.                           EXIT.                     00057800
      *----------------------------------------------------------------*00057900
                                                                        00058000
      ******************************************************************00058100
      *                 F I N A L I Z A C A O                          *00058200
      ******************************************************************00058300
                                                                        00058400
      *----------------------------------------------------------------*00058500
       3000-FINALIZAR                        SECTION.                   00058600
      *----------------------------------------------------------------*00058700
                                                                        00058800
           COMPUTE WRK-MEDIA-SAL = WRK-TOTAL-SAL / ACUM-LIDOS           00058908
                                                                        00059005
            DISPLAY '----------------------------------'                00059100
            DISPLAY '          F R 0 5 D B 0 2         '                00060000
            DISPLAY '----------------------------------'                00070000
            DISPLAY 'TOTAL LIDOS  : ' ACUM-LIDOS                        00070108
            DISPLAY 'MAIOR SALARIO: ' WRK-MAX-SAL                       00071000
            DISPLAY 'MEDIA SALARIO: ' WRK-MEDIA-SAL                     00072000
            DISPLAY 'TOTAL SALARIO: ' WRK-TOTAL-SAL                     00073008
            DISPLAY '----------------------------------'                00073100
                                                                        00073200
            EXEC SQL                                                    00073300
              CLOSE CFUNC                                               00073400
            END-EXEC.                                                   00073500
                                                                        00073600
      *----------------------------------------------------------------*00073700
       3000-99-FIM.                           EXIT.                     00073800
      *----------------------------------------------------------------*00073900
      ******************************************************************00074011
      *                 T R A T A R   E R R O S                        *00075011
      ******************************************************************00076011
                                                                        00077011
      *----------------------------------------------------------------*00078011
       9999-TRATAR-ERROS                     SECTION.                   00079011
      *----------------------------------------------------------------*00080011
                                                                        00090011
           CALL 'GRAVALOG'      USING WRK-LOG.                          00091011
                                                                        00092011
           GOBACK.                                                      00093011
                                                                        00094011
      *----------------------------------------------------------------*00100011
       9999-99-FIM.                           EXIT.                     00110013
      *----------------------------------------------------------------*00120011
