      *================================================================*00001000
       IDENTIFICATION                            DIVISION.              00002000
      *================================================================*00002100
                                                                        00002200
       PROGRAM-ID.  FR05DB05.                                           00002300
       AUTHOR.      DOUGLAS COSTA                                       00002400
                                                                        00002500
      *================================================================*00002600
      *                         F O U R S Y S                          *00002700
      *================================================================*00002800
      *    PROGRAMA...: FR05DB05                                       *00002900
      *    TIPO.......: SERVICO DE ACESSO A DADOS                      *00003000
      *----------------------------------------------------------------*00003100
      *    PROGAMADOR.: DOUGLAS COSTA                                  *00003200
      *    EMPRESA....: FOURSYS                                        *00003300
      *    ANALISTA...: IVAN SANCHES                                   *00003400
      *    DATA.......: 03/06/2022                                     *00003500
      *----------------------------------------------------------------*00003600
      *    OBJETIVO : ESTE PROGRAMA TEM A FINALIDADE DE DELETAR DADOS  *00003703
      *               DA TABELA FOUR001.FUNC                           *00003800
      *----------------------------------------------------------------*00003900
      *    BASE DE DADOS:                                              *00004000
      *      TABELAS DB2                           INCLUDE/BOOK        *00004100
      *      FOUR001.FUNC                           BOOKFUNC           *00004200
      ******************************************************************00004900
      *================================================================*00005000
                                                                        00005100
      *================================================================*00005200
       ENVIRONMENT DIVISION.                                            00005300
      *================================================================*00005400
                                                                        00005500
      *----------------------------------------------------------------*00005600
       CONFIGURATION                              SECTION.              00005700
      *----------------------------------------------------------------*00005800
                                                                        00005900
       SPECIAL-NAMES.                                                   00006000
           DECIMAL-POINT IS COMMA.                                      00006100
                                                                        00006200
      *----------------------------------------------------------------*00006300
                                                                        00006400
      *================================================================*00006500
       DATA                DIVISION.                                    00006600
      *================================================================*00006700
      *----------------------------------------------------------------*00006800
       WORKING-STORAGE                            SECTION.              00006900
      *----------------------------------------------------------------*00007000
                                                                        00008000
      *----------------------------------------------------------------*00009000
       01  FILLER                      PIC  X(050)         VALUE        00010000
                 '*** INICIO DA WORKING FR05DB05 ***'.                  00011000
      *----------------------------------------------------------------*00012000
                                                                        00013000
      *----------------------------------------------------------------*00014000
       01  FILLER                       PIC X(050)           VALUE      00015000
                    '*** AREA DE AUXILIARES ***'.                       00016000
      *----------------------------------------------------------------*00017000
       77 WRK-ID                 PIC 9(04).                             00018005
       77 WRK-SQLCODE            PIC -999.                              00019000
       77 WRK-INDICATOR          PIC S9(4) COMP VALUE ZEROS.            00020000
                                                                        00021000
      *----------------------------------------------------------------*00021100
       01  FILLER                       PIC X(050)           VALUE      00024800
                        '*** AREA DB2 ***'.                             00024900
      *----------------------------------------------------------------*00025000
                                                                        00025100
           EXEC SQL                                                     00025200
             INCLUDE BOOKFUNC                                           00025300
           END-EXEC.                                                    00025400
           EXEC SQL                                                     00025500
               INCLUDE SQLCA                                            00025600
           END-EXEC.                                                    00025700
                                                                        00025800
      *----------------------------------------------------------------*00025900
       01  FILLER                      PIC  X(050)         VALUE        00026000
              '*** FR05DB05 - FIM DA AREA DE WORKING ***'.              00026100
      *----------------------------------------------------------------*00026200
                                                                        00026300
      *================================================================*00026400
        PROCEDURE                       DIVISION.                       00026500
      *================================================================*00026600
                                                                        00026700
      ******************************************************************00026800
      *                    P R I N C I P A L                           *00026900
      ******************************************************************00027000
                                                                        00028000
      *----------------------------------------------------------------*00029000
       0000-PRINCIPAL                            SECTION.               00030000
      *----------------------------------------------------------------*00040000
                                                                        00041000
           PERFORM 1000-INICIAR                                         00041100
                                                                        00041200
           PERFORM 2000-PROCESSAR                                       00041300
                                                                        00041400
           PERFORM 3000-FINALIZAR                                       00041500
                                                                        00041600
           STOP RUN.                                                    00041700
                                                                        00041800
      *----------------------------------------------------------------*00041900
       0000-99-FIM.                           EXIT.                     00042000
      *----------------------------------------------------------------*00042100
                                                                        00042200
      ******************************************************************00042300
      *                      I N I C I A R                             *00042400
      ******************************************************************00042500
                                                                        00042600
      *----------------------------------------------------------------*00042700
       1000-INICIAR                           SECTION.                  00042800
      *----------------------------------------------------------------*00042900
                                                                        00043000
            ACCEPT WRK-ID   FROM SYSIN.                                 00043100
            MOVE WRK-ID     TO DB2-ID.                                  00043200
                                                                        00043900
      *----------------------------------------------------------------*00044000
       1000-99-FIM.                              EXIT.                  00044100
      *----------------------------------------------------------------*00044200
                                                                        00045000
      ******************************************************************00045100
      *                   P R O C E S S A R                            *00045200
      ******************************************************************00045300
                                                                        00045400
      *----------------------------------------------------------------*00045500
       2000-PROCESSAR                       SECTION.                    00045600
      *----------------------------------------------------------------*00045700
                                                                        00046000
            EXEC SQL                                                    00046600
             DELETE FROM FOUR001.FUNC WHERE ID = :DB2-ID                00046700
            END-EXEC.                                                   00047400
                                                                        00047500
             EVALUATE SQLCODE                                           00047600
               WHEN 0                                                   00047700
                 DISPLAY '--------------------------------------'       00047800
                 DISPLAY '           DADOS DELETADOS            '       00047900
                 DISPLAY '--------------------------------------'       00048000
                 DISPLAY 'ID....... ' DB2-ID                            00048100
                 DISPLAY 'NOME..... ' DB2-NOME                          00048200
                 DISPLAY 'SETOR.... ' DB2-SETOR                         00048300
                 DISPLAY 'SALARIO.. ' DB2-SALARIO                       00048400
                 DISPLAY 'DATAADM.. ' DB2-DATAADM                       00048500
                 DISPLAY 'EMAIL.... ' DB2-EMAIL                         00048607
                 DISPLAY '--------------------------------------'       00048700
                  IF WRK-INDICATOR = 0                                  00048800
                     DISPLAY 'ID... ' WRK-ID                            00048906
                  ELSE                                                  00049000
                     DISPLAY '-- SEM ID CADASTRADO '                    00049206
                  END-IF                                                00049300
                                                                        00049400
               WHEN 100                                                 00049500
                 DISPLAY ' ... ID NÃO ENCONTRADO ' WRK-ID               00049600
                                                                        00049700
               WHEN OTHER                                               00049800
                 MOVE SQLCODE         TO WRK-SQLCODE                    00049900
                 DISPLAY 'ERRO ... ' WRK-SQLCODE                        00050000
                                                                        00050100
             END-EVALUATE.                                              00050200
      *----------------------------------------------------------------*00050300
       2000-99-FIM.                       EXIT.                         00050400
      *----------------------------------------------------------------*00050500
                                                                        00050600
      ******************************************************************00050700
      *                 F I N A L I Z A C A O                          *00050800
      ******************************************************************00051000
                                                                        00060000
      *----------------------------------------------------------------*00070000
       3000-FINALIZAR                        SECTION.                   00071000
      *----------------------------------------------------------------*00072000
                                                                        00073000
              DISPLAY 'FIM FE PROCESSAMENTO'.                           00074000
                                                                        00075000
      *----------------------------------------------------------------*00076000
       3000-99-FIM.                           EXIT.                     00077000
      *----------------------------------------------------------------*00078000
