      *================================================================*00001001
       IDENTIFICATION                            DIVISION.              00002001
      *================================================================*00002101
                                                                        00002201
       PROGRAM-ID.  FR05DB03.                                           00002301
       AUTHOR.      DOUGLAS COSTA                                       00002401
                                                                        00002501
      *================================================================*00002601
      *                         F O U R S Y S                          *00002701
      *================================================================*00002801
      *    PROGRAMA...: FR05DB03                                       *00002901
      *    TIPO.......: SERVICO DE ACESSO A DADOS                      *00003001
      *----------------------------------------------------------------*00003101
      *    PROGAMADOR.: DOUGLAS COSTA                                  *00003201
      *    EMPRESA....: FOURSYS                                        *00003301
      *    ANALISTA...: IVAN SANCHES                                   *00003401
      *    DATA.......: 03/06/2022                                     *00003501
      *----------------------------------------------------------------*00003601
      *    OBJETIVO : ESTE PROGRAMA TEM A FINALIDADE DE RECEBER DADOS  *00003701
      *               DA TABELA FOUR001.FUNC                           *00003801
      *----------------------------------------------------------------*00003901
      *    BASE DE DADOS:                                              *00004001
      *      TABELAS DB2                           INCLUDE/BOOK        *00004101
      *      FOUR001.FUNC                           BOOKFUNC           *00004201
      ******************************************************************00004901
      *================================================================*00005001
                                                                        00005101
      *================================================================*00005201
       ENVIRONMENT DIVISION.                                            00005301
      *================================================================*00005401
                                                                        00005501
      *----------------------------------------------------------------*00005601
       CONFIGURATION                              SECTION.              00005701
      *----------------------------------------------------------------*00005801
                                                                        00005901
       SPECIAL-NAMES.                                                   00006001
           DECIMAL-POINT IS COMMA.                                      00006101
                                                                        00006201
      *----------------------------------------------------------------*00006301
                                                                        00006401
      *================================================================*00006501
       DATA                DIVISION.                                    00006601
      *================================================================*00006701
      *----------------------------------------------------------------*00006801
       WORKING-STORAGE                            SECTION.              00006901
      *----------------------------------------------------------------*00007001
                                                                        00008001
      *----------------------------------------------------------------*00009001
       01  FILLER                      PIC  X(050)         VALUE        00010001
                 '*** INICIO DA WORKING FR05DB03 ***'.                  00011001
      *----------------------------------------------------------------*00012001
                                                                        00013001
      *----------------------------------------------------------------*00014001
       01  FILLER                       PIC X(050)           VALUE      00015001
                    '*** AREA DE AUXILIARES ***'.                       00016001
      *----------------------------------------------------------------*00017001
                                                                        00018001
       77 WRK-SQLCODE            PIC -999.                              00020003
       77 WRK-INDICATOR          PIC S9(4) COMP VALUE ZEROS.            00021003
                                                                        00021101
      *----------------------------------------------------------------*00021201
       01  FILLER                       PIC X(050)           VALUE      00021301
                    '*** AREA DE VARIAVEIS ***'.                        00021401
      *----------------------------------------------------------------*00021501
                                                                        00021601
        01 WRK-ID.                                                      00021801
           02 FILLER             PIC X(10).                             00021901
           02 WRK-ID-AC          PIC 9(04).                             00022001
                                                                        00022101
        01 WRK-NOME.                                                    00022201
           02 FILLER             PIC X(10).                             00022301
           02 WRK-NOME-AC        PIC X(30).                             00022401
                                                                        00022501
        01 WRK-SETOR.                                                   00022601
           02 FILLER             PIC X(10).                             00022801
           02 WRK-SETOR-AC       PIC X(04).                             00022901
                                                                        00023001
        01 WRK-SALARIO.                                                 00023101
           02 FILLER             PIC X(10).                             00023201
           02 WRK-SALARIO-AC     PIC 9(08)V99.                          00023301
                                                                        00023401
        01 WRK-DATAADM.                                                 00023501
           02 FILLER             PIC X(10).                             00023601
           02 WRK-DATAADM-AC     PIC X(10).                             00023701
                                                                        00023801
        01 WRK-EMAIL.                                                   00023901
           02 FILLER             PIC X(10).                             00024001
           02 WRK-EMAIL-AC       PIC X(40).                             00024102
                                                                        00024201
      *----------------------------------------------------------------*00024301
       01  FILLER                       PIC X(050)           VALUE      00024401
                    '*** AREA DO GRAVALOG ***'.                         00024501
      *----------------------------------------------------------------*00024601
                                                                        00024701
        COPY 'B#GRALOG'.                                                00024807
                                                                        00024901
      *----------------------------------------------------------------*00025001
       01  FILLER                       PIC X(050)           VALUE      00025105
                        '*** AREA DB2 ***'.                             00025205
      *----------------------------------------------------------------*00025301
                                                                        00025401
           EXEC SQL                                                     00025505
             INCLUDE BOOKFUNC                                           00025605
           END-EXEC.                                                    00025705
           EXEC SQL                                                     00025805
               INCLUDE SQLCA                                            00025905
           END-EXEC.                                                    00026005
                                                                        00026101
      *----------------------------------------------------------------*00026201
       01  FILLER                      PIC  X(050)         VALUE        00026301
              '*** FR05DB03 - FIM DA AREA DE WORKING ***'.              00026401
      *----------------------------------------------------------------*00027001
                                                                        00028001
      *================================================================*00029001
        PROCEDURE                       DIVISION.                       00030001
      *================================================================*00040001
                                                                        00041001
      ******************************************************************00041101
      *                    P R I N C I P A L                           *00041206
      ******************************************************************00041301
                                                                        00041401
      *----------------------------------------------------------------*00041501
       0000-PRINCIPAL                            SECTION.               00041601
      *----------------------------------------------------------------*00041701
                                                                        00041801
           PERFORM 1000-INICIAR                                         00041901
                                                                        00042001
           PERFORM 2000-PROCESSAR                                       00042101
                                                                        00042201
           PERFORM 3000-FINALIZAR                                       00042301
                                                                        00042401
           STOP RUN.                                                    00042501
                                                                        00042601
      *----------------------------------------------------------------*00042701
       0000-99-FIM.                           EXIT.                     00042801
      *----------------------------------------------------------------*00042901
                                                                        00043001
      ******************************************************************00043101
      *                      I N I C I A R                             *00043201
      ******************************************************************00043301
                                                                        00043401
      *----------------------------------------------------------------*00043501
       1000-INICIAR                           SECTION.                  00043601
      *----------------------------------------------------------------*00043701
                                                                        00043801
            ACCEPT WRK-ID.                                              00043901
            ACCEPT WRK-NOME.                                            00044001
            ACCEPT WRK-SETOR.                                           00044101
            ACCEPT WRK-SALARIO.                                         00044201
            ACCEPT WRK-DATAADM.                                         00044301
            ACCEPT WRK-EMAIL.                                           00044401
                                                                        00044701
      *----------------------------------------------------------------*00044801
       1000-99-FIM.                              EXIT.                  00045001
      *----------------------------------------------------------------*00045101
                                                                        00045201
      ******************************************************************00045301
      *                   P R O C E S S A R                            *00045401
      ******************************************************************00045501
                                                                        00045601
      *----------------------------------------------------------------*00045701
       2000-PROCESSAR                       SECTION.                    00045801
      *----------------------------------------------------------------*00045901
                                                                        00046001
            MOVE    WRK-ID-AC           TO DB2-ID.                      00046101
            MOVE    WRK-NOME-AC         TO DB2-NOME.                    00046201
            MOVE    WRK-SETOR-AC        TO DB2-SETOR.                   00046301
            MOVE    WRK-SALARIO-AC      TO DB2-SALARIO.                 00046401
            MOVE    WRK-DATAADM-AC      TO DB2-DATAADM.                 00046501
            MOVE    WRK-EMAIL-AC        TO DB2-EMAIL.                   00046601
                                                                        00046701
            EXEC SQL                                                    00046801
             INSERT  INTO                                               00046901
             FOUR001.FUNC(ID,NOME,SETOR,SALARIO,DATAADM,EMAIL)          00047001
             VALUES(:DB2-ID,                                            00047101
                    :DB2-NOME,                                          00047201
                    :DB2-SETOR,                                         00047301
                    :DB2-SALARIO,                                       00047401
                    :DB2-DATAADM,                                       00047501
                    :DB2-EMAIL)                                         00047601
             END-EXEC.                                                  00047701
                                                                        00047801
             EVALUATE SQLCODE                                           00047901
               WHEN 0                                                   00048001
                DISPLAY '--------------------------------------'        00048101
                DISPLAY '           DADOS GRAVADOS             '        00048201
                DISPLAY '--------------------------------------'        00048301
                DISPLAY 'ID....... ' DB2-ID                             00048401
                DISPLAY 'NOME..... ' DB2-NOME                           00048501
                DISPLAY 'SETOR.... ' DB2-SETOR                          00048601
                DISPLAY 'SALARIO.. ' DB2-SALARIO                        00048701
                DISPLAY 'DATAADM.. ' DB2-DATAADM                        00048801
                DISPLAY 'EMAIL.... ' DB2-EMAIL                          00048901
                DISPLAY '--------------------------------------'        00049001
               WHEN -181                                                00049102
                 DISPLAY 'FORMATO DATA ERRADO ' WRK-DATAADM-AC          00049202
               WHEN OTHER                                               00049301
                 MOVE SQLCODE  TO WRK-SQLCODE                           00049402
                 DISPLAY 'ERRO.... ' WRK-SQLCODE                        00049501
             END-EVALUATE.                                              00049601
      *----------------------------------------------------------------*00049701
       2000-99-FIM.                       EXIT.                         00049801
      *----------------------------------------------------------------*00050001
                                                                        00076401
      ******************************************************************00076501
      *                 F I N A L I Z A C A O                          *00076601
      ******************************************************************00076701
                                                                        00076801
      *----------------------------------------------------------------*00076901
       3000-FINALIZAR                        SECTION.                   00077001
      *----------------------------------------------------------------*00077101
                                                                        00077201
              DISPLAY 'FIM FE PROCESSAMENTO'.                           00077301
                                                                        00077401
      *----------------------------------------------------------------*00077501
       3000-99-FIM.                           EXIT.                     00077601
      *----------------------------------------------------------------*00077701
