      *================================================================*00001000
       IDENTIFICATION                            DIVISION.              00002000
      *================================================================*00002100
                                                                        00002200
       PROGRAM-ID.  FR05DB09.                                           00002306
       AUTHOR.      DOUGLAS COSTA                                       00002400
                                                                        00002500
      *================================================================*00002600
      *                         F O U R S Y S                          *00002700
      *================================================================*00002800
      *    PROGRAMA...: FR05DB09                                       *00002906
      *    TIPO.......: SERVICO DE ACESSO A DADOS                      *00003000
      *----------------------------------------------------------------*00003100
      *    PROGAMADOR.: DOUGLAS COSTA                                  *00003200
      *    EMPRESA....: FOURSYS                                        *00003300
      *    ANALISTA...: IVAN SANCHES                                   *00003400
      *    DATA.......: 07/06/2022                                     *00003500
      *----------------------------------------------------------------*00003600
      *    OBJETIVO : ESTE PROGRAMA TEM A FINALIDADE DE ATUALIZAR DADOS*00003700
      *               DA TABELA FOUR001.FUNC2                          *00003800
      *----------------------------------------------------------------*00003900
      *    BASE DE DADOS:                                              *00004000
      *     TABELAS DB2                           INCLUDE/BOOK         *00004105
      *    FOUR001.FUNC2                           #BKFUNC2            *00004205
      *----------------------------------------------------------------*00004304
      *    MODULO   :                                                  *00004405
      *               GRAVALOG - TRATAMENTO DE ERROS                   *00004505
      *                                                                *00004605
      *----------------------------------------------------------------*00004704
      *    COPYBOOK :                                                  *00004805
      *               B#GRALOG - AREA DE TRATAMENTO DE ERROS           *00004905
      *                                                                *00005005
      ******************************************************************00005104
      *================================================================*00005205
                                                                        00005305
      *================================================================*00005404
       ENVIRONMENT DIVISION.                                            00005500
      *================================================================*00005600
                                                                        00005700
      *----------------------------------------------------------------*00005800
       CONFIGURATION                              SECTION.              00005900
      *----------------------------------------------------------------*00006000
                                                                        00006100
       SPECIAL-NAMES.                                                   00006200
           DECIMAL-POINT IS COMMA.                                      00006300
                                                                        00006400
      *----------------------------------------------------------------*00006500
                                                                        00006600
      *================================================================*00006700
       DATA                                       DIVISION.             00006800
      *================================================================*00006900
      *----------------------------------------------------------------*00007000
       WORKING-STORAGE                            SECTION.              00007100
      *----------------------------------------------------------------*00007200
                                                                        00007300
      *----------------------------------------------------------------*00007400
       01  FILLER                      PIC  X(050)         VALUE        00007500
                 '*** INICIO DA WORKING FR05DB09 ***'.                  00007606
      *----------------------------------------------------------------*00007700
                                                                        00007800
      *----------------------------------------------------------------*00008000
       01  FILLER                       PIC X(050)           VALUE      00009000
                    '*** AREA DE AUXILIARES ***'.                       00010000
      *----------------------------------------------------------------*00011000
                                                                        00011102
       77 WRK-CONTA              PIC 9(4).                              00012002
       77 WRK-POS                PIC 9(4).                              00012102
       77 WRK-SQLCODE            PIC -999.                              00013000
       77 WRK-INDICATOR          PIC S9(4) COMP VALUE ZEROS.            00014000
                                                                        00015000
      *----------------------------------------------------------------*00016000
       01  FILLER                       PIC X(050)           VALUE      00017000
                    '*** AREA DE VARIAVEIS ***'.                        00018000
      *----------------------------------------------------------------*00019000
                                                                        00020000
        01 WRK-ID.                                                      00021000
           02 FILLER             PIC X(10).                             00021100
           02 WRK-ID-AC          PIC 9(04).                             00021200
                                                                        00021300
        01 WRK-NOME.                                                    00021400
           02 FILLER             PIC X(10).                             00021500
           02 WRK-NOME-AC        PIC X(30).                             00021600
                                                                        00021700
        01 WRK-SETOR.                                                   00021800
           02 FILLER             PIC X(10).                             00021900
           02 WRK-SETOR-AC       PIC X(04).                             00022000
                                                                        00022100
        01 WRK-SALARIO.                                                 00022200
           02 FILLER             PIC X(10).                             00022300
           02 WRK-SALARIO-AC     PIC 9(08)V99.                          00022400
                                                                        00022500
        01 WRK-DATAADM.                                                 00022600
           02 FILLER             PIC X(10).                             00022700
           02 WRK-DATAADM-AC     PIC X(10).                             00022800
                                                                        00022900
        01 WRK-EMAIL.                                                   00023000
           02 FILLER             PIC X(10).                             00023100
           02 WRK-EMAIL-AC       PIC X(40).                             00023200
                                                                        00023300
        01 WRK-TELEFONE.                                                00023400
           02 FILLER             PIC X(10).                             00023500
           02 WRK-TELEFONE-AC    PIC X(11).                             00023600
                                                                        00023700
      *----------------------------------------------------------------*00023800
       01  FILLER                       PIC X(050)           VALUE      00023904
                        '*** AREA DE BOOK ***'.                         00024004
      *----------------------------------------------------------------*00024204
                                                                        00024304
           COPY 'B#GRALOG'.                                             00024404
                                                                        00024504
      *----------------------------------------------------------------*00024600
       01  FILLER                       PIC X(050)           VALUE      00024700
                        '*** AREA DB2 ***'.                             00024800
      *----------------------------------------------------------------*00024900
                                                                        00025000
           EXEC SQL                                                     00025100
             INCLUDE #BKFUNC2                                           00025200
           END-EXEC.                                                    00025300
           EXEC SQL                                                     00025400
               INCLUDE SQLCA                                            00025500
           END-EXEC.                                                    00025600
                                                                        00025700
      *----------------------------------------------------------------*00025800
       01  FILLER                      PIC  X(050)         VALUE        00025900
              '*** FR05DB09 - FIM DA AREA DE WORKING ***'.              00026006
      *----------------------------------------------------------------*00026100
                                                                        00026200
      *================================================================*00026300
        PROCEDURE                       DIVISION.                       00026400
      *================================================================*00026500
                                                                        00026600
      ******************************************************************00026700
      *                    P R I N C I P A L                           *00026800
      ******************************************************************00026900
                                                                        00027000
      *----------------------------------------------------------------*00027100
       0000-PRINCIPAL                            SECTION.               00027200
      *----------------------------------------------------------------*00028000
                                                                        00029000
           PERFORM 1000-INICIAR                                         00030000
                                                                        00040000
           PERFORM 2000-PROCESSAR                                       00041000
                                                                        00041100
           PERFORM 3000-FINALIZAR                                       00041200
                                                                        00041300
           STOP RUN.                                                    00041400
                                                                        00041500
      *----------------------------------------------------------------*00041600
       0000-99-FIM.                           EXIT.                     00041700
      *----------------------------------------------------------------*00041800
                                                                        00041900
      ******************************************************************00042000
      *                      I N I C I A R                             *00042100
      ******************************************************************00042200
                                                                        00042300
      *----------------------------------------------------------------*00042400
       1000-INICIAR                           SECTION.                  00042500
      *----------------------------------------------------------------*00042600
                                                                        00042700
            ACCEPT WRK-ID.                                              00042800
            ACCEPT WRK-NOME.                                            00042900
            ACCEPT WRK-SETOR.                                           00043000
            ACCEPT WRK-SALARIO.                                         00043100
            ACCEPT WRK-DATAADM.                                         00043200
            ACCEPT WRK-EMAIL.                                           00043300
            ACCEPT WRK-TELEFONE.                                        00043400
                                                                        00043500
      *----------------------------------------------------------------*00043600
       1000-99-FIM.                              EXIT.                  00043700
      *----------------------------------------------------------------*00043800
                                                                        00043900
      ******************************************************************00044000
      *                   P R O C E S S A R                            *00044100
      ******************************************************************00045000
                                                                        00045100
      *----------------------------------------------------------------*00045200
       2000-PROCESSAR                       SECTION.                    00045300
      *----------------------------------------------------------------*00045400
             EXEC SQL                                                   00045500
               SELECT ID,NOME,SETOR,SALARIO,DATAADM,EMAIL,TELEFONE      00045600
                INTO :DB2-ID,                                           00045700
                     :DB2-NOME,                                         00045800
                     :DB2-SETOR,                                        00045900
                     :DB2-SALARIO,                                      00046000
                     :DB2-DATAADM,                                      00047000
                     :DB2-EMAIL,                                        00048000
                     :DB2-TELEFONE                                      00048100
                FROM FOUR001.FUNC2                                      00048200
                WHERE ID = :DB2-ID                                      00048300
             END-EXEC.                                                  00048400
                                                                        00048500
             EVALUATE TRUE                                              00048600
             WHEN DB2-NOME              NOT EQUAL WRK-NOME-AC AND       00048700
                  WRK-NOME-AC           NOT EQUAL SPACES                00048800
             MOVE WRK-NOME-AC           TO DB2-NOME                     00048900
                                                                        00049000
             WHEN DB2-SETOR             NOT EQUAL WRK-SETOR-AC AND      00049100
                  WRK-SETOR-AC          NOT EQUAL SPACES                00049200
             MOVE WRK-SETOR-AC          TO DB2-SETOR                    00049300
                                                                        00049400
             WHEN DB2-SALARIO           NOT EQUAL WRK-SALARIO-AC AND    00049500
                  WRK-SALARIO-AC        NOT EQUAL ZEROS                 00049600
             MOVE WRK-SALARIO-AC        TO DB2-SALARIO                  00049700
                                                                        00049800
             WHEN DB2-DATAADM           NOT EQUAL WRK-DATAADM-AC AND    00049900
                  WRK-DATAADM-AC        NOT EQUAL SPACES                00050000
             MOVE WRK-DATAADM-AC        TO DB2-DATAADM                  00050100
                                                                        00050200
             WHEN DB2-EMAIL-TEXT        NOT EQUAL WRK-EMAIL-AC AND      00050300
                  WRK-EMAIL-AC          NOT EQUAL SPACES                00050400
             MOVE WRK-EMAIL-AC          TO DB2-EMAIL-TEXT               00050500
                                                                        00050600
             WHEN DB2-TELEFONE          NOT EQUAL WRK-TELEFONE-AC AND   00050700
                  WRK-TELEFONE-AC       NOT EQUAL SPACES                00050800
             MOVE WRK-TELEFONE-AC       TO DB2-TELEFONE                 00050900
             END-EVALUATE.                                              00051000
                                                                        00051100
             MOVE WRK-ID-AC                  TO DB2-ID.                 00051202
             MOVE WRK-NOME-AC                TO DB2-NOME.               00051302
             MOVE WRK-SETOR-AC               TO DB2-SETOR.              00051402
             MOVE WRK-SALARIO-AC             TO DB2-SALARIO.            00051502
             MOVE WRK-DATAADM-AC             TO DB2-DATAADM.            00051602
                                                                        00051702
             PERFORM VARYING WRK-CONTA       FROM 40                    00051802
                      BY -1 UNTIL WRK-CONTA  EQUAL 0                    00051902
                IF WRK-EMAIL-AC(WRK-CONTA:1) NOT EQUAL SPACES           00052002
                   MOVE WRK-CONTA            TO WRK-POS                 00052102
                   MOVE 1                    TO WRK-CONTA               00052202
                END-IF                                                  00052302
             END-PERFORM                                                00052402
                                                                        00052502
             MOVE WRK-POS                    TO DB2-EMAIL-LEN           00052602
             MOVE WRK-EMAIL-AC               TO DB2-EMAIL-TEXT.         00052702
             MOVE WRK-TELEFONE-AC            TO DB2-TELEFONE.           00052802
                                                                        00052900
             EXEC SQL                                                   00053000
              UPDATE FOUR001.FUNC2                                      00053100
               SET  NOME    =:DB2-NOME,                                 00053200
                    SETOR   =:DB2-SETOR,                                00053300
                    SALARIO =:DB2-SALARIO,                              00053400
                    DATAADM =:DB2-DATAADM,                              00053500
                    EMAIL   =:DB2-EMAIL,                                00053600
                    TELEFONE=:DB2-TELEFONE                              00053700
               WHERE ID=:DB2-ID                                         00053800
             END-EXEC.                                                  00053900
                                                                        00054000
             IF (SQLCODE NOT EQUAL ZEROS AND +100) OR                   00055004
                (SQLWARN0    EQUAL 'W')                                 00055104
                MOVE 'FR05DB1'            TO  WRK-PROGRAMA              00055204
                MOVE '2000  '             TO  WRK-SECAO                 00055304
                MOVE 'NA LEITURA'         TO  WRK-MENSAGEM              00055404
                MOVE 'WRK-SQLCODE'        TO  WRK-STATUS                00055504
                MOVE SQLCODE              TO  WRK-SQLCODE               00055604
                DISPLAY 'ERRO .....' WRK-SQLCODE                        00055704
                 PERFORM 9999-TRATAR-ERROS                              00055804
             END-IF.                                                    00055904
                                                                        00056000
             IF (SQLCODE               EQUAL +100)                      00056104
                DISPLAY WRK-ID '... NAO ENCONTRADO '                    00056204
                MOVE 'FR05DB1'            TO  WRK-PROGRAMA              00056304
                MOVE '2000  '             TO  WRK-SECAO                 00056404
                MOVE 'NA LEITURA'         TO  WRK-MENSAGEM              00056504
                MOVE 'WRK-SQLCODE'        TO  WRK-STATUS                00056604
             END-IF.                                                    00056704
                                                                        00056804
             EVALUATE SQLCODE                                           00056900
               WHEN 0                                                   00057000
                DISPLAY '--------------------------------------'        00057100
                DISPLAY '           DADOS ALTERADOS            '        00057200
                DISPLAY '--------------------------------------'        00057300
                DISPLAY 'ID....... ' DB2-ID                             00057400
                DISPLAY 'NOME..... ' DB2-NOME                           00057500
                DISPLAY 'SETOR.... ' DB2-SETOR                          00057600
                DISPLAY 'SALARIO.. ' DB2-SALARIO                        00057700
                DISPLAY 'DATAADM.. ' DB2-DATAADM                        00057800
                DISPLAY 'EMAIL.... ' DB2-EMAIL                          00057900
                DISPLAY 'TELEFONE. ' DB2-TELEFONE                       00058000
                DISPLAY '--------------------------------------'        00058100
               WHEN -181                                                00058200
                 DISPLAY 'FORMATO DATA ERRADO ' WRK-DATAADM-AC          00058300
               WHEN -803                                                00058403
                 DISPLAY WRK-ID 'RESGISTRO DUPLICADO'                   00058503
               WHEN OTHER                                               00058600
                 MOVE SQLCODE  TO WRK-SQLCODE                           00058700
                 DISPLAY 'ERRO.... ' WRK-SQLCODE                        00058800
             END-EVALUATE.                                              00058900
      *----------------------------------------------------------------*00059000
       2000-99-FIM.                       EXIT.                         00059100
      *----------------------------------------------------------------*00059200
                                                                        00059300
      ******************************************************************00059400
      *                 F I N A L I Z A C A O                          *00059500
      ******************************************************************00059600
                                                                        00059700
      *----------------------------------------------------------------*00059800
       3000-FINALIZAR                        SECTION.                   00059900
      *----------------------------------------------------------------*00060000
                                                                        00060100
              DISPLAY 'FIM DE PROCESSAMENTO'.                           00061000
                                                                        00070000
      *----------------------------------------------------------------*00071000
       3000-99-FIM.                           EXIT.                     00072000
      *----------------------------------------------------------------*00073000
                                                                        00074004
      ******************************************************************00075004
      *                 T R A T A R   E R R O S                        *00076004
      ******************************************************************00077004
                                                                        00078004
      *----------------------------------------------------------------*00079004
       9999-TRATAR-ERROS                     SECTION.                   00080004
      *----------------------------------------------------------------*00090004
                                                                        00100004
           CALL 'GRAVALOG'     USING WRK-LOG.                           00110004
                                                                        00120004
           GOBACK.                                                      00121004
                                                                        00122004
      *----------------------------------------------------------------*00130004
       9999-99-FIM.                           EXIT.                     00140004
      *----------------------------------------------------------------*00150004
