      *================================================================*00001001
       IDENTIFICATION                            DIVISION.              00002001
      *================================================================*00002101
                                                                        00002201
       PROGRAM-ID.  BALANCE.                                            00002301
                                                                        00002401
      *================================================================*00002501
      *                         F O U R S Y S                          *00002601
      *================================================================*00002701
      *    AUTOR    : DOUGLAS PEREIRA DA COSTA                         *00002801
      *    EMPRESA  : FOURSYS                                          *00002901
      *    INSTRUTOR: IVAN PETRUCCI                                    *00003001
      *    DATA     : 20/05/2022                                       *00004001
      *----------------------------------------------------------------*00004101
      *    OBJETIVO : EXERCIO DE BALANCE LINE                          *00004203
      *                                                                *00004301
      *----------------------------------------------------------------*00004801
      *    BOOKS    :                                                  *00004901
      *               B#ARQE - BOOK DE ENTRADA.                        *00005001
      *               B#ARQS - BOOK DE SAIDA.                          *00005101
      *================================================================*00005201
                                                                        00005301
      *================================================================*00005401
       ENVIRONMENT                                DIVISION.             00005501
      *================================================================*00005601
                                                                        00005701
      *----------------------------------------------------------------*00005801
       CONFIGURATION                              SECTION.              00005901
      *----------------------------------------------------------------*00006001
                                                                        00006101
       SPECIAL-NAMES.                                                   00006201
           DECIMAL-POINT IS COMMA.                                      00006301
                                                                        00006401
      *----------------------------------------------------------------*00006501
      *----------------------------------------------------------------*00006601
       INPUT-OUTPUT                               SECTION.              00006701
      *----------------------------------------------------------------*00006801
                                                                        00006901
       FILE-CONTROL.                                                    00007001
             SELECT CLIENT    ASSIGN     TO CLIENT                      00007107
                    FILE STATUS     IS WRK-FS-CLIENT.                   00007201
             SELECT LANCAM    ASSIGN     TO LANCAM                      00007304
                    FILE STATUS     IS WRK-FS-LANCAM.                   00007405
             SELECT CLIENTEO  ASSIGN     TO CLIENTEO                    00007504
                    FILE STATUS     IS WRK-FS-CLIENTEO.                 00007604
                                                                        00007704
      *================================================================*00007801
       DATA                                      DIVISION.              00007901
      *================================================================*00008001
                                                                        00008101
      *----------------------------------------------------------------*00008201
       FILE                                      SECTION.               00008301
      *----------------------------------------------------------------*00008401
                                                                        00008701
      *----------------------------------------------------------------*00008804
      *   INPUT - DADOS DO ARQUIVO DE ENTRADA (CLIENTES)               *00008906
      *                                                 - LRECL = 037  *00009006
      *----------------------------------------------------------------*00009104
                                                                        00009206
       FD CLIENT                                                        00009301
           RECORDING MODE IS F                                          00009401
           BLOCK CONTAINS 0 RECORDS.                                    00009501
       01 FD-CLIENT.                                                    00009601
          05 FD-CLIENT-CHAVE.                                           00009713
             10 FD-CLIENT-AGENCIA        PIC X(004).                    00009813
             10 FD-CLIENT-CONTA          PIC X(005).                    00009913
          05 FD-CLIENT-NOME              PIC X(020).                    00010013
          05 FD-CLIENT-SALDO             PIC X(008).                    00010113
                                                                        00011002
      *----------------------------------------------------------------*00011106
      *     INPUT - DADOS DO ARQUIVO DE ENTRADA (LANCAM)               *00011206
      *                                                 - LRECL = 037  *00011306
      *----------------------------------------------------------------*00011406
                                                                        00011506
       FD LANCAM                                                        00011606
           RECORDING MODE IS F                                          00011706
           LABEL RECORD IS STANDARD                                     00011806
           BLOCK CONTAINS 0 RECORDS.                                    00011906
                                                                        00012006
       01 FD_LANCM.                                                     00012106
          05 FD-LANCAM-CHAVE.                                           00012213
             10 FD-LANCAM-AGENCIA        PIC X(004).                    00012313
             10 FD-LANCAM-CONTA          PIC X(005).                    00012413
          05 FD-LANCAM-LANCAMENTO        PIC X(008).                    00012506
          05 FD-LANCAM-TIPO              PIC X(001).                    00012606
                                                                        00012706
      *----------------------------------------------------------------*00012806
      *     INPUT - DADOS DO ARQUIVO DE SAIDA (CLIENTEO)               *00012906
      *                                                 - LRECL = 037  *00013006
      *----------------------------------------------------------------*00013106
                                                                        00013206
       FD CLIENTEO                                                      00013306
           RECORDING MODE IS F                                          00013406
           LABEL RECORD IS STANDARD                                     00013506
           BLOCK CONTAINS 0 RECORDS.                                    00013606
                                                                        00013706
       01 FD_CLIENTEO                    PIC X(037).                    00013806
                                                                        00013906
      *----------------------------------------------------------------*00014201
       WORKING-STORAGE                            SECTION.              00014301
      *----------------------------------------------------------------*00014401
      *----------------------------------------------------------------*00014606
       01 FILLER                         PIC X(050)       VALUE         00014706
                   '*** INICIO DA WORKING BALANCE ***'.                 00014813
      *----------------------------------------------------------------*00014907
                                                                        00015010
       77 WRK-GRAVALOG                   PIC X(008) VALUE 'GRAVALOG'.   00015110
                                                                        00015210
      *----------------------------------------------------------------*00015301
       01 FILLER                         PIC X(050)       VALUE         00015406
                '*** AREA DE VARIAVEIS DE FILE-STATUS ***'.             00015506
      *----------------------------------------------------------------*00015606
                                                                        00015706
       77 WRK-FS-CLIENT                  PIC 9(007).                    00015806
       77 WRK-FS-LANCAM                  PIC 9(002).                    00015907
       77 WRK-FS-CLIENTEO                PIC 9(002).                    00016007
                                                                        00016107
      *----------------------------------------------------------------*00016206
      *----------------------------------------------------------------*00016311
       01 FILLER                         PIC X(050)       VALUE         00016411
                     '*** AREA DA BOOK GRAVALOG ***'.                   00016513
      *----------------------------------------------------------------*00016611
                                                                        00016711
                           COPY 'B#GRALOG'.                             00016813
                                                                        00016912
      *================================================================*00017001
       PROCEDURE                                 DIVISION.              00017101
      *================================================================*00017201
                                                                        00017301
      ******************************************************************00017401
      *              P R O G R A M A  P R I N C I P A L                *00017501
      ******************************************************************00017601
                                                                        00017701
      *----------------------------------------------------------------*00017801
       0000-PRINCIPAL                            SECTION.               00017901
      *----------------------------------------------------------------*00018001
                                                                        00018101
            PERFORM 1000-INICIAR                                        00018201
                                                                        00018301
            PERFORM 2000-VERIFICAR-VAZIO                                00018412
                                                                        00018512
            PERFORM 3000-PROCESSAR                                      00018612
                    UNTIL WRK-FS-CLIENT EQUAL 10                        00018712
                    AND   WRK-FS-LANCAM EQUAL 10                        00018812
            PERFORM 4000-FINALIZAR                                      00018912
                                                                        00019001
            STOP RUN.                                                   00019101
                                                                        00019201
      *----------------------------------------------------------------*00019301
       0000-99-FIM.                           EXIT.                     00019401
      *----------------------------------------------------------------*00019501
                                                                        00019601
      *----------------------------------------------------------------*00019701
      ******************************************************************00019801
      *                       I N I C I A R                            *00019901
      ******************************************************************00020001
                                                                        00020101
      *----------------------------------------------------------------*00020201
       1000-INICIAR                           SECTION.                  00020301
      *----------------------------------------------------------------*00020401
                                                                        00020501
           OPEN INPUT  CLIENT                                           00020610
                INPUT  LANCAM                                           00020710
                OUTPUT CLIENTEO                                         00020810
                                                                        00020910
           PERFORM 1100-TESTAR-STATUS.                                  00021001
                                                                        00021410
      *----------------------------------------------------------------*00021501
       1000-99-FIM.                            EXIT.                    00021601
      *----------------------------------------------------------------*00021701
                                                                        00021801
                                                                        00021901
      ******************************************************************00022001
      *                   T E S T A R  S T A T U S                     *00022101
      ******************************************************************00022201
                                                                        00022301
      *----------------------------------------------------------------*00022401
       1100-TESTAR-STATUS                    SECTION.                   00022501
      *----------------------------------------------------------------*00022601
                                                                        00023001
            PERFORM 1110-TESTAR-WRK-FS-CLIENT.                          00024010
                                                                        00025001
            PERFORM 1120-TESTAR-WRK-FS-LANCAM.                          00026010
                                                                        00027001
            PERFORM 1130-TESTAR-WRK-FS-CLIENTEO.                        00027110
                                                                        00027210
      *----------------------------------------------------------------*00028001
       1100-99-FIM.                            EXIT.                    00029001
      *----------------------------------------------------------------*00030001
                                                                        00040001
      ******************************************************************00041001
      *           TESTAR ARQUIVO DE ENTRADA - CLIENT                   *00042010
      ******************************************************************00043001
                                                                        00044001
      *----------------------------------------------------------------*00045001
       1110-TESTAR-WRK-FS-CLIENT          SECTION.                      00045110
      *----------------------------------------------------------------*00045201
                                                                        00045301
           IF WRK-FS-CLIENT NOT EQUAL ZEROS                             00045410
              MOVE 'BALANCE'                     TO WRK-PROGRAMA        00045512
              MOVE 'ERRO NA ABERTURA DO CLIENT'  TO WRK-MENSAGEM        00045612
              MOVE '1000'                        TO WRK-SECAO           00045712
              MOVE WRK-FS-CLIENT                 TO WRK-STATUS          00045812
              PERFORM 9000-TRATAR-ERRO                                  00045901
           END-IF.                                                      00046001
                                                                        00046101
      *----------------------------------------------------------------*00046201
       1110-99-FIM.                            EXIT.                    00046301
      *----------------------------------------------------------------*00047001
                                                                        00047101
      ******************************************************************00047201
      *           TESTAR ARQUIVO DE ENTRADO - WRK-LANCAM               *00047312
      ******************************************************************00047401
                                                                        00047501
      *----------------------------------------------------------------*00047601
       1120-TESTAR-WRK-FS-LANCAM               SECTION.                 00047712
      *----------------------------------------------------------------*00047801
                                                                        00047901
           IF WRK-FS-LANCAM NOT EQUAL ZEROS                             00048012
              MOVE 'BALANCE'                      TO WRK-PROGRAMA       00048112
              MOVE 'ERRO NO LANCAM'               TO WRK-MENSAGEM       00048213
              MOVE '1000'                         TO WRK-SECAO          00048312
              MOVE WRK-FS-LANCAM                  TO WRK-STATUS         00048413
              PERFORM 9000-TRATAR-ERRO                                  00048501
           END-IF.                                                      00048601
                                                                        00048701
      *----------------------------------------------------------------*00048801
       1120-99-FIM.                            EXIT.                    00048901
      *----------------------------------------------------------------*00049001
      ******************************************************************00049113
      *           TESTAR ARQUIVO DE SAIDA - WRK-CLIENTEO               *00049213
      ******************************************************************00049313
                                                                        00049413
      *----------------------------------------------------------------*00049513
       1120-TESTAR-WRK-FS-CLIENTEO             SECTION.                 00049613
      *----------------------------------------------------------------*00049713
                                                                        00049813
           IF WRK-FS-CLIENTEO NOT EQUAL ZEROS                           00049913
              MOVE 'BALANCE'                      TO WRK-PROGRAMA       00050013
              MOVE 'ERRO NA ABERTURA DO CLIENTEO' TO WRK-MENSAGEM       00050113
              MOVE '1000'                         TO WRK-SECAO          00050213
              MOVE WRK-FS-CLIENTEO                TO WRK-STATUS         00050313
              PERFORM 9000-TRATAR-ERRO                                  00050413
           END-IF.                                                      00050513
                                                                        00050613
      *----------------------------------------------------------------*00050713
       1120-99-FIM.                            EXIT.                    00050813
      *----------------------------------------------------------------*00050913
      ******************************************************************00051001
      *                  V E R I F I C A R  V A Z I O                  *00051101
      ******************************************************************00051201
                                                                        00051301
      *----------------------------------------------------------------*00051401
       2000-VERIFICAR-VAZIO                 SECTION.                    00051501
      *----------------------------------------------------------------*00051601
            READ CLIENT                INTO WRK-CLIENT                  00051713
                                                                        00051801
               IF WRK-FS-CLIENT    EQUAL '10'                           00051913
                  DISPLAY '********************************'            00052001
                  DISPLAY '                                '            00052101
                  DISPLAY '   ARQUIVO CLIENT ESTA VAZIO    '            00052213
                  DISPLAY '    PROCESSAMENTO ENCERRADO     '            00052301
                  DISPLAY '                                '            00052401
                  DISPLAY '********************************'            00052501
               END-IF.                                                  00052601
                                                                        00052701
      *----------------------------------------------------------------*00052801
       2000-99-FIM.                         EXIT.                       00052901
      *----------------------------------------------------------------*00053001
                                                                        00053101
      ******************************************************************00053201
      *                     P R O C E S S A R                          *00053301
      ******************************************************************00053401
                                                                        00053501
      *----------------------------------------------------------------*00053601
       3000-PROCESSAR                        SECTION.                   00053701
      *----------------------------------------------------------------*00053801
                                                                        00053901
            EVALUATE TRUE                                               00054013
                                                                        00054113
            WHEN FD-CLIENT-CHAVE          LESS FD-LANCAM-CHAVE          00054213
                 WRITE FD-CLIENTEO        FROM FD-CLIENTEO              00054313
            PERFORM 2100-TESTAR-STATUS                                  00054413
            ADD 1                         TO WRK-LIDOS                  00054501
                                                                        00054601
            IF WRK-QUANT-PECA          LESS THAN 20                     00054701
               COMPUTE WRK-QUANT-COMPRA = 20 - WRK-QUANT-PECA           00054801
               MOVE WRK-COD-PECA       TO WRK-COD-PECA-S                00054901
               MOVE WRK-FORN-PECA      TO WRK-FORN-PECA-S               00055001
               WRITE FD-PECACOMP       FROM WRK-PECACOMP                00055101
               ADD 1                   TO WRK-GRAVADOS                  00055201
            END-IF                                                      00055301
                                                                        00055401
            READ ARQPECAS              INTO WRK-ARQPECAS.               00055501
      *----------------------------------------------------------------*00055601
       3000-99-FIM.                           EXIT.                     00055701
      *----------------------------------------------------------------*00055801
      *----------------------------------------------------------------*00055901
      ******************************************************************00056001
      *                     F I N A L I Z A R                          *00056101
      ******************************************************************00056201
      *----------------------------------------------------------------*00056301
       4000-FINALIZAR                        SECTION.                   00056401
      *----------------------------------------------------------------*00056501
            IF WRK-LIDOS      GREATER ZEROS                             00056601
               PERFORM 4100-TOTAIS-LIDOS                                00056701
            END-IF                                                      00056801
                                                                        00056901
            CLOSE ARQPECAS                                              00057001
                  PECACOMP                                              00057101
            IF WRK-FS-PECAS           NOT EQUAL ZEROS                   00057201
               MOVE 'ERRO NO FECHAMENTO ARQPECAS' TO WRK-MSG            00057301
               PERFORM 9000-TRATAR-ERRO                                 00057401
               GO                                 TO 4000-99-FIM        00057501
            END-IF                                                      00057601
                                                                        00057701
            IF WRK-FS-PECACOMP        NOT EQUAL ZEROS                   00057801
               MOVE 'ERRO NO FECHAMENTO PECACOMP' TO WRK-MSG            00057901
               PERFORM 9000-TRATAR-ERRO                                 00058001
            END-IF.                                                     00058101
      *----------------------------------------------------------------*00058201
       4000-99-FIM.                           EXIT.                     00058301
      *----------------------------------------------------------------*00058401
                                                                        00058501
      ******************************************************************00058601
      *                    T O T A I S  L I D O S                      *00058701
      ******************************************************************00058801
      *----------------------------------------------------------------*00058901
       4100-TOTAIS-LIDOS                     SECTION.                   00059001
      *----------------------------------------------------------------*00059101
                                                                        00059201
                  DISPLAY '********************************'            00059301
                  DISPLAY '                                '            00059401
                  DISPLAY '  LIDOS   :  ' WRK-LIDOS                     00059501
                  DISPLAY '  GRAVADOS:  ' WRK-GRAVADOS                  00059601
                  DISPLAY '                                '            00059701
                  DISPLAY '********************************'.           00059801
                                                                        00059901
      *----------------------------------------------------------------*00060001
       4100-99-FIM.                           EXIT.                     00060101
      *----------------------------------------------------------------*00060201
      ******************************************************************00060301
      *                   T R A T A R  E R R O                         *00060401
      ******************************************************************00060501
                                                                        00060601
       9000-TRATAR-ERRO                     SECTION.                    00060701
      *----------------------------------------------------------------*00060801
                                                                        00060901
                  DISPLAY '********************************'            00061001
                  DISPLAY '                                '            00061101
                  DISPLAY '  ERRO: ' WRK-MSG                            00061201
                  DISPLAY '                                '            00061301
                  DISPLAY '********************************'            00061401
                  GOBACK.                                               00061501
      *----------------------------------------------------------------*00061601
       9000-99-FIM.                           EXIT.                     00061701
      *----------------------------------------------------------------*00062001
