      *================================================================*00001000
       IDENTIFICATION                            DIVISION.              00002000
      *================================================================*00002100
                                                                        00002200
       PROGRAM-ID.  F05CIP3.                                            00002300
       AUTHOR.      DOUGLAS.                                            00002400
                                                                        00002500
      *================================================================*00002600
      *                         F O U R S Y S                          *00002700
      *================================================================*00002800
      *    PROGRAMA...: F05CIP3                                        *00002900
      *    TIPO.......: SERVICO DE ACESSO A DADOS                      *00003000
      *----------------------------------------------------------------*00003100
      *    PROGAMADOR.: DOUGLAS COSTA                                  *00003200
      *    EMPRESA....: FOURSYS                                        *00003300
      *    ANALISTA...: IVAN SANCHES                                   *00003400
      *    DATA.......: 28/06/2022                                     *00003500
      *----------------------------------------------------------------*00003600
      *    OBJETIVO : LEITURA DE DO MAPASET                            *00003700
      *                                                                *00003800
      *----------------------------------------------------------------*00003900
      *    BASE DE DADOS:                                              *00004000
      *----------------------------------------------------------------*00004100
      *    MODULOS.......:                                             *00004200
      *     GRAVALOG  - TRATAMENTO DE ERROS                            *00004300
      *----------------------------------------------------------------*00004400
      *    COPYBOOKS.....:                                             *00004500
      *     B#GRAVLOG - AREA DE TRATAMENTO DE ERROS                    *00004600
      *================================================================*00004700
                                                                        00004800
      *================================================================*00004900
       ENVIRONMENT DIVISION.                                            00005000
      *================================================================*00005100
                                                                        00005200
      *----------------------------------------------------------------*00005300
       CONFIGURATION                              SECTION.              00005400
      *----------------------------------------------------------------*00005500
                                                                        00005600
       SPECIAL-NAMES.                                                   00005700
           DECIMAL-POINT IS COMMA.                                      00005800
                                                                        00005900
      *----------------------------------------------------------------*00006000
                                                                        00006100
      *================================================================*00006200
       DATA                DIVISION.                                    00006300
      *================================================================*00006400
                                                                        00006500
      *----------------------------------------------------------------*00006600
       WORKING-STORAGE                            SECTION.              00006700
      *----------------------------------------------------------------*00006800
                                                                        00006900
      *----------------------------------------------------------------*00007000
       01  FILLER                      PIC  X(050)         VALUE        00008000
               '*** INICIO DA WORKING F05CIP3 ***'.                     00009000
      *----------------------------------------------------------------*00010000
                                                                        00011000
      *----------------------------------------------------------------*00011100
       01  FILLER                       PIC X(050)           VALUE      00011200
                       '*** AREA F05CIMX ***'.                          00011300
      *----------------------------------------------------------------*00011400
                                                                        00011500
           COPY F05CIMX.                                                00011600
           COPY DFHAID.                                                 00011704
                                                                        00011804
      *----------------------------------------------------------------*00011900
       01  FILLER                       PIC X(050)           VALUE      00012000
                    '*** VARIAVEIS AUXILIARES ***'.                     00012100
      *----------------------------------------------------------------*00013000
                                                                        00013107
       01 WRK-FLEG            PIC 9(01) VALUE ZEROS.                    00014012
                                                                        00015007
       01 WRK-RET             PIC S9(04) COMP.                          00016000
                                                                        00016112
       01 WRK-ENTRADA.                                                  00016212
          05 WRK-TRANS        PIC X(04).                                00016312
          05 WRK-CHAVE        PIC X(05).                                00016412
          05 WRK-NOME         PIC X(30).                                00016512
          05 WRK-SETOR        PIC X(04).                                00016612
          05 WRK-SALARIO      PIC X(10).                                00016712
          05 WRK-DATAADM      PIC X(10).                                00016812
          05 WRK-EMAIL        PIC X(40).                                00016912
          05 WRK-STATUS       PIC X(20).                                00017015
                                                                        00017112
       01 WRK-DADOS.                                                    00017200
          05 WRK-CHAVE        PIC X(05).                                00017300
          05 WRK-NOME         PIC X(30).                                00017400
          05 WRK-SETOR        PIC X(04).                                00017500
          05 WRK-SALARIO      PIC X(10).                                00017600
          05 WRK-DATAADM      PIC X(10).                                00017700
          05 WRK-EMAIL        PIC X(40).                                00017800
                                                                        00017912
       77 WRK-SAIDA           PIC X(30) VALUE ' ATE LOGO! '.            00018008
                                                                        00018107
      *----------------------------------------------------------------*00018200
       01  FILLER                      PIC  X(050)         VALUE        00018300
                '*** F05CIP3 - FIM DA AREA DE WORKING ***'.             00019000
      *----------------------------------------------------------------*00020000
                                                                        00021000
      *================================================================*00022000
        PROCEDURE                       DIVISION.                       00023000
      *================================================================*00024000
                                                                        00025000
      ******************************************************************00025100
      *                    P R I N C I P A L                           *00025200
      ******************************************************************00025300
                                                                        00025400
      *----------------------------------------------------------------*00025500
       0000-PRINCIPAL                            SECTION.               00025600
      *----------------------------------------------------------------*00025700
                                                                        00025800
           PERFORM 1000-INICIAR.                                        00025900
                                                                        00026000
           PERFORM 2000-PROCESSAR.                                      00026100
                                                                        00026200
           PERFORM 3000-FINALIZAR.                                      00026300
                                                                        00026400
              EXEC CICS SEND                                            00026512
              FROM(WRK-ENTRADA)                                         00026612
              ERASE                                                     00026712
              END-EXEC.                                                 00026812
                                                                        00026912
              EXEC CICS                                                 00027012
                RETURN                                                  00027112
              END-EXEC.                                                 00027212
                                                                        00027312
      ******************************************************************00027400
      *                       I N I C I A I S                          *00028000
      ******************************************************************00029000
                                                                        00030000
      *----------------------------------------------------------------*00040000
       1000-INICIAR                           SECTION.                  00041000
      *----------------------------------------------------------------*00041100
                                                                        00041214
             INITIALIZE WRK-ENTRADA.                                    00041319
                                                                        00041414
             EXEC CICS RECEIVE                                          00041512
               INTO(WRK-ENTRADA)                                        00041612
             END-EXEC.                                                  00041712
                                                                        00042408
      *----------------------------------------------------------------*00042500
       1000-99-FIM.                          EXIT.                      00043000
      *----------------------------------------------------------------*00043100
                                                                        00043200
      ******************************************************************00043300
      *                      P R O C E S S A R                         *00043400
      ******************************************************************00043500
                                                                        00043600
      *----------------------------------------------------------------*00043700
       2000-PROCESSAR                       SECTION.                    00043800
      *----------------------------------------------------------------*00043900
                                                                        00044000
           EXEC CICS READ                                               00044112
            FILE('FUNC')                                                00044212
            RIDFLD(WRK-CHAVE OF WRK-ENTRADA)                            00044312
            INTO(WRK-DADOS)                                             00044412
            RESP(WRK-RET)                                               00044512
           END-EXEC.                                                    00044600
                                                                        00044700
           IF WRK-RET                EQUAL DFHRESP(NOTFND)              00045017
              MOVE 2                 TO WRK-STATUS                      00045118
           ELSE                                                         00045217
              MOVE CORR WRK-DADOS    TO WRK-ENTRADA                     00045317
              MOVE 1                 TO WRK-STATUS                      00045417
                                                                        00045517
              IF (WRK-SALARIO OF WRK-ENTRADA  NOT NUMERIC) OR           00045617
                 (WRK-SALARIO OF WRK-ENTRADA  EQUAL ZEROS)              00045717
                 MOVE 3                       TO WRK-STATUS             00045817
              END-IF                                                    00045917
              IF WRK-EMAIL OF WRK-ENTRADA     EQUAL SPACES              00046017
                 MOVE 4                       TO WRK-STATUS             00049517
              END-IF                                                    00049617
           END-IF.                                                      00049717
                                                                        00049817
           EXEC CICS SEND                                               00049920
            FROM(WRK-STATUS)                                            00050020
           END-EXEC.                                                    00050120
      *----------------------------------------------------------------*00050200
       2000-99-FIM.                            EXIT.                    00050300
      *----------------------------------------------------------------*00050400
                                                                        00050500
      ******************************************************************00050600
      *                     F I N A L I Z A R                          *00051000
      ******************************************************************00060000
                                                                        00070000
      *----------------------------------------------------------------*00071000
       3000-FINALIZAR                        SECTION.                   00071100
      *----------------------------------------------------------------*00071200
                                                                        00071300
           EXEC CICS SEND                                               00071414
            FROM(WRK-ENTRADA)                                           00071514
            ERASE                                                       00071614
           END-EXEC.                                                    00071700
                                                                        00072114
           EXEC CICS                                                    00072214
             RETURN                                                     00072314
           END-EXEC.                                                    00072414
      *----------------------------------------------------------------*00072500
       3000-99-FIM.                           EXIT.                     00072600
      *----------------------------------------------------------------*00072700
                                                                        00072800
      ******************************************************************00072900
      *                  T R A T A R  E R R O                          *00073000
      ******************************************************************00073100
                                                                        00073200
      *----------------------------------------------------------------*00073300
       9000-TRATAR-ERRO                      SECTION.                   00073400
      *----------------------------------------------------------------*00073500
                                                                        00073600
      *----------------------------------------------------------------*00073700
       9000-99-FIM.                           EXIT.                     00074000
      *----------------------------------------------------------------*00075000
