      *=============================================================*   00001000
       IDENTIFICATION                            DIVISION.              00002000
      *=============================================================*   00003000
                                                                        00004000
       PROGRAM-ID. FR05CB13.                                            00005000
                                                                        00006000
      *=============================================================*   00007000
      *     AUTOR   : DOUGLAS PEREIRA DA COSTA                      *   00008000
      *     EMPRESA : FOURSYS                                       *   00009000
      *-------------------------------------------------------------*   00010000
      *     DATA    : 20/04/2022                                    *   00020000
      *     OBJETIVO: COMANDO DE SUBTRACAO ENTRE DOIS VALORES       *   00030001
      *=============================================================*   00032000
                                                                        00033000
      *=============================================================*   00034000
      *ENVIRONMENT                               DIVISION.              00035000
      *=============================================================*   00036000
       DATA                                       DIVISION.             00037000
      *=============================================================*   00038000
                                                                        00039000
      *-------------------------------------------------------------*   00040000
       WORKING-STORAGE                             SECTION.             00050000
      *-------------------------------------------------------------*   00060000
       01 WRK-SUBTRACAO.                                                00070000
          05 WRK-VALOR1       PIC 99         VALUE ZEROS.               00071000
          05 WRK-VALOR2       PIC 99         VALUE ZEROS.               00072000
          05 WRK-RESULTADO    PIC 999        VALUE ZEROS.               00072200
      *=============================================================*   00072300
       PROCEDURE                                 DIVISION.              00072400
      *=============================================================*   00072500
                                                                        00072600
      *-------------------------------------------------------------*   00072700
       0000-PRINCIPAL                              SECTION.             00072800
      *-------------------------------------------------------------*   00072900
           ACCEPT WRK-SUBTRACAO FROM SYSIN                              00073000
                                                                        00074000
           SUBTRACT WRK-VALOR1 FROM WRK-VALOR2 GIVING WRK-RESULTADO     00076000
                                                                        00077000
           DISPLAY '=================================='                 00078000
           DISPLAY 'A SUBTRACAO DO VALOR' WRK-VALOR1                    00079000
           DISPLAY 'COM O VALOR         ' WRK-VALOR2                    00079100
           DISPLAY 'TEM COMO RESULTADO  ' WRK-RESULTADO                 00079300
           DISPLAY '=================================='                 00079400
           STOP RUN.                                                    00079500
      *-------------------------------------------------------------*   00079600
       0000-99-FIM.                                   EXIT.             00079700
      *-------------------------------------------------------------*   00079800
                                                                        00079900
      *-------------------------------------------------------------*   00080000
       9000-TRATA-ERROS                               SECTION.          00081000
      *-------------------------------------------------------------*   00082000
                                                                        00083000
      *-------------------------------------------------------------*   00084000
       9000-FIM.                                      EXIT.             00085000
      *-------------------------------------------------------------*   00086000
