      *================================================================*00001001
       IDENTIFICATION                            DIVISION.              00002001
      *================================================================*00002101
                                                                        00002201
       PROGRAM-ID.  FR05CB30.                                           00002301
                                                                        00002401
      *================================================================*00002501
      *                         F O U R S Y S                          *00002601
      *================================================================*00002701
      *    AUTOR    : DOUGLAS PEREIRA DA COSTA                          00002801
      *    EMPRESA  : FOURSYS                                           00002901
      *----------------------------------------------------------------*00003001
      *    DATA     : 28/04/2022                                        00004001
      *    OBJETIVO : APLICAR CONHECIMENTO SOBRE ARQUIVOS               00005001
      *================================================================*00005101
                                                                        00005201
      *================================================================*00005301
       ENVIRONMENT DIVISION.                                            00005401
      *================================================================*00005501
                                                                        00005601
      *----------------------------------------------------------------*00006501
       CONFIGURATION                              SECTION.              00006601
      *----------------------------------------------------------------*00006701
                                                                        00006801
       SPECIAL-NAMES.                                                   00006901
           DECIMAL-POINT IS COMMA.                                      00007001
                                                                        00007101
      *----------------------------------------------------------------*00007201
      *----------------------------------------------------------------*00007303
       INPUT-OUTPUT                               SECTION.              00007403
      *----------------------------------------------------------------*00007503
                                                                        00007603
       FILE-CONTROL.                                                    00007703
             SELECT FUNC ASSIGN     TO FUNC                             00007809
                    FILE STATUS     IS WRK-FS-FUNC.                     00007903
                                                                        00008003
      *================================================================*00008101
       DATA                                      DIVISION.              00008201
      *================================================================*00008301
                                                                        00008401
      *----------------------------------------------------------------*00008501
       FILE                                      SECTION.               00008601
      *----------------------------------------------------------------*00008701
                                                                        00008801
       FD FUNC                                                          00008901
           RECORDING MODE IS F                                          00009001
           BLOCK CONTAINS 0 RECORDS.                                    00009105
                                                                        00009201
       01 FD-REGISTRO.                                                  00009307
          05 FD-ID                 PIC 9(05).                           00009407
          05 FD-NOME               PIC X(15).                           00009510
          05 FD-FUNCAO             PIC X(04).                           00009611
             88 FD-VALIDADOR VALUE '0234'.                              00009711
          05 FD-RESTO              PIC X(16).                           00009812
                                                                        00009901
      *----------------------------------------------------------------*00010001
       WORKING-STORAGE                            SECTION.              00010101
      *----------------------------------------------------------------*00010201
                                                                        00010301
        01 WRK-FS-FUNC                  PIC X(02) VALUE SPACES.         00010405
        01 WRK-REGISTRO.                                                00010502
           05 WRK-ID                    PIC 9(05) VALUE ZEROS.          00010602
           05 WRK-NOME                  PIC X(15) VALUE SPACES.         00010710
           05 WRK-FUNCAO                PIC X(04) VALUE ZEROS.          00010811
              88 WRK-VALIDADOR          VALUE '0234'.                   00010911
           05 WRK-RESTO                 PIC X(16) VALUE SPACES.         00011012
        77 WRK-MSG                      PIC X(50) VALUE SPACES.         00011102
        77 WRK-ACUM                     PIC 9(02) VALUE ZEROS.          00011213
                                                                        00011301
      *================================================================*00011401
       PROCEDURE DIVISION.                                              00011501
      *================================================================*00011601
                                                                        00011701
      ******************************************************************00011801
      *                    ROTINA PRINCIPAL                           * 00011901
      ******************************************************************00012001
                                                                        00012101
      *----------------------------------------------------------------*00012201
       0000-PRINCIPAL                            SECTION.               00012301
      *----------------------------------------------------------------*00012401
                                                                        00012501
           PERFORM 1000-INICIAR.                                        00012601
           IF WRK-FS-FUNC EQUAL ZEROS                                   00012705
              PERFORM 2000-PROCESSAR UNTIL WRK-FS-FUNC EQUAL '10'       00013006
           END-IF.                                                      00014001
           PERFORM 3000-FINALIZAR.                                      00015001
           STOP RUN.                                                    00016001
                                                                        00017001
      *----------------------------------------------------------------*00018001
       0000-99-FIM.                           EXIT.                     00019001
      *----------------------------------------------------------------*00020001
                                                                        00021001
      *----------------------------------------------------------------*00022001
       1000-INICIAR                           SECTION.                  00023001
      *----------------------------------------------------------------*00023101
                                                                        00023201
            OPEN INPUT FUNC.                                            00023301
                IF WRK-FS-FUNC NOT EQUAL ZEROS                          00023401
                   MOVE 'STATUS DO OPEN-' TO  WRK-MSG                   00023506
                   PERFORM 9000-TRATAR-ERRO                             00023606
                END-IF.                                                 00023701
                                                                        00023801
      *----------------------------------------------------------------*00023901
       1000-99-FIM.                            EXIT.                    00024001
      *----------------------------------------------------------------*00025001
                                                                        00026001
      ******************************************************************00027001
      *                        PROCESSAMENTO                           *00028001
      ******************************************************************00029001
                                                                        00030001
      *----------------------------------------------------------------*00040001
       2000-PROCESSAR                       SECTION.                    00041001
      *----------------------------------------------------------------*00042001
             READ FUNC INTO WRK-REGISTRO.                               00043002
                IF WRK-FS-FUNC NOT EQUAL ZEROS                          00044002
                   MOVE 'FINAL DE ARQUIVO...' TO WRK-MSG                00044102
                ELSE                                                    00044302
                   IF WRK-VALIDADOR                                     00044413
                      ADD 1 TO WRK-ACUM                                 00044513
                      PERFORM 2100-RELATORIO                            00044613
                   END-IF                                               00044713
                END-IF.                                                 00044802
      *----------------------------------------------------------------*00044901
       2000-99-FIM.                            EXIT.                    00045001
      *----------------------------------------------------------------*00045101
      *----------------------------------------------------------------*00045213
       2100-RELATORIO                          SECTION.                 00045313
      *----------------------------------------------------------------*00045413
           DISPLAY '---------------------------------'.                 00045613
           DISPLAY 'REGISTRO..........:' WRK-REGISTRO.                  00045713
           DISPLAY 'NUMERO DE ANALISTA:' WRK-ACUM.                      00045813
      *----------------------------------------------------------------*00045913
       2100-99-FIM.                            EXIT.                    00046013
      *----------------------------------------------------------------*00046113
      ******************************************************************00046201
      *                        FINALIZAR                               *00046301
      ******************************************************************00046401
                                                                        00047001
      *----------------------------------------------------------------*00048001
       3000-FINALIZAR                        SECTION.                   00049001
      *----------------------------------------------------------------*00050001
                                                                        00051001
            CLOSE FUNC.                                                 00052001
                IF WRK-FS-FUNC NOT EQUAL ZEROS                          00052101
                   MOVE 'STATUS NO CLOSE-' TO WRK-MSG                   00052202
                   PERFORM 9000-TRATAR-ERRO                             00052306
                END-IF.                                                 00052401
                                                                        00052501
      *----------------------------------------------------------------*00052601
       3000-99-FIM.                           EXIT.                     00052701
      *----------------------------------------------------------------*00052801
      *----------------------------------------------------------------*00052901
       9000-TRATAR-ERRO                      SECTION.                   00053001
      *----------------------------------------------------------------*00053101
                                                                        00053201
           DISPLAY '---------------------------------'.                 00053301
           DISPLAY 'MENSAGEM.......:' WRK-MSG.                          00053401
           DISPLAY 'FILE-STATUS....:' WRK-FS-FUNC.                      00053501
           DISPLAY '---------------------------------'.                 00053601
                                                                        00053701
      *----------------------------------------------------------------*00053801
       9000-FIM.                              EXIT.                     00053901
      *----------------------------------------------------------------*00054001
