      *=========================================================*
       IDENTIFICATION                            DIVISION.
      *=========================================================*

       PROGRAM-ID. FR05LVSA.
       AUTHOR.     DOUGLAS.

      *================================================================*
      *                         F O U R S Y S                          *
      *================================================================*
      *    PROGRAMA   : FR05LVSA                                       *
      *    TIPO       : SERVICO DE ACESSO A DADOS                      *
      *----------------------------------------------------------------*
      *    PROGAMADOR : DOUGLAS COSTA                                  *
      *    EMPRESA    : FOURSYS                                        *
      *    ANALISTA   : IVAN SANCHES                                   *
      *    DATA       : 27/06/2022                                     *
      *----------------------------------------------------------------*
      *    OBJETIVO   : APLICANDO CONHECIMENTO EM VSAM                 *
      *                                                                *
      *----------------------------------------------------------------*
      *    ARQUIVOS   :                                                *
      *     DDNAME               I/O                      INCLUDE/BOOK *
      *    ARQVSAM                I                                    *
      *----------------------------------------------------------------*
      ******************************************************************

      *================================================================*
       ENVIRONMENT                               DIVISION.
      *================================================================*

      *----------------------------------------------------------------*
       CONFIGURATION                             SECTION.
      *----------------------------------------------------------------*

       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.

      *----------------------------------------------------------------*
       INPUT-OUTPUT                              SECTION.
      *----------------------------------------------------------------*

       FILE-CONTROL.
            SELECT ARQVSAM  ASSIGN TO ARQVSAM
               ORGANIZATION  IS INDEXED
               ACCESS MODE   IS DYNAMIC
               RECORD KEY    IS ARQ-CHAVE
               FILE STATUS   IS FS-ARQVSAM.

      *================================================================*
       DATA                                      DIVISION.
      *================================================================*

      *----------------------------------------------------------------*
       FILE                                       SECTION.
      *----------------------------------------------------------------*

       FD ARQVSAM.
          01 REG-ARQVSAM.
             05 ARQ-CHAVE   PIC X(5).
             05 ARQ-NOME    PIC X(30).
             05 ARQ-SETOR   PIC X(04).
             05 ARQ-SALARIO PIC X(10).
             05 ARQ-DATAADM PIC X(10).
             05 ARQ-EMAIL   PIC X(40).

      *----------------------------------------------------------------*
       WORKING-STORAGE                            SECTION.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
        01  FILLER                    PIC X(050)               VALUE
                         '*** AREA DA BOOK ***'.
      *----------------------------------------------------------------*



      *----------------------------------------------------------------*
        01  FILLER                    PIC X(050)               VALUE
                    '*** VARIAVEIS AUXILIARES ***'.
      *----------------------------------------------------------------*

       77 FS-ARQVSAM     PIC 9(2).

      *================================================================*
       PROCEDURE                                 DIVISION.
      *================================================================*

      ******************************************************************
      *                       P R I N C I P A L                        *
      ******************************************************************

      *----------------------------------------------------------------*
       0000-PRINCIPAL                            SECTION.
      *----------------------------------------------------------------*

           PERFORM 1000-INICIAR.

           PERFORM 2000-PROCESSAR.

           PERFORM 3000-FINALIZAR.

      *----------------------------------------------------------------*
       0000-99-FIM.                        EXIT.
      *----------------------------------------------------------------*
      ******************************************************************
      *                       I N I C I A R                            *
      ******************************************************************
      *----------------------------------------------------------------*
       1000-INICIAR                              SECTION.
      *----------------------------------------------------------------*

           OPEN I-O   ARQVSAM.

           IF FS-ARQVSAM NOT EQUAL ZEROS
              DISPLAY 'ERRO NA ABERTURA DO ARQUIVO ARQVSAM'
              PERFORM 9000-TRATAR-ERRO
           END-IF.

      *----------------------------------------------------------------*
       1000-99-FIM.                        EXIT.
      *----------------------------------------------------------------*
      ******************************************************************
      *                     P R O C E S S A R                          *
      ******************************************************************
      *----------------------------------------------------------------*
       2000-PROCESSAR                            SECTION.
      *----------------------------------------------------------------*

           ACCEPT ARQ-CHAVE FROM SYSIN.

           READ ARQVSAM.

                IF FS-ARQVSAM NOT EQUAL ZEROS
                   DISPLAY 'REGISTRO NAO ENCONTRADO'
                   DISPLAY 'CODIGO VSAM: ' FS-ARQVSAM
                ELSE
                   DISPLAY '-----------------------------'
                   DISPLAY '          REGISTRO           '
                   DISPLAY '-----------------------------'
                   DISPLAY 'CHAVE    : ' ARQ-CHAVE
                   DISPLAY 'NOME     : ' ARQ-NOME
                   DISPLAY 'SETOR    : ' ARQ-SETOR
                   DISPLAY 'SALARIO  : ' ARQ-SALARIO
                   DISPLAY 'DATAADM  : ' ARQ-DATAADM
                   DISPLAY 'EMAIL    : ' ARQ-EMAIL
                END-IF.

      *----------------------------------------------------------------*
       2000-99-FIM.                          EXIT.
      *----------------------------------------------------------------*
      ******************************************************************
      *                     F I N A L I Z A R                          *
      ******************************************************************
      *----------------------------------------------------------------*
       3000-FINALIZAR                           SECTION.
      *----------------------------------------------------------------*

           DISPLAY '---PROCESSAMENTO ENCERRADO---'
           STOP RUN.

      *----------------------------------------------------------------*
       3000-99-FIM.                          EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       9000-TRATAR-ERRO                         SECTION.
      *----------------------------------------------------------------*


      *----------------------------------------------------------------*
       9000-99-FIM.                          EXIT.
      *----------------------------------------------------------------*
