      *=============================================================*   00001002
       IDENTIFICATION                            DIVISION.              00010000
      *=============================================================*   00011002
                                                                        00012002
       PROGRAM-ID. FR05CB20.                                            00020000
                                                                        00021002
      *=============================================================*   00030002
      *     AUTOR   : DOUGLAS PEREIRA DA COSTA                      *   00040002
      *     EMPRESA : FOURSYS                                       *   00050002
      *-------------------------------------------------------------*   00051002
      *     DATA    : 22/04/2022                                        00060000
      *     OBJETIVO: COMANDO DIVIDE                                    00070000
      *=============================================================*   00071002
                                                                        00071102
      *=============================================================*   00071302
      *ENVIRONMENT                               DIVISION.              00072000
      *=============================================================*   00073002
       DATA                                       DIVISION.             00074002
      *=============================================================*   00075002
                                                                        00075102
      *-------------------------------------------------------------*   00075202
       WORKING-STORAGE                             SECTION.             00076002
      *-------------------------------------------------------------*   00077002
       01 WRK-ACCEPT.                                                   00078001
          05 WRK-VALOR        PIC 9(05) COMP VALUE 00500.               00079001
          05 WRK-QTPARCELAS   PIC 9(03) COMP VALUE 020.                 00079101
          05 WRK-VLR-PARC     PIC 9(05) COMP VALUE 0.                   00079204
          05 WRK-RESTO        PIC 9(05) COMP VALUE 0                    00079304
      *===================================================              00080000
       PROCEDURE                                 DIVISION.              00090000
      *===================================================              00090100
                                                                        00090202
      *-------------------------------------------------------------*   00090302
       0000-PRINCIPAL                              SECTION.             00090402
      *-------------------------------------------------------------*   00090502
           DIVIDE WRK-VALOR BY WRK-QTPARCELAS GIVING WRK-VLR-PARC       00090604
           REMAINDER WRK-RESTO                                          00090704
             ON SIZE ERROR                                              00090804
                DISPLAY 'ESTOURO DE DIVISAO'                            00090904
             NOT ON SIZE ERROR                                          00091004
                DISPLAY WRK-VALOR                                       00091104
           END-DIVIDE.                                                  00091205
                                                                        00091304
           DISPLAY '========================'                           00091404
           DISPLAY 'VALOR              :' WRK-VALOR                     00091504
           DISPLAY 'PARCELAS           :' WRK-QTPARCELAS                00091604
           DISPLAY 'VALOR DAS PARCELAS :' WRK-VLR-PARC                  00091704
           DISPLAY 'RESTO              :' WRK-RESTO                     00091804
           DISPLAY '========================'                           00091904
           STOP RUN.                                                    00092000
      *-------------------------------------------------------------*   00093002
       0000-99-FIM.                                   EXIT.             00094002
      *-------------------------------------------------------------*   00095002
