      *=============================================================*   00001000
       IDENTIFICATION                            DIVISION.              00002000
      *=============================================================*   00003000
                                                                        00004000
       PROGRAM-ID. FR05CB12.                                            00005000
                                                                        00006000
      *=============================================================*   00007000
      *     AUTOR   : DOUGLAS PEREIRA DA COSTA                      *   00008000
      *     EMPRESA : FOURSYS                                       *   00009000
      *-------------------------------------------------------------*   00010000
      *     DATA    : 20/04/2022                                    *   00020000
      *     OBJETIVO: COMANDO DE SOMA ENTRE VALOR1 ,VALOR2 E VALOR3 *   00030000
      *               RESULTADO VALENDO 1                           *   00031000
      *=============================================================*   00032000
                                                                        00033000
      *=============================================================*   00034000
      *ENVIRONMENT                               DIVISION.              00035000
      *=============================================================*   00036000
       DATA                                       DIVISION.             00037000
      *=============================================================*   00038000
                                                                        00039000
      *-------------------------------------------------------------*   00040000
       WORKING-STORAGE                             SECTION.             00050000
      *-------------------------------------------------------------*   00060000
       01 WRK-SOMA.                                                     00070000
          05 WRK-VALOR1       PIC 99         VALUE ZEROS.               00071000
          05 WRK-VALOR2       PIC 99         VALUE ZEROS.               00072000
          05 WRK-VALOR3       PIC 99         VALUE ZEROS.               00072100
          05 WRK-RESULTADO    PIC 999        VALUE ZEROS.               00073000
      *=============================================================*   00074000
       PROCEDURE                                 DIVISION.              00075000
      *=============================================================*   00076000
                                                                        00077000
      *-------------------------------------------------------------*   00078000
       0000-PRINCIPAL                              SECTION.             00079000
      *-------------------------------------------------------------*   00079100
           ACCEPT WRK-SOMA FROM SYSIN                                   00079200
                                                                        00079300
           ADD WRK-VALOR1 WRK-VALOR2 WRK-VALOR3 TO WRK-RESULTADO        00079400
           ADD 10 TO WRK-RESULTADO                                      00079500
                                                                        00079600
           DISPLAY '=================================='                 00079700
           DISPLAY 'A SOMA DO          ' WRK-VALOR1                     00079800
           DISPLAY 'COM O VALOR        ' WRK-VALOR2                     00079900
           DISPLAY 'COM O VALOR        ' WRK-VALOR3                     00080000
           DISPLAY 'TEM COMO RESULTADO ' WRK-RESULTADO                  00080100
           DISPLAY '=================================='                 00080200
           STOP RUN.                                                    00081000
      *-------------------------------------------------------------*   00082000
       0000-99-FIM.                                   EXIT.             00083000
      *-------------------------------------------------------------*   00084000
                                                                        00085000
      *-------------------------------------------------------------*   00086000
       9000-TRATA-ERROS                               SECTION.          00087000
      *-------------------------------------------------------------*   00088000
                                                                        00089000
      *-------------------------------------------------------------*   00090000
       9000-FIM.                                      EXIT.             00090100
      *-------------------------------------------------------------*   00090200
