      *================================================================*00001000
       IDENTIFICATION                             DIVISION.             00002000
      *================================================================*00002100
                                                                        00002200
       PROGRAM-ID.  FR05CB21.                                           00002300
                                                                        00002400
      *================================================================*00002500
      *                         F O U R S Y S                          *00002600
      *================================================================*00002700
      *    AUTOR    : DOUGLAS PEREIRA DA COSTA                          00002800
      *    EMPRESA  : FOURSYS                                           00002900
      *----------------------------------------------------------------*00003000
      *    DATA     : 22/04/2022                                        00004000
      *    OBJETIVO : APLICANDO O COMANDO MULTIPLY                      00005000
      *================================================================*00006000
                                                                        00007000
      *================================================================*00008000
      *ENVIRONMENT                                DIVISION.             00009000
      *================================================================*00010000
       DATA                                       DIVISION.             00020000
      *================================================================*00030000
                                                                        00040000
      *----------------------------------------------------------------*00041000
       WORKING-STORAGE                             SECTION.             00042000
      *----------------------------------------------------------------*00043000
                                                                        00044000
          77 WRK-SALARIO      PIC 9(06)V99       VALUE 001500.          00045000
          77 WRK-INDICE       PIC 9(03)V99       VALUE 015.             00046000
          77 WRK-RESTO        PIC 9(06)V99       VALUE ZEROS.           00047001
                                                                        00048000
      *================================================================*00049000
       PROCEDURE DIVISION.                                              00050000
      *================================================================*00060000
      *----------------------------------------------------------------*00070000
       0000-PRINCIPAL                              SECTION.             00080000
      *----------------------------------------------------------------*00090000
           MULTIPLY WRK-SALARIO BY WRK-INDICE GIVING WRK-RESTO.         00090100
           DISPLAY '===================================='.              00090200
           DISPLAY 'SALARIO...............: ' WRK-SALARIO.              00090300
           DISPLAY 'INDICE................: ' WRK-INDICE.               00090400
           DISPLAY 'SALARIO ATUAL.........: ' WRK-RESTO.                00090500
           DISPLAY '===================================='.              00090600
                                                                        00090700
           STOP RUN.                                                    00090800
      *----------------------------------------------------------------*00090900
       0000-99-FIM.                                   EXIT.             00091000
      *----------------------------------------------------------------*00091100
                                                                        00091200
      *----------------------------------------------------------------*00091300
       9000-TRATA-ERROS                            SECTION.             00091400
      *----------------------------------------------------------------*00091500
      *----------------------------------------------------------------*00091600
       9000-FIM.                                      EXIT.             00091700
      *----------------------------------------------------------------*00091800
