      *================================================================*00001000
       IDENTIFICATION                            DIVISION.              00002000
      *================================================================*00002100
                                                                        00002200
       PROGRAM-ID.  FR05CB32.                                           00002300
                                                                        00002400
      *================================================================*00002500
      *                         F O U R S Y S                          *00002600
      *================================================================*00002700
      *    AUTOR    : DOUGLAS PEREIRA DA COSTA                          00002800
      *    EMPRESA  : FOURSYS                                           00002900
      *----------------------------------------------------------------*00003000
      *    DATA     : 03/05/2022                                        00004000
      *    OBJETIVO : RECEBE SYSIN E GRAVA EM ARQUIVO                   00005000
      *================================================================*00005100
                                                                        00005200
      *================================================================*00005300
       ENVIRONMENT DIVISION.                                            00005400
      *================================================================*00005500
                                                                        00005600
      *----------------------------------------------------------------*00005700
       CONFIGURATION                              SECTION.              00005800
      *----------------------------------------------------------------*00005900
                                                                        00006000
       SPECIAL-NAMES.                                                   00006100
           DECIMAL-POINT IS COMMA.                                      00006200
                                                                        00006300
      *----------------------------------------------------------------*00006400
      *----------------------------------------------------------------*00006500
       INPUT-OUTPUT                               SECTION.              00006600
      *----------------------------------------------------------------*00006700
                                                                        00006800
       FILE-CONTROL.                                                    00006900
             SELECT FUNC ASSIGN     TO FUNC                             00007000
                    FILE STATUS     IS WRK-FS-FUNC.                     00007100
                                                                        00007200
      *================================================================*00007300
       DATA                                      DIVISION.              00007400
      *================================================================*00007500
                                                                        00007600
      *----------------------------------------------------------------*00007700
       FILE                                      SECTION.               00007800
      *----------------------------------------------------------------*00007900
                                                                        00008000
       FD FUNC                                                          00008100
           RECORDING MODE IS F                                          00008200
           BLOCK CONTAINS 0 RECORDS.                                    00008300
                                                                        00008400
       01 FD-REGISTRO.                                                  00008500
          05 FD-ID                 PIC 9(05).                           00008600
          05 FD-NOME               PIC X(15).                           00008700
          05 FD-FUNCAO             PIC X(04).                           00008800
             88 FD-VALIDADOR VALUE '0234'.                              00008900
          05 FD-RESTO              PIC X(16).                           00009000
                                                                        00009100
      *----------------------------------------------------------------*00009200
       WORKING-STORAGE                            SECTION.              00009300
      *----------------------------------------------------------------*00009400
                                                                        00009500
        01 WRK-FS-FUNC                  PIC X(02) VALUE SPACES.         00009600
        01 WRK-REGISTRO.                                                00009700
           05 WRK-ID                    PIC 9(05) VALUE ZEROS.          00009800
           05 WRK-NOME                  PIC X(15) VALUE SPACES.         00009900
           05 WRK-FUNCAO                PIC X(04) VALUE ZEROS.          00010000
              88 WRK-VALIDADOR          VALUE '0234'.                   00010100
           05 WRK-RESTO                 PIC X(16) VALUE SPACES.         00010200
        77 WRK-MSG                      PIC X(50) VALUE SPACES.         00010300
        77 WRK-ACUM                     PIC 9(02) VALUE ZEROS.          00010400
                                                                        00010500
      *================================================================*00010600
       PROCEDURE DIVISION.                                              00010700
      *================================================================*00010800
                                                                        00010900
      ******************************************************************00011000
      *                    ROTINA PRINCIPAL                           * 00011100
      ******************************************************************00011200
                                                                        00011300
      *----------------------------------------------------------------*00011400
       0000-PRINCIPAL                            SECTION.               00011500
      *----------------------------------------------------------------*00011600
                                                                        00011700
           PERFORM 1000-INICIAR.                                        00011800
           IF WRK-FS-FUNC EQUAL ZEROS                                   00011900
              PERFORM 2000-PROCESSAR UNTIL WRK-FS-FUNC EQUAL '10'       00012000
           END-IF.                                                      00013000
           PERFORM 3000-FINALIZAR.                                      00014000
           STOP RUN.                                                    00015000
                                                                        00016000
      *----------------------------------------------------------------*00017000
       0000-99-FIM.                           EXIT.                     00018000
      *----------------------------------------------------------------*00019000
                                                                        00020000
      *----------------------------------------------------------------*00021000
       1000-INICIAR                           SECTION.                  00022000
      *----------------------------------------------------------------*00023000
                                                                        00023100
            OPEN INPUT FUNC.                                            00023200
                IF WRK-FS-FUNC NOT EQUAL ZEROS                          00023300
                   MOVE 'STATUS DO OPEN-' TO  WRK-MSG                   00023400
                   PERFORM 9000-TRATAR-ERRO                             00023500
                END-IF.                                                 00023600
                                                                        00023700
      *----------------------------------------------------------------*00023800
       1000-99-FIM.                            EXIT.                    00023900
      *----------------------------------------------------------------*00024000
                                                                        00025000
      ******************************************************************00026000
      *                        PROCESSAMENTO                           *00027000
      ******************************************************************00028000
                                                                        00029000
      *----------------------------------------------------------------*00030000
       2000-PROCESSAR                       SECTION.                    00040000
      *----------------------------------------------------------------*00041000
             READ FUNC INTO WRK-REGISTRO.                               00042000
                IF WRK-FS-FUNC NOT EQUAL ZEROS                          00043000
                   MOVE 'FINAL DE ARQUIVO...' TO WRK-MSG                00044000
                ELSE                                                    00044100
                   IF WRK-VALIDADOR                                     00044200
                      ADD 1 TO WRK-ACUM                                 00044300
                      PERFORM 2100-RELATORIO                            00044400
                   END-IF                                               00044500
                END-IF.                                                 00044600
      *----------------------------------------------------------------*00044700
       2000-99-FIM.                            EXIT.                    00044800
      *----------------------------------------------------------------*00044900
      *----------------------------------------------------------------*00045000
       2100-RELATORIO                          SECTION.                 00045100
      *----------------------------------------------------------------*00045200
           DISPLAY '---------------------------------'.                 00045300
           DISPLAY 'REGISTRO..........:' WRK-REGISTRO.                  00045400
           DISPLAY 'NUMERO DE ANALISTA:' WRK-ACUM.                      00045500
      *----------------------------------------------------------------*00045600
       2100-99-FIM.                            EXIT.                    00045700
      *----------------------------------------------------------------*00045800
      ******************************************************************00045900
      *                        FINALIZAR                               *00046000
      ******************************************************************00046100
                                                                        00046200
      *----------------------------------------------------------------*00046300
       3000-FINALIZAR                        SECTION.                   00046400
      *----------------------------------------------------------------*00046500
                                                                        00046600
            CLOSE FUNC.                                                 00046700
                IF WRK-FS-FUNC NOT EQUAL ZEROS                          00046800
                   MOVE 'STATUS NO CLOSE-' TO WRK-MSG                   00046900
                   PERFORM 9000-TRATAR-ERRO                             00047000
                END-IF.                                                 00048000
                                                                        00049000
      *----------------------------------------------------------------*00050000
       3000-99-FIM.                           EXIT.                     00051000
      *----------------------------------------------------------------*00052000
      *----------------------------------------------------------------*00052100
       9000-TRATAR-ERRO                      SECTION.                   00052200
      *----------------------------------------------------------------*00052300
                                                                        00052400
           DISPLAY '---------------------------------'.                 00052500
           DISPLAY 'MENSAGEM.......:' WRK-MSG.                          00052600
           DISPLAY 'FILE-STATUS....:' WRK-FS-FUNC.                      00052700
           DISPLAY '---------------------------------'.                 00052800
                                                                        00052900
      *----------------------------------------------------------------*00053000
       9000-FIM.                              EXIT.                     00053100
      *----------------------------------------------------------------*00053200
