      *================================================================*00001000
       IDENTIFICATION                            DIVISION.              00002000
      *================================================================*00002100
                                                                        00002200
       PROGRAM-ID.  FR05CB37.                                           00002300
                                                                        00002400
      *================================================================*00002500
      *                         F O U R S Y S                          *00002600
      *================================================================*00002700
      *    AUTOR    : DOUGLAS PEREIRA DA COSTA                         *00002800
      *    EMPRESA  : FOURSYS                                          *00002900
      *    INSTRUTOR: IVAN PETRUCCI                                    *00003000
      *    DATA     : 13/05/2022                                       *00004000
      *----------------------------------------------------------------*00004100
      *    OBJETIVO : LER TODOS OS REGISTRO DO ARQUIVO  DE ENTRADA     *00004200
      *               (EPAGFORM).                                      *00004300
      *               GRAVAR NO ARQUIVO DE SAIDA (SPAGFORM) SOMENTE OS *00004400
      *               REGRISTOS ONDE FORNECEDOR FOR PESSOA FISICA.     *00004500
      *               AO FINAL EMITIR ESTATISTICA DE REGISTRO LIDOS,   *00004600
      *               GRAVADOS E TOTAL DAS NOTAS EMITIDAS E GRAVADAS.  *00004700
      *----------------------------------------------------------------*00004800
      *    BOOKS    :                                                  *00004900
      *               B#EPAG - BOOK DE ENTRADA                         *00005002
      *               B#SPAG - BOOK DE SAIDA.                          *00005102
      *================================================================*00005200
                                                                        00005300
      *================================================================*00005400
       ENVIRONMENT                                DIVISION.             00005500
      *================================================================*00005600
                                                                        00005700
      *----------------------------------------------------------------*00005800
       CONFIGURATION                              SECTION.              00005900
      *----------------------------------------------------------------*00006000
                                                                        00006100
       SPECIAL-NAMES.                                                   00006200
           DECIMAL-POINT IS COMMA.                                      00006300
                                                                        00006400
      *----------------------------------------------------------------*00006500
      *----------------------------------------------------------------*00006600
       INPUT-OUTPUT                               SECTION.              00006700
      *----------------------------------------------------------------*00006800
                                                                        00006900
       FILE-CONTROL.                                                    00007000
             SELECT EPAGFORN ASSIGN     TO JCLEPAG                      00007102
                    FILE STATUS     IS WRK-FS-.                         00007201
                                                                        00007300
             SELECT SPAGFORM ASSIGN     TO JCLSPAG                      00007402
                    FILE STATUS     IS WRK-FS-RELATORIO.                00007500
      *================================================================*00007600
       DATA                                      DIVISION.              00007700
      *================================================================*00007800
                                                                        00007900
      *----------------------------------------------------------------*00008000
       FILE                                      SECTION.               00008100
      *----------------------------------------------------------------*00008200
      *----------------------------------------------------------------*00008300
      *    INPUT - DADOS DO ARQUIVO DE ENTRADA (EPAGFORM)              *00008401
      *                           - LRECL = 068                        *00008501
      *----------------------------------------------------------------*00008600
                                                                        00008700
       FD EPAGFORM                                                      00008801
           RECORDING MODE IS F                                          00008900
           BLOCK CONTAINS 0 RECORDS.                                    00009000
       01 FD-EPAGFORM       PIC X(068).                                 00009101
                                                                        00009200
      *----------------------------------------------------------------*00009300
      *    OUTPUT - DADOS DO ARQUIVO DE SAIDA  (SPAGFORM)              *00009401
      *                           - LRECL = 046                        *00009501
      *----------------------------------------------------------------*00009600
                                                                        00009700
       FD SPAGFORM                                                      00009801
           RECORDING MODE IS F                                          00009900
           BLOCK CONTAINS 0 RECORDS.                                    00010000
       01 FD-SPAGFORM       PIC X(068).                                 00011001
                                                                        00011100
      *----------------------------------------------------------------*00011200
       WORKING-STORAGE                            SECTION.              00011300
      *----------------------------------------------------------------*00011400
                                                                        00011500
      *----------------------------------------------------------------*00011600
       01 FILLER                  PIC X(050) VALUE                      00011700
                     '*** AREA DE CABECALHO ***'.                       00011800
      *----------------------------------------------------------------*00011900
       01 WKR-CAB01.                                                    00012000
          05 FILLER               PIC X(040) VALUE                      00012100
          '---------RELATORIO DO FORNECEDOR--------'.                   00012202
          05 FILLER               PIC X(023) VALUE SPACES.              00012300
          05 FILLER               PIC X(005) VALUE 'PAG. '              00012400
          05 WRK-NUM-PAG          PIC 9(002) VALUE ZEROS.               00012500
                                                                        00012600
       01 WRK-CAB-CAMPOS.                                               00012700
          05 FILLER               PIC X(005) VALUE SPACES.              00012800
          05 FILLER               PIC X(007) VALUE 'CPFCNPJ'.           00012902
          05 FILLER               PIC X(002) VALUE SPACES.              00013000
          05 FILLER               PIC X(005) VALUE 'NOTAFISCAL'.        00013102
          05 FILLER               PIC X(002) VALUE SPACES.              00013200
          05 FILLER               PIC X(015) VALUE 'VALOR'.             00013302
          05 FILLER               PIC X(005) VALUE SPACES.              00013400
          05 FILLER               PIC X(005) VALUE 'DATAEMISSAO'.       00013502
          05 FILLER               PIC X(024) VALUE SPACES.              00013600
      *----------------------------------------------------------------*00013700
       01 FILLER                  PIC X(050)     VALUE                  00013800
             '*** AREA DE VARIAVEL DE FILE STATUS ***'.                 00013900
      *----------------------------------------------------------------*00014000
                                                                        00014100
       01 WRK-FS-EPAG             PIC X(002) VALUE SPACES.              00014202
       01 WRK-FS-SPAG             PIC X(002) VALUE SPACES.              00014302
                                                                        00014400
      *----------------------------------------------------------------*00014500
       01 FILLER                  PIC X(050)     VALUE                  00014600
                     '*** AREA DE ACUMULADORES ***'.                    00014700
      *----------------------------------------------------------------*00014800
                                                                        00014900
       01 WRK-GRAVADOS                   PIC 9(003) VALUE ZEROS.        00015000
       01 WRK-LIDOS                      PIC 9(003) VALUE ZEROS.        00015100
                                                                        00015200
      *----------------------------------------------------------------*00015300
       01 FILLER                  PIC X(050)     VALUE                  00015400
                     '*** AREA DE AUXILIARES ***'.                      00015500
      *----------------------------------------------------------------*00015600
                                                                        00015700
       01 WRK-MSG                        PIC X(030) VALUE SPACES.       00015800
       01 WRK-PAGINA                     PIC 9(002) VALUE ZEROS.        00015900
       01 WRK-LINHA                      PIC 9(002) VALUE ZEROS.        00016000
                                                                        00016100
      ******************************************************************00016200
      *           B O O K  A R Q U I V O  D E  E N T R A D A           *00016300
      ******************************************************************00016400
                                                                        00016500
       COPY 'B#EPAG'.                                                   00016602
                                                                        00016700
      ******************************************************************00016800
      *             B O O K  A R Q U I V O  D E  S A I D A             *00016900
      ******************************************************************00017000
                                                                        00017100
       COPY 'B#SPAG'.                                                   00017202
                                                                        00017300
      *================================================================*00017400
       PROCEDURE                                 DIVISION.              00017500
      *================================================================*00017600
                                                                        00017700
      ******************************************************************00017800
      *              P R O G R A M A  P R I N C I P A L                *00017900
      ******************************************************************00018000
                                                                        00018100
      *----------------------------------------------------------------*00018200
       0000-PRINCIPAL                            SECTION.               00018300
      *----------------------------------------------------------------*00018400
                                                                        00018500
            PERFORM 1000-INICIAR                                        00018600
                                                                        00018700
            PERFORM 2000-VERIFICAR-VAZIO                                00018800
                                                                        00018900
            PERFORM 3000-PROCESSAR                                      00019000
                    UNTIL WRK-FS-EPAG EQUAL '10'                        00019102
                                                                        00019200
            PERFORM 4000-FINALIZAR.                                     00019300
                                                                        00019400
            STOP RUN.                                                   00019500
                                                                        00019600
      *----------------------------------------------------------------*00019700
       0000-99-FIM.                           EXIT.                     00019800
      *----------------------------------------------------------------*00019900
                                                                        00020000
      *----------------------------------------------------------------*00020100
      ******************************************************************00020200
      *                       I N I C I A R                            *00020300
      ******************************************************************00020400
                                                                        00020500
      *----------------------------------------------------------------*00020600
       1000-INICIAR                           SECTION.                  00020700
      *----------------------------------------------------------------*00020800
                                                                        00020900
           OPEN INPUT CLIENT                                            00021000
                OUTPUT RELAT                                            00021100
           PERFORM 1100-TESTAR-STATUS.                                  00021200
                                                                        00021300
      *----------------------------------------------------------------*00021400
       1000-99-FIM.                            EXIT.                    00021500
      *----------------------------------------------------------------*00021600
                                                                        00021700
                                                                        00021800
      ******************************************************************00021900
      *                   T E S T A R  S T A T U S                     *00022000
      ******************************************************************00022100
                                                                        00022200
      *----------------------------------------------------------------*00022300
       1100-TESTAR-STATUS                    SECTION.                   00022400
      *----------------------------------------------------------------*00022500
                                                                        00022600
            PERFORM 1110-TESTAR-WRK-FS-CLIENTES                         00022700
                                                                        00022800
            PERFORM 1120-TESTAR-WRK-FS-RELATORIO.                       00022900
                                                                        00023000
      *----------------------------------------------------------------*00024000
       1100-99-FIM.                            EXIT.                    00025000
      *----------------------------------------------------------------*00026000
                                                                        00027000
      ******************************************************************00028000
      *           TESTAR ARQUIVO DE ENTRADA - WRK-FS-CLIENTES          *00029000
      ******************************************************************00030000
                                                                        00040000
      *----------------------------------------------------------------*00041000
       1110-TESTAR-WRK-FS-CLIENTES        SECTION.                      00042000
      *----------------------------------------------------------------*00043000
                                                                        00044000
           IF WRK-FS-CLIENTES NOT EQUAL ZEROS                           00045000
              MOVE 'ERRO NO ARQUIVO CLIENTES' TO WRK-MSG                00045100
              PERFORM 9000-TRATAR-ERRO                                  00045200
           END-IF.                                                      00045300
                                                                        00045400
      *----------------------------------------------------------------*00045500
       1110-99-FIM.                            EXIT.                    00045600
      *----------------------------------------------------------------*00045700
                                                                        00045800
      ******************************************************************00045900
      *           TESTAR ARQUIVO DE SAIDA - WRK-FS-RELATORIO           *00046000
      ******************************************************************00047000
                                                                        00047100
      *----------------------------------------------------------------*00047200
       1120-TESTAR-WRK-FS-RELATORIO            SECTION.                 00047300
      *----------------------------------------------------------------*00047400
                                                                        00047500
           IF WRK-FS-RELATORIO NOT EQUAL ZEROS                          00047600
              MOVE 'ERRO NA ABERTURA DO RELAT' TO WRK-MSG               00047700
              PERFORM 9000-TRATAR-ERRO                                  00047800
           END-IF.                                                      00047900
                                                                        00048000
      *----------------------------------------------------------------*00048100
       1120-99-FIM.                            EXIT.                    00048200
      *----------------------------------------------------------------*00048300
      ******************************************************************00048400
      *                  V E R I F I C A R  V A Z I O                  *00048500
      ******************************************************************00048600
                                                                        00048700
      *----------------------------------------------------------------*00048800
       2000-VERIFICAR-VAZIO                 SECTION.                    00048900
      *----------------------------------------------------------------*00049000
            PERFORM 2100-LEITURA                                        00050000
                                                                        00050100
               IF WRK-FS-CLIENTES  EQUAL '10'                           00050200
                  DISPLAY '********************************'            00050300
                  DISPLAY '                                '            00050400
                  DISPLAY '  ARQUIVO CLIENTES ESTA VAZIO   '            00050500
                  DISPLAY '    PROCESSAMENTO ENCERRADO     '            00050600
                  DISPLAY '                                '            00050700
                  DISPLAY '********************************'            00050800
               END-IF.                                                  00050900
                                                                        00051000
      *----------------------------------------------------------------*00051100
       2000-99-FIM.                         EXIT.                       00051200
      *----------------------------------------------------------------*00051300
                                                                        00051400
      *----------------------------------------------------------------*00051500
       2100-LEITURA                         SECTION.                    00051600
      *----------------------------------------------------------------*00051700
            READ CLIENT              INTO WRK-CLIENTES                  00051800
                                                                        00051900
               IF WRK-FS-CLIENTES  EQUAL '10'                           00052000
                  GO               TO 2100-99-FIM                       00053000
               END-IF.                                                  00053100
                                                                        00053200
               PERFORM 1110-TESTAR-WRK-FS-CLIENTES                      00053300
               ADD 1               TO WRK-LIDOS.                        00053400
      *----------------------------------------------------------------*00053500
       2100-99-FIM.                         EXIT.                       00053600
      *----------------------------------------------------------------*00053700
      ******************************************************************00053800
      *                     P R O C E S S A R                          *00053900
      ******************************************************************00054000
                                                                        00054100
      *----------------------------------------------------------------*00054200
       3000-PROCESSAR                        SECTION.                   00054300
      *----------------------------------------------------------------*00054400
                                                                        00054500
               IF WRK-LINHAS          GREATER 5                         00054600
                  PERFORM 3100-GRAVAR-CABECALHO                         00054700
                  PERFORM 3200-GRAVAR-CAMPOS                            00054800
               END-IF.                                                  00054900
                                                                        00055000
               MOVE FD-AGENCIA        TO WRK-AGENCIA-S                  00055100
               MOVE FD-CONTA-CLIENTES TO WRK-CONTA-S                    00055200
               MOVE FD-NOME-CLIENTES  TO WRK-NOME-S                     00055300
               MOVE FD-SALDO-CLIENTES TO WRK-SALDO-S                    00055400
               PERFORM 3300-GRAVAS-DETALHES                             00055500
                                                                        00055600
      *----------------------------------------------------------------*00055700
       3000-99-FIM.                           EXIT.                     00055800
      *----------------------------------------------------------------*00055900
      *----------------------------------------------------------------*00056000
       3100-GRAVAR-CABECALHO                 SECTION.                   00056100
      *----------------------------------------------------------------*00056200
               ADD 1               TO WRK-PAGINA                        00056300
               MOVE WRK-PAGINA     FROM WRK-NUM-PAG                     00056400
               WRITE FD-RELAT      FROM WRK-CAB01 AFTER PAGE            00056500
               PERFORM 1120-TESTAR-WRK-FS-RELATORIO                     00056600
               MOVE 1              FROM WRK-LINHAS.                     00056700
      *----------------------------------------------------------------*00056800
       3100-99-FIM.                           EXIT.                     00056900
      *----------------------------------------------------------------*00057000
                                                                        00057100
      *----------------------------------------------------------------*00057200
       3200-GRAVAR-CAMPOS                     SECTION.                  00057300
      *----------------------------------------------------------------*00057400
               WRITE FD-RELAT      FROM WRK-CAB-CAMPOS                  00057500
               PERFORM 1120-TESTAR-WRK-FS-RELATORIO                     00057600
               MOVE 1              FROM WRK-LINHAS.                     00057700
      *----------------------------------------------------------------*00057800
       3200-99-FIM.                           EXIT.                     00057900
      *----------------------------------------------------------------*00058000
      *----------------------------------------------------------------*00058100
       3300-GRAVAR-DETALHES                  SECTION.                   00058200
      *----------------------------------------------------------------*00058300
                                                                        00058400
               WRITE FD-RELAT         FROM WRK-RELAT                    00058500
               PERFORM 1120-TESTAR-WRK-FS-RELATORIO                     00058600
               ADD 1                  TO WRK-LINHAS                     00058700
                                         WRK-GRAVADOS                   00058800
                                                                        00058900
      *----------------------------------------------------------------*00059000
       3300-99-FIM.                           EXIT.                     00059100
      *----------------------------------------------------------------*00059200
      ******************************************************************00059300
      *                     F I N A L I Z A R                          *00059400
      ******************************************************************00059500
      *----------------------------------------------------------------*00059600
       4000-FINALIZAR                        SECTION.                   00059700
      *----------------------------------------------------------------*00059800
            IF WRK-LIDOS      GREATER ZEROS                             00059900
               PERFORM 4100-TOTAIS-LIDOS                                00060000
            END-IF                                                      00060100
                                                                        00060200
            CLOSE CLIENT                                                00060300
                  RELAT                                                 00060400
            IF WRK-FS-CLIENTES        NOT EQUAL ZEROS                   00060500
               MOVE 'ERRO NO FECHAMENTO CLIENTES' TO WRK-MSG            00060600
               PERFORM 9000-TRATAR-ERRO                                 00060700
               GO                                 TO 4000-99-FIM        00060800
            END-IF                                                      00060900
                                                                        00061000
            IF WRK-FS-RELATORIO       NOT EQUAL ZEROS                   00061100
               MOVE 'ERRO NO FECHAMENTO RELAT' TO WRK-MSG               00061200
               PERFORM 9000-TRATAR-ERRO                                 00061300
            END-IF.                                                     00061400
      *----------------------------------------------------------------*00061500
       4000-99-FIM.                           EXIT.                     00061600
      *----------------------------------------------------------------*00061700
                                                                        00061800
      ******************************************************************00061900
      *                    T O T A I S  L I D O S                      *00062000
      ******************************************************************00062100
      *----------------------------------------------------------------*00062200
       4100-TOTAIS-LIDOS                     SECTION.                   00062300
      *----------------------------------------------------------------*00062400
                                                                        00062500
                  DISPLAY '********************************'            00062600
                  DISPLAY '                                '            00062700
                  DISPLAY '  LIDOS   :  ' WRK-LIDOS                     00062800
                  DISPLAY '  GRAVADOS:  ' WRK-GRAVADOS                  00062900
                  DISPLAY '                                '            00063000
                  DISPLAY '********************************'.           00063100
                                                                        00063200
      *----------------------------------------------------------------*00063300
       4100-99-FIM.                           EXIT.                     00063400
      *----------------------------------------------------------------*00063500
      ******************************************************************00063600
      *                   T R A T A R  E R R O                         *00063700
      ******************************************************************00063800
                                                                        00063900
       9000-TRATAR-ERRO                     SECTION.                    00064000
      *----------------------------------------------------------------*00064100
                                                                        00064200
                  DISPLAY '********************************'            00064300
                  DISPLAY '                                '            00064400
                  DISPLAY '  ERRO: ' WRK-MSG                            00064500
                  DISPLAY '                                '            00064600
                  DISPLAY '********************************'            00064700
                  GOBACK.                                               00064800
      *----------------------------------------------------------------*00064900
       9000-99-FIM.                           EXIT.                     00065000
      *----------------------------------------------------------------*00066000
