      *=============================================================*   00001000
       IDENTIFICATION                            DIVISION.              00002000
      *=============================================================*   00003000
                                                                        00004000
       PROGRAM-ID. FR05CB10.                                            00005001
                                                                        00006000
      *=============================================================*   00007000
      *     AUTOR   : DOUGLAS PEREIRA DA COSTA                      *   00008000
      *     EMPRESA : FOURSYS                                       *   00009000
      *-------------------------------------------------------------*   00010000
      *     DATA    : 20/04/2022                                        00020000
      *     OBJETIVO: COMANDO DE SOMA ENTRE VALOR1 E VALOR2             00030000
      *=============================================================*   00040000
                                                                        00050000
      *=============================================================*   00060000
      *ENVIRONMENT                               DIVISION.              00070000
      *=============================================================*   00071000
       DATA                                       DIVISION.             00072000
      *=============================================================*   00073000
                                                                        00074000
      *-------------------------------------------------------------*   00075000
       WORKING-STORAGE                             SECTION.             00076000
      *-------------------------------------------------------------*   00077000
       01 WRK-SOMA.                                                     00078000
          05 WRK-VALOR1       PIC 99         VALUE ZEROS.               00079000
          05 WRK-VALOR2       PIC 99         VALUE ZEROS.               00079100
          05 WRK-RESULTADO    PIC 999        VALUE ZEROS.               00079200
      *=============================================================*   00079300
       PROCEDURE                                 DIVISION.              00079400
      *=============================================================*   00079500
                                                                        00079600
      *-------------------------------------------------------------*   00079700
       0000-PRINCIPAL                              SECTION.             00079800
      *-------------------------------------------------------------*   00079900
           ACCEPT WRK-SOMA FROM SYSIN                                   00080002
                                                                        00081000
           ADD WRK-VALOR1 WRK-VALOR2 TO WRK-RESULTADO                   00082002
           DISPLAY '========================'                           00090002
           DISPLAY 'A SOMA DO          ' WRK-VALOR1                     00090102
           DISPLAY 'COM O VALOR        ' WRK-VALOR2                     00090202
           DISPLAY 'TEM COMO RESULTADO ' WRK-RESULTADO                  00090302
           DISPLAY '========================'                           00090402
           STOP RUN.                                                    00090500
      *-------------------------------------------------------------*   00090600
       0000-99-FIM.                                   EXIT.             00090700
      *-------------------------------------------------------------*   00090800
                                                                        00090900
      *-------------------------------------------------------------*   00091000
       9000-TRATA-ERROS                               SECTION.          00092003
      *-------------------------------------------------------------*   00093000
                                                                        00094000
      *-------------------------------------------------------------*   00095000
       9000-FIM.                                      EXIT.             00096000
      *-------------------------------------------------------------*   00097000
