      *================================================================*00001000
       IDENTIFICATION                            DIVISION.              00002000
      *================================================================*00002100
                                                                        00002200
       PROGRAM-ID.  FR05CB31.                                           00002301
                                                                        00002400
      *================================================================*00002500
      *                         F O U R S Y S                          *00002600
      *================================================================*00002700
      *    AUTOR    : DOUGLAS PEREIRA DA COSTA                         *00002800
      *    EMPRESA  : FOURSYS                                          *00002900
      *----------------------------------------------------------------*00003000
      *    DATA     : 02/05/2022                                       *00004000
      *    OBJETIVO : RECEBER ARQUIBO E IMPRIMIRNA SYSOUT UM LAYOUT    *00005000
      *               MENOR COM OS CAMPOS CODIGO, PRODUTO E FORNECEDOR *00005100
      *================================================================*00005200
                                                                        00005300
      *================================================================*00005400
       ENVIRONMENT                                DIVISION.             00005500
      *================================================================*00005600
                                                                        00005700
      *----------------------------------------------------------------*00005800
       CONFIGURATION                              SECTION.              00005900
      *----------------------------------------------------------------*00006000
                                                                        00006100
       SPECIAL-NAMES.                                                   00006200
           DECIMAL-POINT IS COMMA.                                      00006300
                                                                        00006400
      *----------------------------------------------------------------*00006500
      *----------------------------------------------------------------*00006600
       INPUT-OUTPUT                               SECTION.              00006700
      *----------------------------------------------------------------*00006800
                                                                        00006900
       FILE-CONTROL.                                                    00007000
             SELECT PRODUTO ASSIGN     TO JCLPROD                       00007101
                    FILE STATUS     IS WRK-FS-PRODUTO.                  00007201
                                                                        00007300
      *================================================================*00007400
       DATA                                      DIVISION.              00007500
      *================================================================*00007600
                                                                        00007700
      *----------------------------------------------------------------*00007800
       FILE                                      SECTION.               00007900
      *----------------------------------------------------------------*00008000
                                                                        00008100
       FD PRODUTO                                                       00008201
           RECORDING MODE IS F                                          00008300
           BLOCK CONTAINS 0 RECORDS.                                    00008400
                                                                        00008500
       01 FD-PRODUTO               PIC X(70).                           00008603
      *   05 FD-CODIGO             PIC 9(05).                           00008703
      *   05 FD-PRODUTO            PIC X(20).                           00008803
      *   05 FD-FORNECEDOR         PIC X(15).                           00008903
      *   05 FD-VALOR              PIC 9(08)V99.                        00009003
      *   05 FD-ESTOQUE            PIC 9(05).                           00009103
      *   05 FILLER                PIC X(15).                           00009203
      *----------------------------------------------------------------*00009300
       WORKING-STORAGE                            SECTION.              00009400
      *----------------------------------------------------------------*00009500
                                                                        00009603
        01 WRK-PRODUTO-ED          PIC X(40)    VALUE SPACES.           00009703
        01 WRK-PRODUTO.                                                 00009804
           05 WRK-CODIGO           PIC 9(05)    VALUE ZEROS.            00009903
           05 WRK-PROD             PIC X(20)    VALUE SPACES.           00010005
           05 WRK-FORNECEDOR       PIC X(15)    VALUE SPACES.           00010103
           05 WRK-VALOR            PIC 9(08)V99 VALUE ZEROS.            00010203
           05 WRK-ESTOQUE          PIC 9(15)    VALUE ZEROS.            00010303
           05 FILLER               PIC X(15)    VALUE SPACES.           00010403
                                                                        00010503
        77 WRK-FS-PRODUTO          PIC X(02)    VALUE SPACES.           00010603
        77 WRK-MSG                 PIC X(30)    VALUE SPACES.           00010703
        77 WRK-ACUM                PIC 9(03)    VALUE ZEROS.            00010803
                                                                        00010900
      *================================================================*00011000
       PROCEDURE DIVISION.                                              00011100
      *================================================================*00011200
                                                                        00011300
      ******************************************************************00011400
      *                    PROGRAMA PRINCIPAL                          *00011501
      ******************************************************************00011600
                                                                        00011700
      *----------------------------------------------------------------*00011800
       0000-PRINCIPAL                            SECTION.               00011900
      *----------------------------------------------------------------*00012000
                                                                        00012100
           PERFORM 1000-INICIAR.                                        00012200
           IF WRK-FS-PRODUTO EQUAL ZEROS                                00012301
              PERFORM 2000-PROCESSAR UNTIL WRK-FS-PRODUTO EQUAL '10'    00012403
           END-IF.                                                      00013000
                                                                        00013103
           PERFORM 3000-FINALIZAR.                                      00014000
           PERFORM 4000-RELA-ACUM.                                      00014110
           STOP RUN.                                                    00015000
                                                                        00016000
      *----------------------------------------------------------------*00017000
       0000-99-FIM.                           EXIT.                     00018000
      *----------------------------------------------------------------*00019000
                                                                        00020000
      *----------------------------------------------------------------*00021000
       1000-INICIAR                           SECTION.                  00022000
      *----------------------------------------------------------------*00023000
                                                                        00023100
            OPEN INPUT PRODUTO.                                         00023206
                                                                        00023303
                IF WRK-FS-PRODUTO NOT EQUAL ZEROS                       00023401
                   MOVE 'STATUS OPEN' TO  WRK-MSG                       00023507
                   PERFORM 9000-TRATAR-ERRO                             00023600
                ELSE                                                    00023703
                   DISPLAY '=======REGISTRO DE ARQUIVO======='          00023803
                   READ PRODUTO INTO WRK-PRODUTO                        00023903
                END-IF.                                                 00024000
                                                                        00024100
      *----------------------------------------------------------------*00024200
       1000-99-FIM.                            EXIT.                    00024300
      *----------------------------------------------------------------*00024400
                                                                        00025000
      ******************************************************************00026000
      *                        PROCESSAMENTO                           *00027000
      ******************************************************************00028000
                                                                        00029000
      *----------------------------------------------------------------*00030000
       2000-PROCESSAR                       SECTION.                    00040000
      *----------------------------------------------------------------*00041000
                                                                        00041101
             IF WRK-FS-PRODUTO          NOT EQUAL ZEROS                 00042003
                MOVE ' FIM DO ARQUIVO ' TO WRK-MSG                      00042103
             ELSE                                                       00042203
                ADD 1                     TO WRK-ACUM                   00043004
                MOVE WRK-PRODUTO          TO WRK-PRODUTO-ED             00044004
      *         PERFORM 9000-TRATAR-ERRO                                00044108
                PERFORM 2100-RELATORIO                                  00044209
             END-IF.                                                    00044303
             READ PRODUTO               INTO WRK-PRODUTO.               00044403
                                                                        00044801
      *----------------------------------------------------------------*00044900
       2000-99-FIM.                            EXIT.                    00045000
      *----------------------------------------------------------------*00045100
      *----------------------------------------------------------------*00045200
       2100-RELATORIO                          SECTION.                 00045300
      *----------------------------------------------------------------*00045400
           DISPLAY '---------------------------------'.                 00045500
           DISPLAY 'CODIGO DO PRODUTO.:' WRK-CODIGO.                    00045601
           DISPLAY 'NOME DO PRODUTO...:' WRK-PROD.                      00045705
           DISPLAY 'NOME DO FORNECEDOR:' WRK-FORNECEDOR.                00045801
           DISPLAY '---------------------------------'.                 00046001
      *----------------------------------------------------------------*00046100
       2100-99-FIM.                            EXIT.                    00046200
      *----------------------------------------------------------------*00046300
      ******************************************************************00046400
      *                        FINALIZAR                               *00046500
      ******************************************************************00046600
                                                                        00046700
      *----------------------------------------------------------------*00046800
       3000-FINALIZAR                        SECTION.                   00046900
      *----------------------------------------------------------------*00047000
                                                                        00047100
            CLOSE PRODUTO                                               00047201
                IF WRK-FS-PRODUTO NOT EQUAL ZEROS                       00047301
                   MOVE 'STATUS NO CLOSE' TO WRK-MSG                    00047401
                   PERFORM 9000-TRATAR-ERRO                             00047500
                END-IF.                                                 00048000
                                                                        00049000
      *----------------------------------------------------------------*00050000
       3000-99-FIM.                           EXIT.                     00051000
      *----------------------------------------------------------------*00052000
      *----------------------------------------------------------------*00052100
      *----------------------------------------------------------------*00052210
       4000-RELA-ACUM                        SECTION.                   00052310
      *----------------------------------------------------------------*00052410
                                                                        00052510
           DISPLAY '---------------------------------'.                 00052610
           DISPLAY '                                 '.                 00052710
           DISPLAY 'TOTAL ACUMULADOS..:' WRK-ACUM.                      00052810
           DISPLAY '                                 '.                 00052910
           DISPLAY '---------------------------------'.                 00053510
                                                                        00053610
      *----------------------------------------------------------------*00053710
       4000-99-FIM.                           EXIT.                     00053810
      *----------------------------------------------------------------*00053910
       9000-TRATAR-ERRO                      SECTION.                   00054000
      *----------------------------------------------------------------*00054100
                                                                        00054200
           DISPLAY '---------------------------------'.                 00054300
           DISPLAY 'MENSAGEM.......:' WRK-MSG.                          00054400
           DISPLAY 'FILE-STATUS....:' WRK-FS-PRODUTO.                   00054501
           DISPLAY '---------------------------------'.                 00054600
                                                                        00054700
      *----------------------------------------------------------------*00054800
       9000-99-FIM.                           EXIT.                     00054904
      *----------------------------------------------------------------*00055000
