      *================================================================*00001000
       IDENTIFICATION                             DIVISION.             00002000
      *================================================================*00002100
                                                                        00002200
       PROGRAM-ID.  FR05CB22.                                           00002301
                                                                        00002400
      *================================================================*00002500
      *                         F O U R S Y S                          *00002600
      *================================================================*00002700
      *    AUTOR    : DOUGLAS PEREIRA DA COSTA                          00002800
      *    EMPRESA  : FOURSYS                                           00002900
      *----------------------------------------------------------------*00003000
      *    DATA     : 25/04/2022                                        00004000
      *    OBJETIVO : APLICANDO O COMANDO IF                            00005000
      *================================================================*00006000
                                                                        00007000
      *================================================================*00008000
      *ENVIRONMENT                                DIVISION.             00009000
      *================================================================*00010000
       DATA                                       DIVISION.             00020000
      *================================================================*00030000
                                                                        00040000
      *----------------------------------------------------------------*00041000
       WORKING-STORAGE                             SECTION.             00042000
      *----------------------------------------------------------------*00043000
                                                                        00044000
       01 WRK-COMBUSTIVEL.                                              00045004
          05 WRK-GASOLINA     PIC 9(02)V99       VALUE ZEROS.           00046001
          05 WRK-ALCOOL       PIC 9(02)V99       VALUE ZEROS.           00047001
          05 WRK-TAXA         PIC 9(02)V99       VALUE ZEROS.           00048002
      *================================================================*00049000
       PROCEDURE DIVISION.                                              00050000
      *================================================================*00060000
      *----------------------------------------------------------------*00070000
       0000-PRINCIPAL                              SECTION.             00080000
      *----------------------------------------------------------------*00090000
           ACCEPT WRK-COMBUSTIVEL FROM SYSIN                            00090105
           COMPUTE WRK-TAXA = WRK-ALCOOL / WRK-GASOLINA                 00090201
                                                                        00090301
           IF WRK-TAXA LESS 070                                         00090407
              DISPLAY 'ABASTECER COM ALCOOL'                            00090506
           ELSE                                                         00090605
              DISPLAY 'ABASTECER COM GASOLINA'                          00090706
           END-IF                                                       00090805
           STOP RUN.                                                    00090900
                                                                        00091001
      *----------------------------------------------------------------*00091100
       0000-99-FIM.                                   EXIT.             00091200
      *----------------------------------------------------------------*00091300
                                                                        00091400
      *----------------------------------------------------------------*00091500
       9000-TRATA-ERROS                            SECTION.             00091600
      *----------------------------------------------------------------*00091700
      *----------------------------------------------------------------*00091800
       9000-FIM.                                      EXIT.             00091900
      *----------------------------------------------------------------*00092000
