      *=============================================================*   00001000
       IDENTIFICATION                            DIVISION.              00002000
      *=============================================================*   00003000
                                                                        00004000
       PROGRAM-ID. FR05CB14.                                            00005000
                                                                        00006000
      *=============================================================*   00007000
      *     AUTOR   : DOUGLAS PEREIRA DA COSTA                      *   00008000
      *     EMPRESA : FOURSYS                                       *   00009000
      *-------------------------------------------------------------*   00010000
      *     DATA    : 20/04/2022                                    *   00020000
      *     OBJETIVO: COMANDO DE SUBTRACT COM VALOR NEGATIVO        *   00030000
      *=============================================================*   00031000
                                                                        00032000
      *=============================================================*   00033000
      *ENVIRONMENT                               DIVISION.              00034000
      *=============================================================*   00035000
       DATA                                       DIVISION.             00036000
      *=============================================================*   00037000
                                                                        00038000
      *-------------------------------------------------------------*   00039000
       WORKING-STORAGE                             SECTION.             00040000
      *-------------------------------------------------------------*   00050000
       01 WRK-SUBTRACAO.                                                00060000
          05 WRK-VALOR1       PIC 99         VALUE ZEROS.               00070000
          05 WRK-VALOR2       PIC 99         VALUE ZEROS.               00071000
          05 WRK-RESULTADO    PIC -ZZZ       VALUE ZEROS.               00072000
      *=============================================================*   00072100
       PROCEDURE                                 DIVISION.              00072200
      *=============================================================*   00072300
                                                                        00072400
      *-------------------------------------------------------------*   00072500
       0000-PRINCIPAL                              SECTION.             00072600
      *-------------------------------------------------------------*   00072700
           ACCEPT WRK-SUBTRACAO FROM SYSIN                              00072800
                                                                        00072900
           COMPUTE WRK-RESULTADO = WRK-VALOR1 - WRK-VALOR2              00073000
                                                                        00074000
           DISPLAY '=================================='                 00075000
           DISPLAY 'A SUBTRACAO DO VALOR' WRK-VALOR1                    00076000
           DISPLAY 'COM O VALOR         ' WRK-VALOR2                    00077000
           DISPLAY 'TEM COMO RESULTADO  ' WRK-RESULTADO                 00078000
           DISPLAY '=================================='                 00079000
           STOP RUN.                                                    00079100
      *-------------------------------------------------------------*   00079200
       0000-99-FIM.                                   EXIT.             00079300
      *-------------------------------------------------------------*   00079400
                                                                        00079500
      *-------------------------------------------------------------*   00079600
       9000-TRATA-ERROS                               SECTION.          00079700
      *-------------------------------------------------------------*   00079800
                                                                        00079900
      *-------------------------------------------------------------*   00080000
       9000-FIM.                                      EXIT.             00081000
      *-------------------------------------------------------------*   00082000
