      *================================================================*00001000
       IDENTIFICATION                            DIVISION.              00002000
      *================================================================*00002100
                                                                        00002200
       PROGRAM-ID.  FR05CB35.                                           00002302
                                                                        00002400
      *================================================================*00002500
      *                         F O U R S Y S                          *00002600
      *================================================================*00002700
      *    AUTOR    : DOUGLAS PEREIRA DA COSTA                         *00002800
      *    EMPRESA  : FOURSYS                                          *00002900
      *----------------------------------------------------------------*00003000
      *    DATA     : 05/05/2022                                       *00004000
      *    OBJETIVO : RECEBER ARQUIBO E IMPRIMIRNA SYSOUT UM LAYOUT    *00005000
      *               MENOR COM OS CAMPOS CODIGO, PRODUTO E FORNECEDOR *00005100
      *================================================================*00005200
                                                                        00005300
      *================================================================*00005400
       ENVIRONMENT                                DIVISION.             00005500
      *================================================================*00005600
                                                                        00005700
      *----------------------------------------------------------------*00005800
       CONFIGURATION                              SECTION.              00005900
      *----------------------------------------------------------------*00006000
                                                                        00006100
       SPECIAL-NAMES.                                                   00006200
           DECIMAL-POINT IS COMMA.                                      00006300
                                                                        00006400
      *----------------------------------------------------------------*00006500
      *----------------------------------------------------------------*00006600
       INPUT-OUTPUT                               SECTION.              00006700
      *----------------------------------------------------------------*00006800
                                                                        00006900
       FILE-CONTROL.                                                    00007000
             SELECT ROTINA ASSIGN     TO JCLROTINA                      00007102
                    FILE STATUS     IS WRK-FS-ROTINA.                   00007202
                                                                        00007300
      *================================================================*00007400
       DATA                                      DIVISION.              00007500
      *================================================================*00007600
                                                                        00007700
      *----------------------------------------------------------------*00007800
       FILE                                      SECTION.               00007900
      *----------------------------------------------------------------*00008000
                                                                        00008100
       FD ROTINA                                                        00008202
           RECORDING MODE IS F                                          00008300
           BLOCK CONTAINS 0 RECORDS.                                    00008400
                                                                        00008500
      *----------------------------------------------------------------*00009300
       WORKING-STORAGE                            SECTION.              00009400
      *----------------------------------------------------------------*00009500
                                                                        00009600
                                                                        00010900
      *================================================================*00011000
       PROCEDURE DIVISION.                                              00011100
      *================================================================*00011200
                                                                        00011300
      ******************************************************************00011400
      *              P R O G R A M A  P R I N C I P A L                *00011502
      ******************************************************************00011600
                                                                        00011700
      *----------------------------------------------------------------*00011800
       0000-PRINCIPAL                            SECTION.               00011900
      *----------------------------------------------------------------*00012000
                                                                        00012100
                                                                        00013000
      *----------------------------------------------------------------*00014000
       0000-99-FIM.                           EXIT.                     00015000
      *----------------------------------------------------------------*00016000
                                                                        00017000
      *----------------------------------------------------------------*00018000
      ******************************************************************00018102
      *                       I N I C I A R                            *00018202
      ******************************************************************00018302
                                                                        00018402
      *----------------------------------------------------------------*00018502
       1000-INICIAR                           SECTION.                  00019000
      *----------------------------------------------------------------*00020000
                                                                        00021000
                                                                        00023800
      *----------------------------------------------------------------*00023900
       1000-99-FIM.                            EXIT.                    00024000
      *----------------------------------------------------------------*00024100
                                                                        00024200
      ******************************************************************00024300
      *                     P R O C E S S A R                          *00024402
      ******************************************************************00024500
                                                                        00024600
      *----------------------------------------------------------------*00024700
       2000-PROCESSAR                       SECTION.                    00024800
      *----------------------------------------------------------------*00024900
                                                                        00025000
                                                                        00044000
      *----------------------------------------------------------------*00044100
       2000-99-FIM.                            EXIT.                    00044200
      *----------------------------------------------------------------*00044300
                                                                        00044402
      ******************************************************************00044502
      *                     R E L A T O R I O                          *00044602
      ******************************************************************00044702
                                                                        00044802
      *----------------------------------------------------------------*00044900
       2100-RELATORIO                          SECTION.                 00045000
      *----------------------------------------------------------------*00046000
      *----------------------------------------------------------------*00046100
       2100-99-FIM.                            EXIT.                    00046200
      *----------------------------------------------------------------*00046300
                                                                        00046402
      ******************************************************************00046500
      *                      F I N L I Z A R                           *00046602
      ******************************************************************00046700
                                                                        00046800
      *----------------------------------------------------------------*00046900
       3000-FINALIZAR                        SECTION.                   00047000
      *----------------------------------------------------------------*00047100
                                                                        00047200
                                                                        00047700
      *----------------------------------------------------------------*00047800
       3000-99-FIM.                           EXIT.                     00047900
      *----------------------------------------------------------------*00048000
      *----------------------------------------------------------------*00049000
      *----------------------------------------------------------------*00050000
       4000-RELA-ACUM                        SECTION.                   00051000
      *----------------------------------------------------------------*00052000
                                                                        00052100
                                                                        00052700
      *----------------------------------------------------------------*00052800
       4000-99-FIM.                           EXIT.                     00052900
      *----------------------------------------------------------------*00053000
       9000-TRATAR-ERRO                      SECTION.                   00054000
      *----------------------------------------------------------------*00054100
                                                                        00054200
                                                                        00054700
      *----------------------------------------------------------------*00054800
       9000-99-FIM.                           EXIT.                     00054900
      *----------------------------------------------------------------*00055000
