      *================================================================*00001000
       IDENTIFICATION                             DIVISION.             00002000
      *================================================================*00002100
                                                                        00002200
       PROGRAM-ID.  FR05CB22.                                           00002300
                                                                        00002400
      *================================================================*00002500
      *                         F O U R S Y S                          *00002600
      *================================================================*00002700
      *    AUTOR    : DOUGLAS PEREIRA DA COSTA                          00002800
      *    EMPRESA  : FOURSYS                                           00002900
      *----------------------------------------------------------------*00003000
      *    DATA     : 26/04/2022                                        00004000
      *    OBJETIVO : APLICANDO O COMANDO IF COM OPERADORES LOGICOS     00005000
      *================================================================*00006000
                                                                        00007000
      *================================================================*00008000
       ENVIRONMENT                                DIVISION.             00009002
      *================================================================*00010000
                                                                        00011002
      *----------------------------------------------------------------*00012002
       CONFIGURATION                              DIVISION.             00012102
      *----------------------------------------------------------------*00013002
                                                                        00013102
       SPECIAL-NAMES.                                                   00013202
            DECIMAL-POINT IS COMMA.                                     00013302
                                                                        00013402
      *================================================================*00014002
       DATA                                       DIVISION.             00020000
      *================================================================*00030000
                                                                        00040000
      *----------------------------------------------------------------*00041000
       WORKING-STORAGE                             SECTION.             00042000
      *----------------------------------------------------------------*00043000
                                                                        00044000
       01 WRK-LOJA.                                                     00045000
          05 WRK-CODIGO       PIC 9(05)V99       VALUE ZEROS.           00046000
          05 WRK-PRODUTO      PIC X(20)          VALUE SPACES.          00047000
          05 WRK-VALOR        PIC 9(02)V99       VALUE ZEROS.           00048000
          05 WRK-ESTADO       PIC X(02)          VALUE SPACES.          00048100
       01 WRK-FRETE           PIC 9(08)V99       VALUE ZEROS.           00048201
       01 WRK-MSG             PIC X(45)          VALUE SPACES.          00048302
                                                                        00048402
      *================================================================*00049000
       PROCEDURE DIVISION.                                              00050000
      *================================================================*00060000
      *----------------------------------------------------------------*00070000
       0000-PRINCIPAL                              SECTION.             00080000
      *----------------------------------------------------------------*00090000
           PERFORM 1000-INICIAR.                                        00090102
           PERFORM 2000-PROCESSAR.                                      00090202
           PERFORM 3000-FINALIZAR.                                      00090302
                                                                        00090402
      *----------------------------------------------------------------*00090502
       0000-99-FIM         EXIT.                                        00090602
      *----------------------------------------------------------------*00090702
      *----------------------------------------------------------------*00090802
       1000-INICIAR                                SECTION.             00090902
      *----------------------------------------------------------------*00091002
                                                                        00091102
           ACCEPT WRK-LOJA FROM SYSIN.                                  00091202
                                                                        00091302
      *----------------------------------------------------------------*00092400
       1000-99-FIM.                                   EXIT.             00092502
      *----------------------------------------------------------------*00092600
                                                                        00092702
      *----------------------------------------------------------------*00092802
       2000-PROCESSAR                              SECTION.             00092902
      *----------------------------------------------------------------*00093100
                                                                        00093202
           IF WRK-VALOR GREATER THAN OR EQUAL 1000                      00093302
              EVALUATE WRK-ESTADO                                       00093402
                 WHEN 'SP'                                              00093502
                     COMPUTE WRK-FRETE = WRK-VALOR * 10 / 100           00093602
                 WHEN 'RJ'                                              00093702
                     COMPUTE WRK-FRETE = WRK-VALOR * 15 / 100           00093802
                 WHEN 'MG'                                              00093902
                     COMPUTE WRK-FRETE = WRK-VALOR * 20 / 100           00094002
                 WHEN OTHER                                             00094102
                     MOVE 'NAO ENTREGAMOS NESSA REGIAO' TO WRK-MSG      00094202
              END-EVALUATE                                              00094302
           ELSE                                                         00094402
              MOVE 'RETIRAR O PRODUTO SOMENTE NA LOJA' TO WRK-MSG       00094502
           END-IF.                                                      00094602
                                                                        00094702
      *----------------------------------------------------------------*00094802
       2000-99-FIM                        EXIT.                         00094902
      *----------------------------------------------------------------*00095002
                                                                        00095102
      *----------------------------------------------------------------*00095202
       3000-FINALIZAR                              SECTION.             00095302
      *----------------------------------------------------------------*00095400
                                                                        00095502
           DISPLAY 'CODIGO DO PRODUTO: ' WRK-CODIGO.                    00095602
           DISPLAY 'PRODUTO          : ' WRK-PRODUTO.                   00095702
           DISPLAY 'VALOR DO PRODUTO: ' WRK-VALOR.                      00095802
                                                                        00095902
           IF WRK-FRETE = 0                                             00096002
              DISPLAY WRK-MSG                                           00096102
           ELSE                                                         00096202
              DISPLAY 'VALOR DO FRETE' WRK-FRETE                        00096302
           END-IF.                                                      00096402
                                                                        00096502
           STOP RUN.                                                    00096602
      *----------------------------------------------------------------*00096700
       3000-99-FIM                                    EXIT.             00096802
      *----------------------------------------------------------------*00097000
      *----------------------------------------------------------------*00098002
       9000-TRATAR-ERRO                               SECTION.          00099002
      *----------------------------------------------------------------*00100002
      *----------------------------------------------------------------*00110002
       9000-99-FIM                                    EXIT.             00120002
      *----------------------------------------------------------------*00130002
