       IDENTIFICATION                            DIVISION.              00010000
       PROGRAM-ID. FR05CB01.                                            00020001
      *==========================================                       00030000
      *     AUTOR   : DOUGLAS PEREIRA DA COSTA                          00040000
      *     EMPRESA : FOURSYS                                           00050000
      *     DATA    : ZZ/ZZ/ZZZZ                                        00060000
      *     OBJETIVO: TESTE DE COMPILACAO                               00070000
      *==========================================                       00080000
       PROCEDURE                                 DIVISION.              00090000
           DISPLAY 'MEU PRIMEIRO PROGRAMA COBOL - FR05CB01'.            00100000
           STOP RUN.                                                    00110000
