      *================================================================J00001000
       IDENTIFICATION                                     DIVISION.     00002000
      *================================================================*00003000
                                                                        00004000
       PROGRAM-ID. FR05CB25.                                            00005000
                                                                        00006000
      *================================================================*00007000
      *                                                                *00008000
      *     AUTOR.....: DOUGLAS PEREIRA DA COSTA                       *00009000
      *     ANALISTA..: IVAN SANCHES                                   *00009100
      *     EMPRESA...: FOURSYS                                        *00009200
      *     DATA......: 27/04/2022                                     *00009300
      *                                                                *00009400
      *----------------------------------------------------------------*00009500
      *                                                                *00009600
      *     OBJETIVO: RECEBER NAS VARIAVEIS WRK-NOTA1 -> 0800(2DEC),   *00009700
      *               WRK-NOTA2 -> 0700(2DEC).                         *00009800
      *               CALCULAR A MEDIA(WRK-MEDIA)-REGRAS(STATUS):      *00009900
      *               * MENOR QUE 2 - REPROVADO                        *00010000
      *               * ENTRE 2 E 5,99 - RECUPERACAO                   *00020000
      *               * ENTRE 6 E 8,99 - APROVADO                      *00021000
      *               * ENTRE 9 E 10 - APROVADO COM LOUVOR             *00022000
      *               * MAIOR QUE 10 - MEDIA ERRADA                    *00023000
      *               COMANDO EVALUATE.                                *00024000
      *================================================================*00025000
       ENVIRONMENT                                        DIVISION.     00026000
      *================================================================*00027000
                                                                        00028000
      *----------------------------------------------------------------*00029000
       CONFIGURATION                                      SECTION.      00030000
      *----------------------------------------------------------------*00040000
                                                                        00050000
       SPECIAL-NAMES.                                                   00060000
           DECIMAL-POINT IS COMMA.                                      00070000
                                                                        00071000
      *================================================================J00071100
       DATA                                               DIVISION.     00071200
      *================================================================*00071300
                                                                        00071400
      *----------------------------------------------------------------*00071500
       WORKING-STORAGE                                    SECTION.      00071600
      *----------------------------------------------------------------*00071700
                                                                        00071800
       01 WRK-NOTAS.                                                    00071900
          05 WRK-NOTA1                 PIC 9(02)V99     VALUE ZEROS.    00072000
          05 WRK-NOTA2                 PIC 9(02)V99     VALUE ZEROS.    00072100
       77 WRK-MEDIA                    PIC 9(02)V99     VALUE ZEROS.    00072300
       77 WRK-STATUS                   PIC X(45)        VALUE SPACES.   00072500
                                                                        00072600
      *================================================================*00072700
       PROCEDURE                                          DIVISION.     00072800
      *================================================================*00072900
                                                                        00073000
      *----------------------------------------------------------------*00074000
       0000-PRINCIPAL                                     SECTION.      00074100
      *----------------------------------------------------------------*00074200
                                                                        00074300
           PERFORM 1000-INICIAR.                                        00074400
               IF WRK-NOTAS NOT EQUAL ZEROS                             00074500
                  PERFORM 2000-PROCESSAR.                               00074600
                                                                        00074700
           PERFORM 3000-FINALIZAR.                                      00074800
                                                                        00074900
           STOP RUN.                                                    00075000
                                                                        00075100
      *----------------------------------------------------------------*00075200
       0000-99-FIM.                                       EXIT.         00075300
      *----------------------------------------------------------------*00075400
                                                                        00075500
      *----------------------------------------------------------------*00075600
       1000-INICIAR                                       SECTION.      00075700
      *----------------------------------------------------------------*00075800
                                                                        00075900
           ACCEPT WRK-NOTAS            FROM SYSIN.                      00076000
                                                                        00076100
      *----------------------------------------------------------------*00076200
       1000-99-FIM.                                       EXIT.         00076300
      *----------------------------------------------------------------*00076400
                                                                        00076500
      *----------------------------------------------------------------*00076600
       2000-PROCESSAR                                     SECTION.      00076700
      *----------------------------------------------------------------*00076800
                                                                        00076900
           COMPUTE WRK-MEDIA = ( WRK-NOTA1 + WRK-NOTA2 ) / 2.           00077000
               EVALUATE WRK-MEDIA                                       00077100
                   WHEN 0 THRU 1,99                                     00077200
                     MOVE 'REPROVADO '                                  00077300
                                       TO WRK-STATUS                    00077400
                   WHEN 2,00 THRU 5,99                                  00077500
                     MOVE 'ALUNO DE RECUPERACAO'                        00077600
                                       TO WRK-STATUS                    00077700
                   WHEN 6,00 THRU 8,99                                  00077800
                     MOVE 'ALUNO APROVADO'                              00077900
                                       TO WRK-STATUS                    00078000
                   WHEN 9,00 THRU 10,00                                 00078100
                     MOVE 'ALUNO APROVADO COM LOUVOR'                   00078200
                                       TO WRK-STATUS                    00078300
                   WHEN OTHER                                           00078400
                     MOVE 'ALGO DEU ERRADO!!'                           00078500
                                       TO WRK-STATUS                    00078600
                END-EVALUATE.                                           00078700
                                                                        00078800
      *----------------------------------------------------------------*00078900
       2000-99-FIM.                                       EXIT.         00079000
      *----------------------------------------------------------------*00079100
                                                                        00079200
      *----------------------------------------------------------------*00079300
       3000-FINALIZAR                                     SECTION.      00079400
      *----------------------------------------------------------------*00079500
                                                                        00079600
            DISPLAY 'MEDIA....' WRK-MEDIA.                              00079700
            DISPLAY 'STATUS...' WRK-STATUS.                             00079800
                                                                        00079900
      *----------------------------------------------------------------*00080000
       3000-99-FIM.                                       EXIT.         00080100
      *----------------------------------------------------------------*00080200
      *----------------------------------------------------------------*00080300
       9000-TRATAR-ERRO                                   SECTION.      00080400
      *----------------------------------------------------------------*00080500
                                                                        00080600
      *----------------------------------------------------------------*00080700
       9000-99-FIM.                                       EXIT.         00080800
      *----------------------------------------------------------------*00080900
