      *================================================================*00001000
       IDENTIFICATION                            DIVISION.              00002000
      *================================================================*00002100
                                                                        00002200
       PROGRAM-ID.  GRALOGDB.                                           00002300
                                                                        00002400
      *================================================================*00002500
      *                         F O U R S Y S                          *00002600
      *================================================================*00002700
      *    AUTOR    : DOUGLAS PEREIRA DA COSTA                          00002800
      *    EMPRESA  : FOURSYS                                           00002900
      *    DATA     : 10/06/2022                                        00003000
      *----------------------------------------------------------------*00004000
      *    OBJETIVO : GRAVACAO DE LOGS DE OCORRENCIA                   *00005000
      *================================================================*00005100
                                                                        00005200
      *================================================================*00005300
       ENVIRONMENT DIVISION.                                            00005400
      *================================================================*00005500
                                                                        00005600
      *----------------------------------------------------------------*00005700
       CONFIGURATION                              SECTION.              00005800
      *----------------------------------------------------------------*00005900
                                                                        00006000
       SPECIAL-NAMES.                                                   00006100
           DECIMAL-POINT IS COMMA.                                      00006200
                                                                        00006300
      *----------------------------------------------------------------*00006400
      *----------------------------------------------------------------*00006500
       INPUT-OUTPUT                               SECTION.              00006600
      *----------------------------------------------------------------*00006700
                                                                        00006800
       FILE-CONTROL.                                                    00006900
             SELECT LOGERROS ASSIGN     TO LOGERROS                     00007000
                    FILE STATUS     IS WRK-FS-LOGERROS.                 00007100
                                                                        00007200
      *================================================================*00007300
       DATA                                      DIVISION.              00007400
      *================================================================*00007500
                                                                        00007600
      *----------------------------------------------------------------*00007700
       FILE                                      SECTION.               00007800
      *----------------------------------------------------------------*00007900
      *----------------------------------------------------------------*00008000
      *                     ARQUIVO LOGERROS                           *00008100
      *                                                  - LRECL = 058 *00008200
      *----------------------------------------------------------------*00008300
                                                                        00008400
       FD LOGERROS                                                      00008500
           RECORDING MODE IS F                                          00008600
           BLOCK CONTAINS 0 RECORDS.                                    00008700
                                                                        00008800
       01 FD-LOGERROS                   PIC X(58).                      00008900
                                                                        00009000
      *----------------------------------------------------------------*00009100
       WORKING-STORAGE                            SECTION.              00009200
      *----------------------------------------------------------------*00009300
                                                                        00009400
      *----------------------------------------------------------------*00009500
       01 FILLER                        PIC X(50) VALUE                 00009600
                      '***AREA DE STATUS***'.                           00009700
      *----------------------------------------------------------------*00009800
                                                                        00009900
        77 WRK-FS-LOGERROS              PIC X(02).                      00010000
        77 WRK-ARQ-DATA                 PIC 9(08).                      00010100
        77 WRK-ARQ-HORA                 PIC 9(08).                      00010200
                                                                        00010300
      *----------------------------------------------------------------*00010400
       LINKAGE                                     SECTION.             00010500
      *----------------------------------------------------------------*00010600
                                                                        00010700
       01 COMMAREA.                                                     00010800
          05 LNK-PROGRAMA               PIC X(08).                      00010900
          05 LNK-SECAO                  PIC X(04).                      00011000
          05 LNK-MENSAGEM               PIC X(30).                      00011100
          05 LNK-STATUS                 PIC X(02).                      00011200
          05 LNK-DATA                   PIC X(08).                      00011300
          05 LNK-HORA                   PIC X(06).                      00011400
          05 LNK-SQLCODE                PIC X(03).                      00011500
      *================================================================*00011600
       PROCEDURE DIVISION USING COMMAREA.                               00011700
      *================================================================*00011800
                                                                        00011900
                                                                        00012000
            OPEN EXTEND LOGERROS.                                       00013000
                                                                        00014000
            IF WRK-FS-LOGERROS NOT EQUAL ZEROS                          00015000
                DISPLAY 'ERRO NO OPEN' WRK-FS-LOGERROS                  00016000
            ELSE                                                        00017000
                ACCEPT WRK-ARQ-DATA      FROM DATE YYYYMMDD             00018000
                ACCEPT WRK-ARQ-HORA      FROM TIME                      00019000
                MOVE WRK-ARQ-DATA        TO LNK-DATA                    00020000
                MOVE WRK-ARQ-HORA(01:06) TO LNK-HORA                    00021000
                                                                        00022000
                MOVE COMMAREA            TO FD-LOGERROS                 00023000
                                                                        00024000
                WRITE FD-LOGERROS                                       00024100
                CLOSE LOGERROS                                          00024200
            END-IF.                                                     00024300
                                                                        00024400
             GOBACK.                                                    00024500
      *----------------------------------------------------------------*00024600
