      *================================================================*00001000
       IDENTIFICATION                            DIVISION.              00002000
      *================================================================*00002100
                                                                        00002200
       PROGRAM-ID.  FR05CB36.                                           00002300
                                                                        00002400
      *================================================================*00002500
      *                         F O U R S Y S                          *00002600
      *================================================================*00002700
      *    AUTOR    : DOUGLAS PEREIRA DA COSTA                         *00002800
      *    EMPRESA  : FOURSYS                                          *00002900
      *    INSTRUTOR: IVAN PETRUCCI                                    *00003000
      *    DATA     : 18/05/2022                                       *00004000
      *----------------------------------------------------------------*00004100
      *    OBJETIVO : 1 - LER ARQUIVO CLIENTES ATÉ EOF                 *00004200
      *               2 - GRAVAR NO ARQUIVO RELAT TODOS OS REGISTROS   *00004300
      *               3 - SOMAR TODOS OS SALDOS E MOSTRAR NO RESUMO    *00004400
      *                   DA SYSOUT                                    *00004500
      *               4 - A CADA 05 REGISTROS PULAR 1 PAGINA           *00004600
      *               5 - MOSTRAR LIDOS E GRAVADOS NA SYSOUT           *00004700
      *----------------------------------------------------------------*00004800
      *    BOOKS    :                                                  *00004900
      *               B#CLIENT - BOOK DE ENTRADA                       *00005000
      *               B#RELAT  - BOOK DE SAIDA.                        *00005100
      *================================================================*00005200
                                                                        00005300
      *================================================================*00005400
       ENVIRONMENT                                DIVISION.             00005500
      *================================================================*00005600
                                                                        00005700
      *----------------------------------------------------------------*00005800
       CONFIGURATION                              SECTION.              00005900
      *----------------------------------------------------------------*00006000
                                                                        00006100
       SPECIAL-NAMES.                                                   00006200
           DECIMAL-POINT IS COMMA.                                      00006300
                                                                        00006400
      *----------------------------------------------------------------*00006500
      *----------------------------------------------------------------*00006600
       INPUT-OUTPUT                               SECTION.              00006700
      *----------------------------------------------------------------*00006800
                                                                        00006900
       FILE-CONTROL.                                                    00007000
             SELECT CLIENT  ASSIGN     TO JCLCLIEN                      00007100
                    FILE STATUS     IS WRK-FS-CLIENTES.                 00007200
                                                                        00007300
             SELECT RELAT   ASSIGN     TO JCLRELAT                      00007400
                    FILE STATUS     IS WRK-FS-RELATORIO.                00007500
      *================================================================*00007600
       DATA                                      DIVISION.              00007700
      *================================================================*00007800
                                                                        00007900
      *----------------------------------------------------------------*00008000
       FILE                                      SECTION.               00008100
      *----------------------------------------------------------------*00008200
      *----------------------------------------------------------------*00008300
      *    INPUT - DADOS DO ARQUIVO DE ENTRADA (CLIENTES)              *00008400
      *                           - LRECL = 037                        *00008500
      *----------------------------------------------------------------*00008600
                                                                        00008700
       FD CLIENT                                                        00008800
           RECORDING MODE IS F                                          00008900
           BLOCK CONTAINS 0 RECORDS.                                    00009000
       01 FD-CLIENTES       PIC X(037).                                 00009100
                                                                        00009200
      *----------------------------------------------------------------*00009300
      *    OUTPUT - DADOS DO ARQUIVO DE SAIDA  (RELAT)                 *00009400
      *                           - LRECL = 070                        *00009500
      *----------------------------------------------------------------*00009600
                                                                        00009700
       FD RELAT                                                         00009800
           RECORDING MODE IS F                                          00009900
           BLOCK CONTAINS 0 RECORDS.                                    00010000
       01 FD-RELAT               PIC X(070).                            00011000
                                                                        00011100
      *----------------------------------------------------------------*00011200
       WORKING-STORAGE                            SECTION.              00011300
      *----------------------------------------------------------------*00011400
                                                                        00011500
       01 WRK-FILLER.                                                   00012000
          05 MESES                PIC X(009) OCCURS 12 TIMES.           00012100
                                                                        00012600
       01 WRK-DATA.                                                     00012700
          05 WRK-ANO              PIC 9(004).                           00012800
          05 WRK-MES              PIC 9(002).                           00012900
          05 WRK-DIA              PIC 9(002).                           00013000
                                                                        00014400
       01 WRK-DATA2.                                                    00014500
          05 WRK-DIA              PIC 9(002).                           00014600
          05 FILLER               PIC X(004) VALUE ' DE '.              00014700
          05 WRK-MES-EXT          PIC X(009).                           00014800
          05 FILLER               PIC X(004) VALUE ' DE '.              00014900
          05 WRK-ANO              PIC 9(004).                           00015000
                                                                        00017700
      *----------------------------------------------------------------*00018000
       LINKAGE                                   SECTION.               00018100
      *----------------------------------------------------------------*00018200
       01 COMMAREA.                                                     00018300
          02 LNK-DATA             PIC X(030).                           00018400
      *================================================================*00018500
       PROCEDURE                                 DIVISION.              00018600
      *================================================================*00018700
                                                                        00018800
      ******************************************************************00018900
      *              P R O G R A M A  P R I N C I P A L                *00019000
      ******************************************************************00019100
                                                                        00019200
      *----------------------------------------------------------------*00019300
       0000-PRINCIPAL                            SECTION.               00019400
      *----------------------------------------------------------------*00019500
                                                                        00019600
            PERFORM 1000-INICIAR                                        00019700
                                                                        00019800
            PERFORM 2000-VERIFICAR-VAZIO                                00019900
                                                                        00020000
            PERFORM 3000-PROCESSAR                                      00020100
                    UNTIL WRK-FS-CLIENTES EQUAL '10'                    00020200
                                                                        00020300
            PERFORM 4000-FINALIZAR                                      00020400
                                                                        00020500
            STOP RUN.                                                   00020600
                                                                        00020700
      *----------------------------------------------------------------*00020800
       0000-99-FIM.                           EXIT.                     00020900
      *----------------------------------------------------------------*00021000
                                                                        00021100
      *----------------------------------------------------------------*00021200
      ******************************************************************00021300
      *                       I N I C I A R                            *00021400
      ******************************************************************00021500
                                                                        00021600
      *----------------------------------------------------------------*00021700
       1000-INICIAR                           SECTION.                  00021800
      *----------------------------------------------------------------*00021900
                                                                        00022000
           OPEN INPUT CLIENT                                            00022100
                OUTPUT RELAT                                            00022200
           PERFORM 1100-TESTAR-STATUS.                                  00022300
                                                                        00022400
      *----------------------------------------------------------------*00022500
       1000-99-FIM.                            EXIT.                    00022600
      *----------------------------------------------------------------*00022700
                                                                        00022800
                                                                        00022900
      ******************************************************************00023000
      *                   T E S T A R  S T A T U S                     *00023100
      ******************************************************************00023200
                                                                        00023300
      *----------------------------------------------------------------*00023400
       1100-TESTAR-STATUS                    SECTION.                   00023500
      *----------------------------------------------------------------*00023600
                                                                        00023700
            PERFORM 1110-TESTAR-WRK-FS-CLIENTES                         00023800
                                                                        00023900
            PERFORM 1120-TESTAR-WRK-FS-RELATORIO.                       00024000
                                                                        00024100
      *----------------------------------------------------------------*00024200
       1100-99-FIM.                            EXIT.                    00025000
      *----------------------------------------------------------------*00026000
                                                                        00027000
      ******************************************************************00028000
      *           TESTAR ARQUIVO DE ENTRADA - WRK-FS-CLIENTES          *00029000
      ******************************************************************00030000
                                                                        00040000
      *----------------------------------------------------------------*00041000
       1110-TESTAR-WRK-FS-CLIENTES        SECTION.                      00042000
      *----------------------------------------------------------------*00043000
                                                                        00044000
           IF WRK-FS-CLIENTES NOT EQUAL ZEROS                           00045000
              MOVE 'ERRO NO ARQUIVO CLIENTES' TO WRK-MSG                00045100
              PERFORM 9000-TRATAR-ERRO                                  00045200
           END-IF.                                                      00045300
                                                                        00045400
      *----------------------------------------------------------------*00045500
       1110-99-FIM.                            EXIT.                    00045600
      *----------------------------------------------------------------*00045700
                                                                        00045800
      ******************************************************************00045900
      *           TESTAR ARQUIVO DE SAIDA - WRK-FS-RELATORIO           *00046000
      ******************************************************************00047000
                                                                        00047100
      *----------------------------------------------------------------*00047200
       1120-TESTAR-WRK-FS-RELATORIO            SECTION.                 00047300
      *----------------------------------------------------------------*00047400
                                                                        00047500
           IF WRK-FS-RELATORIO NOT EQUAL ZEROS                          00047600
              MOVE 'ERRO NA ABERTURA DO RELAT' TO WRK-MSG               00047700
              PERFORM 9000-TRATAR-ERRO                                  00047800
           END-IF.                                                      00047900
                                                                        00048000
      *----------------------------------------------------------------*00048100
       1120-99-FIM.                            EXIT.                    00048200
      *----------------------------------------------------------------*00048300
      ******************************************************************00048400
      *                  V E R I F I C A R  V A Z I O                  *00048500
      ******************************************************************00048600
                                                                        00048700
      *----------------------------------------------------------------*00048800
       2000-VERIFICAR-VAZIO                 SECTION.                    00048900
      *----------------------------------------------------------------*00049000
            PERFORM 2100-LEITURA                                        00050000
                                                                        00050100
               IF WRK-FS-CLIENTES  EQUAL '10'                           00050200
                  DISPLAY '********************************'            00050300
                  DISPLAY '                                '            00050400
                  DISPLAY '  ARQUIVO CLIENTES ESTA VAZIO   '            00050500
                  DISPLAY '    PROCESSAMENTO ENCERRADO     '            00050600
                  DISPLAY '                                '            00050700
                  DISPLAY '********************************'            00050800
               END-IF.                                                  00050900
                                                                        00051000
      *----------------------------------------------------------------*00051100
       2000-99-FIM.                         EXIT.                       00051200
      *----------------------------------------------------------------*00051300
                                                                        00051400
      *----------------------------------------------------------------*00051500
       2100-LEITURA                         SECTION.                    00051600
      *----------------------------------------------------------------*00051700
            READ CLIENT              INTO WRK-CLIENTES                  00051800
                                                                        00051900
               IF WRK-FS-CLIENTES  EQUAL '10'                           00052000
                  GO               TO 2100-99-FIM                       00053000
               END-IF.                                                  00053100
                                                                        00053200
               PERFORM 1110-TESTAR-WRK-FS-CLIENTES                      00053300
               ADD 1               TO WRK-LIDOS.                        00053400
      *----------------------------------------------------------------*00053500
       2100-99-FIM.                         EXIT.                       00053600
      *----------------------------------------------------------------*00053700
      ******************************************************************00053800
      *                     P R O C E S S A R                          *00053900
      ******************************************************************00054000
                                                                        00054100
      *----------------------------------------------------------------*00054200
       3000-PROCESSAR                        SECTION.                   00054300
      *----------------------------------------------------------------*00054400
                                                                        00054500
               IF WRK-LINHAS          GREATER 5                         00054600
                  PERFORM 3100-GRAVAR-CABECALHO                         00054700
                  PERFORM 3200-GRAVAR-CAMPOS                            00054800
               END-IF.                                                  00054900
                                                                        00055000
               MOVE FD-AGENCIA        TO WRK-AGENCIA-S                  00055100
               MOVE FD-CONTA-CLIENTES TO WRK-CONTA-S                    00055200
               MOVE FD-NOME-CLIENTES  TO WRK-NOME-S                     00055300
               MOVE FD-SALDO-CLIENTES TO WRK-SALDO-S                    00055400
               PERFORM 3300-GRAVAS-DETALHES.                            00055500
                                                                        00055600
      *----------------------------------------------------------------*00055700
       3000-99-FIM.                           EXIT.                     00055800
      *----------------------------------------------------------------*00055900
      *----------------------------------------------------------------*00056000
       3100-GRAVAR-CABECALHO                 SECTION.                   00056100
      *----------------------------------------------------------------*00056200
               ADD 1               TO WRK-PAGINA                        00056300
               MOVE WRK-PAGINA     FROM WRK-NUM-PAG                     00056400
               WRITE FD-RELAT      FROM WRK-CAB01 AFTER PAGE            00056500
               PERFORM 1120-TESTAR-WRK-FS-RELATORIO                     00056600
               MOVE 1              FROM WRK-LINHAS.                     00056700
      *----------------------------------------------------------------*00056800
       3100-99-FIM.                           EXIT.                     00056900
      *----------------------------------------------------------------*00057000
                                                                        00057100
      *----------------------------------------------------------------*00057200
       3200-GRAVAR-CAMPOS                     SECTION.                  00057300
      *----------------------------------------------------------------*00057400
               WRITE FD-RELAT      FROM WRK-CAB-CAMPOS                  00057500
               PERFORM 1120-TESTAR-WRK-FS-RELATORIO                     00057600
               MOVE 1              FROM WRK-LINHAS.                     00057700
      *----------------------------------------------------------------*00057800
       3200-99-FIM.                           EXIT.                     00057900
      *----------------------------------------------------------------*00058000
      *----------------------------------------------------------------*00058100
       3300-GRAVAR-DETALHES                  SECTION.                   00058200
      *----------------------------------------------------------------*00058300
                                                                        00058400
               WRITE FD-RELAT         FROM WRK-RELAT                    00058500
               PERFORM 1120-TESTAR-WRK-FS-RELATORIO                     00058600
               ADD 1                  TO WRK-LINHAS                     00058700
                                         WRK-GRAVADOS.                  00058800
                                                                        00058900
      *----------------------------------------------------------------*00059000
       3300-99-FIM.                           EXIT.                     00059100
      *----------------------------------------------------------------*00059200
      ******************************************************************00059300
      *                     F I N A L I Z A R                          *00059400
      ******************************************************************00059500
      *----------------------------------------------------------------*00059600
       4000-FINALIZAR                        SECTION.                   00059700
      *----------------------------------------------------------------*00059800
            IF WRK-LIDOS      GREATER ZEROS                             00059900
               PERFORM 4100-TOTAIS-LIDOS                                00060000
            END-IF                                                      00060100
                                                                        00060200
            CLOSE CLIENT                                                00060300
                  RELAT                                                 00060400
            IF WRK-FS-CLIENTES        NOT EQUAL ZEROS                   00060500
               MOVE 'ERRO NO FECHAMENTO CLIENTES' TO WRK-MSG            00060600
               PERFORM 9000-TRATAR-ERRO                                 00060700
               GO                                 TO 4000-99-FIM        00060800
            END-IF                                                      00060900
                                                                        00061000
            IF WRK-FS-RELATORIO       NOT EQUAL ZEROS                   00061100
               MOVE 'ERRO NO FECHAMENTO RELAT' TO WRK-MSG               00061200
               PERFORM 9000-TRATAR-ERRO                                 00061300
            END-IF.                                                     00061400
      *----------------------------------------------------------------*00061500
       4000-99-FIM.                           EXIT.                     00061600
      *----------------------------------------------------------------*00061700
                                                                        00061800
      ******************************************************************00061900
      *                    T O T A I S  L I D O S                      *00062000
      ******************************************************************00062100
      *----------------------------------------------------------------*00062200
       4100-TOTAIS-LIDOS                     SECTION.                   00062300
      *----------------------------------------------------------------*00062400
                                                                        00062500
                  DISPLAY '********************************'            00062600
                  DISPLAY '                                '            00062700
                  DISPLAY '  LIDOS   :  ' WRK-LIDOS                     00062800
                  DISPLAY '  GRAVADOS:  ' WRK-GRAVADOS                  00062900
                  DISPLAY '                                '            00063000
                  DISPLAY '********************************'.           00063100
                                                                        00063200
      *----------------------------------------------------------------*00063300
       4100-99-FIM.                           EXIT.                     00063400
      *----------------------------------------------------------------*00063500
      ******************************************************************00063600
      *                   T R A T A R  E R R O                         *00063700
      ******************************************************************00063800
                                                                        00063900
       9000-TRATAR-ERRO                     SECTION.                    00064000
      *----------------------------------------------------------------*00064100
                                                                        00064200
                  DISPLAY '********************************'            00064300
                  DISPLAY '                                '            00064400
                  DISPLAY '  ERRO: ' WRK-MSG                            00064500
                  DISPLAY '                                '            00064600
                  DISPLAY '********************************'            00064700
                  GOBACK.                                               00064800
      *----------------------------------------------------------------*00064900
       9000-99-FIM.                           EXIT.                     00065000
      *----------------------------------------------------------------*00066000
