      *================================================================*00001000
       IDENTIFICATION                            DIVISION.              00002000
      *================================================================*00002100
                                                                        00002200
       PROGRAM-ID.  PROGLOG.                                            00002300
                                                                        00002400
      *================================================================*00002500
      *                         F O U R S Y S                          *00002600
      *================================================================*00002700
      *    AUTOR    : DOUGLAS PEREIRA DA COSTA                          00002800
      *    EMPRESA  : FOURSYS                                           00002900
      *    DATA     : 19/05/2022                                        00003000
      *----------------------------------------------------------------*00004000
      *    OBJETIVO : CHAMA MODULO                                     *00005001
      *----------------------------------------------------------------*00005102
      *    BOOKS    :                                                  *00005202
      *               B#GRALOG                                         *00005302
      *                                                                *00005402
      *================================================================*00005500
                                                                        00005600
      *================================================================*00005700
       ENVIRONMENT DIVISION.                                            00005800
      *================================================================*00005900
                                                                        00006000
      *----------------------------------------------------------------*00006100
       CONFIGURATION                              SECTION.              00006200
      *----------------------------------------------------------------*00006300
                                                                        00006400
       SPECIAL-NAMES.                                                   00006500
           DECIMAL-POINT IS COMMA.                                      00006600
                                                                        00006700
      *================================================================*00007300
       DATA                                      DIVISION.              00007400
      *================================================================*00007500
                                                                        00007602
      *----------------------------------------------------------------*00009200
       WORKING-STORAGE                            SECTION.              00009300
      *----------------------------------------------------------------*00009400
                                                                        00009503
       77 WRK-MOD                    PIC X(08) VALUE 'GRAVALOG'.        00009608
                                                                        00009703
      ******************************************************************00009804
      *                 A R E A  D A  B O O K                          *00009904
      ******************************************************************00010004
                                                                        00011004
                           COPY 'B#GRALOG'.                             00011106
                                                                        00011204
      *================================================================*00011600
       PROCEDURE                                  DIVISION.             00011702
      *================================================================*00011800
                                                                        00011900
      *----------------------------------------------------------------*00012002
       0000-PRINCIPAL                             SECTION.              00012102
      *----------------------------------------------------------------*00012202
                                                                        00012300
            PERFORM 1000-INICIAR.                                       00012402
                                                                        00012502
            PERFORM 2000-PROCESSAR.                                     00012602
                                                                        00012702
            STOP RUN.                                                   00012802
                                                                        00012902
      *----------------------------------------------------------------*00013002
       0000-99-FIM.                               EXIT.                 00013102
      *----------------------------------------------------------------*00013202
      *----------------------------------------------------------------*00013302
       1000-INICIAR                               SECTION.              00014002
      *----------------------------------------------------------------*00024600
                                                                        00024702
                  MOVE 'FR05CB'           TO WRK-PROGRAMA               00024802
                  MOVE '1000'             TO WRK-SECAO                  00024902
                  MOVE 'ERRO SECAO 1000'  TO WRK-MENSAGEM               00025002
                  MOVE '35'               TO WRK-STATUS                 00025102
                    PERFORM 9000-TRATAR-ERRO.                           00025202
                                                                        00025302
      *----------------------------------------------------------------*00025402
       1000-99-FIM.                               EXIT.                 00025507
      *----------------------------------------------------------------*00025602
      *----------------------------------------------------------------*00026002
       2000-PROCESSAR                             SECTION.              00027002
      *----------------------------------------------------------------*00028002
                                                                        00029002
                  MOVE 'FR05CB'           TO WRK-PROGRAMA               00029102
                  MOVE '1000'             TO WRK-SECAO                  00029202
                  MOVE 'ERRO SECAO 1000'  TO WRK-MENSAGEM               00029302
                  MOVE '35'               TO WRK-STATUS                 00029402
                    PERFORM 9000-TRATAR-ERRO.                           00029502
      *----------------------------------------------------------------*00030002
       2000-99-FIM.                               EXIT.                 00040007
      *----------------------------------------------------------------*00050002
      *----------------------------------------------------------------*00060002
       9000-TRATAR-ERRO                           SECTION.              00070002
      *----------------------------------------------------------------*00080002
                                                                        00090002
                       CALL WRK-MOD USING WRK-LOG.                      00091002
                                                                        00092002
      *----------------------------------------------------------------*00100002
       9000-FIM.                                  EXIT.                 00110002
      *----------------------------------------------------------------*00120002
