      *================================================================*00001000
       IDENTIFICATION                            DIVISION.              00002000
      *================================================================*00002100
                                                                        00002200
       PROGRAM-ID.  RELATEX3.                                           00002307
                                                                        00002400
      *================================================================*00002500
      *                         F O U R S Y S                          *00002600
      *================================================================*00002700
      *    AUTOR    : DOUGLAS PEREIRA DA COSTA                         *00002800
      *    EMPRESA  : FOURSYS                                          *00002900
      *    INSTRUTOR: IVAN PETRUCCI                                    *00003000
      *    DATA     : 27/05/2022                                       *00004001
      *----------------------------------------------------------------*00004100
      *    OBJETIVO : LER TODOS OS REGISTRO DO ARQUIVO  DE ENTRADA     *00004200
      *               (MOV2505A).                                      *00004304
      *               GRAVAR NO ARQUIVO DE SAIDA (RELAEX03) SOMENTE OS *00004404
      *               REGRISTOS DOS CLIENTES COM O SALDO ACIMA DE      *00004518
      *               1000000.                                         *00004618
      *----------------------------------------------------------------*00004800
      *    ARQUIVO  :                                                  *00004917
      *    DDNAME           I/O                                        *00005017
      *                                                                *00005117
      *    MOV2505A          I                                         *00005217
      *    RELAEX03          O                                         *00005317
      *================================================================*00005400
                                                                        00005500
      *================================================================*00005600
       ENVIRONMENT                                DIVISION.             00005700
      *================================================================*00005800
                                                                        00005900
      *----------------------------------------------------------------*00006000
       CONFIGURATION                              SECTION.              00006100
      *----------------------------------------------------------------*00006200
                                                                        00006300
       SPECIAL-NAMES.                                                   00006400
           DECIMAL-POINT IS COMMA.                                      00006500
                                                                        00006600
      *----------------------------------------------------------------*00006700
      *----------------------------------------------------------------*00006800
       INPUT-OUTPUT                               SECTION.              00006900
      *----------------------------------------------------------------*00007000
                                                                        00007100
       FILE-CONTROL.                                                    00007200
             SELECT MOV2505A ASSIGN     TO JCLMOVA                      00007301
                    FILE STATUS     IS WRK-FS-MOV2505A.                 00007401
                                                                        00007500
             SELECT RELAEX03 ASSIGN     TO JCLRELT                      00007604
                    FILE STATUS     IS WRK-FS-RELAEX03.                 00007704
      *================================================================*00007800
       DATA                                      DIVISION.              00007900
      *================================================================*00008000
                                                                        00008100
      *----------------------------------------------------------------*00008200
       FILE                                      SECTION.               00008300
      *----------------------------------------------------------------*00008400
      *----------------------------------------------------------------*00008500
      *  INPUT - DADOS DO ARQUIVO DE ENTRADA (MOV2505A) - LRECL = 046  *00008601
      *----------------------------------------------------------------*00008700
                                                                        00008800
       FD MOV2505A                                                      00008901
           RECORDING MODE IS F                                          00009000
           BLOCK CONTAINS 0 RECORDS.                                    00009100
       01 FD-MOV2505A.                                                  00009201
          05 FD-MOV2505A-CHAVE.                                         00009301
             10 FD-MOV2505A-AGENCIA      PIC 9(004).                    00009401
             10 FD-MOV2505A-CONTA        PIC 9(004).                    00009501
          05 FD-MOV2505A-NOME            PIC X(030).                    00009601
          05 FD-MOV2505A-SALDO           PIC 9(008).                    00009701
                                                                        00009801
      *----------------------------------------------------------------*00009900
      *  OUTPUT - DADOS DO ARQUIVO DE SAIDA  (RELAEX03) - LRECL = 060  *00010004
      *----------------------------------------------------------------*00010100
                                                                        00010200
       FD RELAEX03                                                      00010304
           RECORDING MODE IS F                                          00010400
           BLOCK CONTAINS 0 RECORDS.                                    00010500
       01 FD-RELAEX03                    PIC X(060).                    00011004
                                                                        00011100
      *----------------------------------------------------------------*00011200
       WORKING-STORAGE                            SECTION.              00011300
      *----------------------------------------------------------------*00011400
                                                                        00011500
      *----------------------------------------------------------------*00011600
       01 FILLER                  PIC X(050) VALUE                      00011700
                     '*** AREA DE CABECALHO ***'.                       00011800
      *----------------------------------------------------------------*00011900
       01 WRK-CAB01.                                                    00012007
          05 FILLER               PIC X(005) VALUE SPACES.              00012116
          05 FILLER               PIC X(040) VALUE                      00012200
             '-----------RELATORIO DO CLIENTE---------'.                00012405
          05 FILLER               PIC X(018) VALUE SPACES.              00012516
          05 FILLER               PIC X(005) VALUE 'PAG. '.             00012607
          05 WRK-NUM-PAG          PIC 9(002) VALUE ZEROS.               00012700
                                                                        00012800
       01 WRK-CAB-CAMPOS.                                               00012900
          05 FILLER               PIC X(007) VALUE 'AGENCIA'.           00013003
          05 FILLER               PIC X(006) VALUE SPACES.              00013115
          05 FILLER               PIC X(005) VALUE 'CONTA'.             00013203
          05 FILLER               PIC X(008) VALUE SPACES.              00013315
          05 FILLER               PIC X(004) VALUE 'NOME'.              00013415
          05 FILLER               PIC X(022) VALUE SPACES.              00013516
          05 FILLER               PIC X(005) VALUE 'SALDO'.             00013603
          05 FILLER               PIC X(002) VALUE SPACES.              00013715
                                                                        00013803
       01 WRK-RELATORIO.                                                00013903
          05 WRK-CLI-AGENCIA      PIC 9(005).                           00014003
          05 FILLER               PIC X(008).                           00014103
          05 WRK-CLI-CONTA        PIC 9(005).                           00014203
          05 FILLER               PIC X(008).                           00014303
          05 WRK-CLI-NOME         PIC X(020).                           00014403
          05 FILLER               PIC X(006).                           00014503
          05 WRK-CLI-SALDO        PIC 9(008).                           00014603
                                                                        00014703
       01 WRK-PULA-LINHA          PIC X(060) VALUE SPACES.              00014803
                                                                        00014903
       01 WRK-RODAPE.                                                   00015003
          05 FILLER               PIC X(012) VALUE 'TOTAL LIDOS:'.      00015103
          05 FILLER               PIC X(044) VALUE SPACES.              00015203
          05 WRK-SALDO-TOTAL      PIC ZZZZ.                             00015303
                                                                        00015403
      *----------------------------------------------------------------*00015500
       01 FILLER                  PIC X(050)     VALUE                  00015600
             '*** AREA DE VARIAVEL DE FILE STATUS ***'.                 00015700
      *----------------------------------------------------------------*00015800
                                                                        00015900
       01 WRK-FS-MOV2505A         PIC X(002) VALUE SPACES.              00016004
       01 WRK-FS-RELAEX03         PIC X(002) VALUE SPACES.              00016104
                                                                        00016200
      *----------------------------------------------------------------*00016300
       01 FILLER                  PIC X(050)     VALUE                  00016400
                     '*** AREA DE ACUMULADORES ***'.                    00016500
      *----------------------------------------------------------------*00016600
                                                                        00016700
       01 WRK-GRAVADOS                   PIC 9(003) VALUE ZEROS.        00016800
       01 WRK-LIDOS                      PIC 9(003) VALUE ZEROS.        00016900
                                                                        00017000
      *----------------------------------------------------------------*00017100
       01 FILLER                  PIC X(050)     VALUE                  00017200
                     '*** AREA DE AUXILIARES ***'.                      00017300
      *----------------------------------------------------------------*00017400
                                                                        00017500
       01 WRK-MSG                        PIC X(030) VALUE SPACES.       00017600
       01 WRK-PAGINA                     PIC 9(002) VALUE ZEROS.        00017700
       01 WRK-LINHA                      PIC 9(002) VALUE 6.            00017813
                                                                        00017900
      *================================================================*00019100
       PROCEDURE                                 DIVISION.              00019200
      *================================================================*00019300
                                                                        00019400
      ******************************************************************00019500
      *              P R O G R A M A  P R I N C I P A L                *00019600
      ******************************************************************00019700
                                                                        00019800
      *----------------------------------------------------------------*00019900
       0000-PRINCIPAL                            SECTION.               00020000
      *----------------------------------------------------------------*00020100
                                                                        00020200
            PERFORM 1000-INICIAR                                        00020300
                                                                        00020400
            PERFORM 2000-VERIFICAR-VAZIO                                00020500
                                                                        00020600
            PERFORM 3000-PROCESSAR                                      00020700
                    UNTIL WRK-FS-MOV2505A EQUAL 10                      00020804
                                                                        00020900
            PERFORM 4000-FINALIZAR.                                     00021000
                                                                        00021100
            STOP RUN.                                                   00021200
                                                                        00021300
      *----------------------------------------------------------------*00021400
       0000-99-FIM.                           EXIT.                     00021500
      *----------------------------------------------------------------*00021600
                                                                        00021700
      *----------------------------------------------------------------*00021800
      ******************************************************************00021900
      *                       I N I C I A R                            *00022000
      ******************************************************************00022100
                                                                        00022200
      *----------------------------------------------------------------*00022300
       1000-INICIAR                           SECTION.                  00022400
      *----------------------------------------------------------------*00022500
                                                                        00022600
           OPEN INPUT MOV2505A                                          00022704
                OUTPUT RELAEX03                                         00022804
           PERFORM 1100-TESTAR-STATUS.                                  00022900
                                                                        00023000
      *----------------------------------------------------------------*00023100
       1000-99-FIM.                            EXIT.                    00023200
      *----------------------------------------------------------------*00023300
                                                                        00023400
                                                                        00023500
      ******************************************************************00023600
      *                   T E S T A R  S T A T U S                     *00023700
      ******************************************************************00023800
                                                                        00023900
      *----------------------------------------------------------------*00024000
       1100-TESTAR-STATUS                    SECTION.                   00024100
      *----------------------------------------------------------------*00024200
                                                                        00024300
            PERFORM 1110-TESTAR-WRK-FS-MOV2505A                         00024404
                                                                        00024500
            PERFORM 1120-TESTAR-WRK-FS-RELAEX03.                        00024604
                                                                        00024700
      *----------------------------------------------------------------*00024800
       1100-99-FIM.                            EXIT.                    00025000
      *----------------------------------------------------------------*00026000
                                                                        00027000
      ******************************************************************00028000
      *           TESTAR ARQUIVO DE ENTRADA - WRK-FS-MOV2505A          *00029004
      ******************************************************************00030000
                                                                        00040000
      *----------------------------------------------------------------*00041000
       1110-TESTAR-WRK-FS-MOV2505A        SECTION.                      00042004
      *----------------------------------------------------------------*00043000
                                                                        00044000
           IF WRK-FS-MOV2505A NOT EQUAL ZEROS                           00045004
              MOVE 'ERRO NO ARQUIVO MOV2505A' TO WRK-MSG                00045104
              PERFORM 9000-TRATAR-ERRO                                  00045200
           END-IF.                                                      00045300
                                                                        00045400
      *----------------------------------------------------------------*00045500
       1110-99-FIM.                            EXIT.                    00045600
      *----------------------------------------------------------------*00045700
                                                                        00045800
      ******************************************************************00045900
      *           TESTAR ARQUIVO DE SAIDA - WRK-FS-RELAEX03            *00046004
      ******************************************************************00047000
                                                                        00047100
      *----------------------------------------------------------------*00047200
       1120-TESTAR-WRK-FS-RELAEX03             SECTION.                 00047304
      *----------------------------------------------------------------*00047400
                                                                        00047500
           IF WRK-FS-RELAEX03 NOT EQUAL ZEROS                           00047604
              MOVE 'ERRO NA ABERTURA DO RELAT' TO WRK-MSG               00047700
              PERFORM 9000-TRATAR-ERRO                                  00047800
           END-IF.                                                      00047900
                                                                        00048000
      *----------------------------------------------------------------*00048100
       1120-99-FIM.                            EXIT.                    00048200
      *----------------------------------------------------------------*00048300
      ******************************************************************00048400
      *                  V E R I F I C A R  V A Z I O                  *00048500
      ******************************************************************00048600
                                                                        00048700
      *----------------------------------------------------------------*00048800
       2000-VERIFICAR-VAZIO                 SECTION.                    00048900
      *----------------------------------------------------------------*00049000
            PERFORM 2100-LEITURA                                        00050000
                                                                        00050100
               IF WRK-FS-MOV2505A  EQUAL 10                             00050204
                  DISPLAY '********************************'            00050300
                  DISPLAY '                                '            00050400
                  DISPLAY '  ARQUIVO MOV2505A ESTA VAZIO   '            00050504
                  DISPLAY '    PROCESSAMENTO ENCERRADO     '            00050600
                  DISPLAY '                                '            00050700
                  DISPLAY '********************************'            00050800
               END-IF.                                                  00050900
                                                                        00051000
      *----------------------------------------------------------------*00051100
       2000-99-FIM.                         EXIT.                       00051200
      *----------------------------------------------------------------*00051300
                                                                        00051400
      *----------------------------------------------------------------*00051500
       2100-LEITURA                         SECTION.                    00051600
      *----------------------------------------------------------------*00051700
            READ MOV2505A                                               00051807
                                                                        00051900
               IF WRK-FS-MOV2505A  EQUAL 10                             00052004
                  GO               TO 2100-99-FIM                       00053000
               END-IF.                                                  00053100
                                                                        00053200
               PERFORM 1110-TESTAR-WRK-FS-MOV2505A                      00053304
               ADD 1               TO WRK-LIDOS.                        00053400
      *----------------------------------------------------------------*00053500
       2100-99-FIM.                         EXIT.                       00053600
      *----------------------------------------------------------------*00053700
      ******************************************************************00053800
      *                     P R O C E S S A R                          *00053900
      ******************************************************************00054000
                                                                        00054100
      *----------------------------------------------------------------*00054200
       3000-PROCESSAR                        SECTION.                   00054300
      *----------------------------------------------------------------*00054400
                                                                        00054500
               IF WRK-LINHA          GREATER 5                          00054607
                  PERFORM 3100-GRAVAR-CABECALHO                         00054700
                  PERFORM 3200-GRAVAR-CAMPOS                            00054800
               END-IF.                                                  00054900
                                                                        00055000
               MOVE FD-MOV2505A-AGENCIA    TO WRK-CLI-AGENCIA           00055104
               MOVE FD-MOV2505A-CONTA      TO WRK-CLI-CONTA             00055204
               MOVE FD-MOV2505A-NOME       TO WRK-CLI-NOME              00055304
               MOVE FD-MOV2505A-SALDO      TO WRK-CLI-SALDO             00055407
               PERFORM 3300-GRAVAR-DETALHES.                            00055512
      *----------------------------------------------------------------*00055800
       3000-99-FIM.                           EXIT.                     00055900
      *----------------------------------------------------------------*00056000
      *----------------------------------------------------------------*00056100
       3100-GRAVAR-CABECALHO                 SECTION.                   00056200
      *----------------------------------------------------------------*00056300
               ADD 1               TO WRK-PAGINA                        00056400
               MOVE WRK-PAGINA     TO WRK-NUM-PAG                       00056507
               WRITE FD-RELAEX03   FROM WRK-CAB01 AFTER PAGE            00056604
               PERFORM 1120-TESTAR-WRK-FS-RELAEX03.                     00056713
      *----------------------------------------------------------------*00056900
       3100-99-FIM.                           EXIT.                     00057000
      *----------------------------------------------------------------*00057100
                                                                        00057200
      *----------------------------------------------------------------*00057300
       3200-GRAVAR-CAMPOS                     SECTION.                  00057400
      *----------------------------------------------------------------*00057500
               WRITE FD-RELAEX03   FROM WRK-CAB-CAMPOS                  00057604
               PERFORM 1120-TESTAR-WRK-FS-RELAEX03                      00057707
               MOVE 1              TO WRK-LINHA.                        00057808
      *----------------------------------------------------------------*00057900
       3200-99-FIM.                           EXIT.                     00058000
      *----------------------------------------------------------------*00058100
      *----------------------------------------------------------------*00058200
       3300-GRAVAR-DETALHES                  SECTION.                   00058300
      *----------------------------------------------------------------*00058400
                                                                        00058500
               WRITE FD-RELAEX03      FROM WRK-RELATORIO                00058609
               PERFORM 1120-TESTAR-WRK-FS-RELAEX03                      00058707
               ADD 1                  TO WRK-LINHA                      00058807
                                         WRK-GRAVADOS                   00058911
                                                                        00059000
               PERFORM 2100-LEITURA.                                    00059111
      *----------------------------------------------------------------*00059200
       3300-99-FIM.                           EXIT.                     00059300
      *----------------------------------------------------------------*00059400
      ******************************************************************00059500
      *                     F I N A L I Z A R                          *00059600
      ******************************************************************00059700
      *----------------------------------------------------------------*00059800
       4000-FINALIZAR                        SECTION.                   00059900
      *----------------------------------------------------------------*00060000
            IF WRK-LIDOS      GREATER ZEROS                             00060100
               PERFORM 4100-TOTAIS-LIDOS                                00060200
            END-IF                                                      00060300
                                                                        00060415
            MOVE WRK-GRAVADOS         TO WRK-SALDO-TOTAL                00060515
            WRITE FD-RELAEX03         FROM WRK-RODAPE                   00060614
                                                                        00060714
            CLOSE MOV2505A                                              00060804
                  RELAEX03                                              00060904
            IF WRK-FS-MOV2505A        NOT EQUAL ZEROS                   00061004
               MOVE 'ERRO NO FECHAMENTO CLIENTES' TO WRK-MSG            00061100
               PERFORM 9000-TRATAR-ERRO                                 00061200
               GO                                 TO 4000-99-FIM        00061300
            END-IF                                                      00061400
                                                                        00061500
            IF WRK-FS-RELAEX03        NOT EQUAL ZEROS                   00061604
               MOVE 'ERRO NO FECHAMENTO RELAT' TO WRK-MSG               00061700
               PERFORM 9000-TRATAR-ERRO                                 00061800
            END-IF.                                                     00061900
      *----------------------------------------------------------------*00062000
       4000-99-FIM.                           EXIT.                     00062100
      *----------------------------------------------------------------*00062200
                                                                        00062300
      ******************************************************************00062400
      *                    T O T A I S  L I D O S                      *00062500
      ******************************************************************00062600
      *----------------------------------------------------------------*00062700
       4100-TOTAIS-LIDOS                     SECTION.                   00062800
      *----------------------------------------------------------------*00062900
                                                                        00063000
                  DISPLAY '********************************'            00063100
                  DISPLAY '                                '            00063200
                  DISPLAY '  LIDOS   :  ' WRK-LIDOS                     00063300
                  DISPLAY '  GRAVADOS:  ' WRK-GRAVADOS                  00063400
                  DISPLAY '                                '            00063500
                  DISPLAY '********************************'.           00063600
                                                                        00063700
      *----------------------------------------------------------------*00063800
       4100-99-FIM.                           EXIT.                     00063900
      *----------------------------------------------------------------*00064000
      ******************************************************************00064100
      *                   T R A T A R  E R R O                         *00064200
      ******************************************************************00064300
                                                                        00064400
       9000-TRATAR-ERRO                     SECTION.                    00064500
      *----------------------------------------------------------------*00064600
                                                                        00064700
                  DISPLAY '********************************'            00064800
                  DISPLAY '                                '            00064900
                  DISPLAY '  ERRO: ' WRK-MSG                            00065000
                  DISPLAY '                                '            00065100
                  DISPLAY '********************************'            00065200
                  GOBACK.                                               00065300
      *----------------------------------------------------------------*00065400
       9000-99-FIM.                           EXIT.                     00065500
      *----------------------------------------------------------------*00066000
