//FOUR005X JOB 'COMP COB',MSGCLASS=X,CLASS=C,NOTIFY=&SYSUID             00010000
// JCLLIB ORDER=PR.FOUR001.PROCLIB                                      00020000
//COBCOMP  EXEC DFHCOBOL,NOME='RELATEX3'                                00030002
//SYSTERM  DD  SYSOUT=*                                                 00040000
//LKED.SYSIN    DD   *                                                  00050000
  NAME RELATEX3(R)                                                      00060002
//*--------------------------------------------------------------------*00070000
//*          FIM JOB DE COMPILACAO COBOL BATCH                         *00080000
//*--------------------------------------------------------------------*00090000
