//FOUR005X JOB 'COMP COB',MSGCLASS=X,CLASS=C,NOTIFY=&SYSUID,TIME=(0,02) 00010000
//STEP01   EXEC PGM=PROGLOG                                             00020002
//STEPLIB  DD DSN=PR.FOUR005.OBJ,DISP=SHR                               00030000
//LOGERROS DD DSN=PR.FOUR005.LOGERROS,DISP=OLD                          00050002
