//FOUR005X JOB 'COMP COB' MSGCLASS=X,CLASS=C,NOTIFY=&SYSUID             00010000
//EXECUTAR EXEC PGM=FR05CB20                                            00020000
//STEPLIB  DD DSN=PR.FOUR005.OBJ,DISP=SHR                               00030000
//SYSIN   DD*                                                           00040000
