//FOUR005X JOB 'COMP COB',MSGCLASS=X,CLASS=C,NOTIFY=&SYSUID             00010000
//EXECUTAR EXEC PGM=FR05CB23                                            00020001
//STEPLIB  DD DSN=PR.FOUR005.OBJ,DISP=SHR                               00030000
//SYSIN    DD *                                                         00040000
00800                                                                   00050000
